[Killed] EqualityOperator
lib/dashboardFilters.ts:66:39
       if (!processed.includes(r.status)) return false;
     }
     if (filters.query && !r.user?.name?.toLowerCase().includes(filters.query.toLowerCase())) return false;
-    if (filters.status !== "TODOS" && r.status !== filters.status) return false;
+    if (filters.status !== "TODOS" && r.status === filters.status) return false;
     return true;
   });
killedBy: filterRequests filters by status
statusReason: expected [ { userId: 'f1', …(4) } ] to have a length of +0 but got 1
