[Killed] StringLiteral
lib/auth.ts:6:24
 import { type Role } from "../generated/prisma/enums";
 import crypto from "crypto";
 
-const SESSION_COOKIE = "ds-ferias-session";
+const SESSION_COOKIE = "";
 const SESSION_MAX_AGE = 60 * 60 * 8; // 8h
 
killedBy: createSession sets cookie with user payload
statusReason: expected "vi.fn()" to be called with arguments: [ 'ds-ferias-session', …(2) ]

Received:

  1st vi.fn() call:

  [
-   "ds-ferias-session",

[Killed] ArithmeticOperator
lib/auth.ts:7:25
 import crypto from "crypto";
 
 const SESSION_COOKIE = "ds-ferias-session";
-const SESSION_MAX_AGE = 60 * 60 * 8; // 8h
+const SESSION_MAX_AGE = 60 * 60 / 8; // 8h
 
 export type SessionUser = {
killedBy: createSession sets cookie with user payload
statusReason: expected "vi.fn()" to be called with arguments: [ 'ds-ferias-session', …(2) ]

Received:

  1st vi.fn() call:

  [
    "ds-ferias-session",

[Killed] ArithmeticOperator
lib/auth.ts:7:25
 import crypto from "crypto";
 
 const SESSION_COOKIE = "ds-ferias-session";
-const SESSION_MAX_AGE = 60 * 60 * 8; // 8h
+const SESSION_MAX_AGE = 60 / 60 * 8; // 8h
 
 export type SessionUser = {
killedBy: createSession sets cookie with user payload
statusReason: expected "vi.fn()" to be called with arguments: [ 'ds-ferias-session', …(2) ]

Received:

  1st vi.fn() call:

  [
    "ds-ferias-session",

[Survived] BlockStatement
lib/auth.ts:16:44
   role: Role;
 };
 
-function getSessionSecret(): string | null {
-  const secret = process.env.SESSION_SECRET;
-  return secret && secret.length >= 16 ? secret : null;
-}
+function getSessionSecret(): string | null {}
 
 function signPayload(payload: string): string {

[Killed] LogicalOperator
lib/auth.ts:18:10
 
 function getSessionSecret(): string | null {
   const secret = process.env.SESSION_SECRET;
-  return secret && secret.length >= 16 ? secret : null;
+  return secret || secret.length >= 16 ? secret : null;
 }
 
killedBy: getSessionUser returns user when cookie has valid legacy JSON (no dot)
statusReason: expected null to deeply equal { id: 'u1', name: 'U', …(2) }

[Timeout] ConditionalExpression
lib/auth.ts:18:10
 
 function getSessionSecret(): string | null {
   const secret = process.env.SESSION_SECRET;
-  return secret && secret.length >= 16 ? secret : null;
+  return true ? secret : null;
 }
 

[Killed] BlockStatement
lib/auth.ts:21:47
   return secret && secret.length >= 16 ? secret : null;
 }
 
-function signPayload(payload: string): string {
-  const secret = getSessionSecret();
-  if (!secret) return payload;
-  const hmac = crypto.createHmac("sha256", secret);
-  hmac.update(payload);
-  return payload + "." + hmac.digest("base64url");
-}
+function signPayload(payload: string): string {}
 
 function verifyPayload(signed: string): string | null {
killedBy: getSessionUser returns user when SESSION_SECRET set and cookie is signed (createSession + getSessionUser)
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
lib/auth.ts:23:7
 
 function signPayload(payload: string): string {
   const secret = getSessionSecret();
-  if (!secret) return payload;
+  if (true) return payload;
   const hmac = crypto.createHmac("sha256", secret);
   hmac.update(payload);
killedBy: getSessionUser returns user when SESSION_SECRET set and cookie is signed (createSession + getSessionUser)
statusReason: expected null to deeply equal { id: 'u1', name: 'U', …(2) }

[Killed] BooleanLiteral
lib/auth.ts:23:7
 
 function signPayload(payload: string): string {
   const secret = getSessionSecret();
-  if (!secret) return payload;
+  if (secret) return payload;
   const hmac = crypto.createHmac("sha256", secret);
   hmac.update(payload);
killedBy: getSessionUser returns user when SESSION_SECRET set and cookie is signed (createSession + getSessionUser)
statusReason: expected null to deeply equal { id: 'u1', name: 'U', …(2) }

[Killed] StringLiteral
lib/auth.ts:26:20
   if (!secret) return payload;
   const hmac = crypto.createHmac("sha256", secret);
   hmac.update(payload);
-  return payload + "." + hmac.digest("base64url");
+  return payload + "" + hmac.digest("base64url");
 }
 
killedBy: getSessionUser returns user when SESSION_SECRET set and cookie is signed (createSession + getSessionUser)
statusReason: expected null to deeply equal { id: 'u1', name: 'U', …(2) }

[Killed] BlockStatement
lib/auth.ts:29:55
   return payload + "." + hmac.digest("base64url");
 }
 
-function verifyPayload(signed: string): string | null {
-  const secret = getSessionSecret();
-  if (!secret) return null;
-  try {
-    const lastDot = signed.lastIndexOf(".");
-    if (lastDot === -1) return null;
-    const payload = signed.slice(0, lastDot);
-    const sig = signed.slice(lastDot + 1);
-    const hmac = crypto.createHmac("sha256", secret);
-    hmac.update(payload);
-    const expected = hmac.digest("base64url");
-    if (crypto.timingSafeEqual(Buffer.from(sig, "base64url"), Buffer.from(expected, "base64url"))) {
-      return payload;
-    }
-  } catch {
-    // ignore
-  }
-  return null;
-}
+function verifyPayload(signed: string): string | null {}
 
 function hashPassword(password: string) {
killedBy: getSessionUser returns user when SESSION_SECRET set and cookie is signed (createSession + getSessionUser)
statusReason: expected null to deeply equal { id: 'u1', name: 'U', …(2) }

[Killed] ConditionalExpression
lib/auth.ts:31:7
 
 function verifyPayload(signed: string): string | null {
   const secret = getSessionSecret();
-  if (!secret) return null;
+  if (true) return null;
   try {
     const lastDot = signed.lastIndexOf(".");
killedBy: getSessionUser returns user when SESSION_SECRET set and cookie is signed (createSession + getSessionUser)
statusReason: expected null to deeply equal { id: 'u1', name: 'U', …(2) }

[Killed] BooleanLiteral
lib/auth.ts:31:7
 
 function verifyPayload(signed: string): string | null {
   const secret = getSessionSecret();
-  if (!secret) return null;
+  if (secret) return null;
   try {
     const lastDot = signed.lastIndexOf(".");
killedBy: getSessionUser returns user when SESSION_SECRET set and cookie is signed (createSession + getSessionUser)
statusReason: expected null to deeply equal { id: 'u1', name: 'U', …(2) }

[Killed] BlockStatement
lib/auth.ts:32:7
 function verifyPayload(signed: string): string | null {
   const secret = getSessionSecret();
   if (!secret) return null;
-  try {
-    const lastDot = signed.lastIndexOf(".");
-    if (lastDot === -1) return null;
-    const payload = signed.slice(0, lastDot);
-    const sig = signed.slice(lastDot + 1);
-    const hmac = crypto.createHmac("sha256", secret);
-    hmac.update(payload);
-    const expected = hmac.digest("base64url");
-    if (crypto.timingSafeEqual(Buffer.from(sig, "base64url"), Buffer.from(expected, "base64url"))) {
-      return payload;
-    }
-  } catch {
+  try {} catch {
     // ignore
   }
killedBy: getSessionUser returns user when SESSION_SECRET set and cookie is signed (createSession + getSessionUser)
statusReason: expected null to deeply equal { id: 'u1', name: 'U', …(2) }

[Killed] EqualityOperator
lib/auth.ts:34:9
   if (!secret) return null;
   try {
     const lastDot = signed.lastIndexOf(".");
-    if (lastDot === -1) return null;
+    if (lastDot !== -1) return null;
     const payload = signed.slice(0, lastDot);
     const sig = signed.slice(lastDot + 1);
killedBy: getSessionUser returns user when SESSION_SECRET set and cookie is signed (createSession + getSessionUser)
statusReason: expected null to deeply equal { id: 'u1', name: 'U', …(2) }

[Killed] ConditionalExpression
lib/auth.ts:34:9
   if (!secret) return null;
   try {
     const lastDot = signed.lastIndexOf(".");
-    if (lastDot === -1) return null;
+    if (true) return null;
     const payload = signed.slice(0, lastDot);
     const sig = signed.slice(lastDot + 1);
killedBy: getSessionUser returns user when SESSION_SECRET set and cookie is signed (createSession + getSessionUser)
statusReason: expected null to deeply equal { id: 'u1', name: 'U', …(2) }

[Killed] MethodExpression
lib/auth.ts:35:21
   try {
     const lastDot = signed.lastIndexOf(".");
     if (lastDot === -1) return null;
-    const payload = signed.slice(0, lastDot);
+    const payload = signed;
     const sig = signed.slice(lastDot + 1);
     const hmac = crypto.createHmac("sha256", secret);
killedBy: getSessionUser returns user when SESSION_SECRET set and cookie is signed (createSession + getSessionUser)
statusReason: expected null to deeply equal { id: 'u1', name: 'U', …(2) }

[Killed] MethodExpression
lib/auth.ts:36:17
     const lastDot = signed.lastIndexOf(".");
     if (lastDot === -1) return null;
     const payload = signed.slice(0, lastDot);
-    const sig = signed.slice(lastDot + 1);
+    const sig = signed;
     const hmac = crypto.createHmac("sha256", secret);
     hmac.update(payload);
killedBy: getSessionUser returns user when SESSION_SECRET set and cookie is signed (createSession + getSessionUser)
statusReason: expected null to deeply equal { id: 'u1', name: 'U', …(2) }

[Timeout] ArithmeticOperator
lib/auth.ts:36:30
     const lastDot = signed.lastIndexOf(".");
     if (lastDot === -1) return null;
     const payload = signed.slice(0, lastDot);
-    const sig = signed.slice(lastDot + 1);
+    const sig = signed.slice(lastDot - 1);
     const hmac = crypto.createHmac("sha256", secret);
     hmac.update(payload);

[Timeout] StringLiteral
lib/auth.ts:37:36
     if (lastDot === -1) return null;
     const payload = signed.slice(0, lastDot);
     const sig = signed.slice(lastDot + 1);
-    const hmac = crypto.createHmac("sha256", secret);
+    const hmac = crypto.createHmac("", secret);
     hmac.update(payload);
     const expected = hmac.digest("base64url");

[Killed] ConditionalExpression
lib/auth.ts:40:9
     const hmac = crypto.createHmac("sha256", secret);
     hmac.update(payload);
     const expected = hmac.digest("base64url");
-    if (crypto.timingSafeEqual(Buffer.from(sig, "base64url"), Buffer.from(expected, "base64url"))) {
+    if (false) {
       return payload;
     }
killedBy: getSessionUser returns user when SESSION_SECRET set and cookie is signed (createSession + getSessionUser)
statusReason: expected null to deeply equal { id: 'u1', name: 'U', …(2) }

[Killed] ConditionalExpression
lib/auth.ts:40:9
     const hmac = crypto.createHmac("sha256", secret);
     hmac.update(payload);
     const expected = hmac.digest("base64url");
-    if (crypto.timingSafeEqual(Buffer.from(sig, "base64url"), Buffer.from(expected, "base64url"))) {
+    if (true) {
       return payload;
     }
killedBy: getSessionUser returns null when SESSION_SECRET set but signature invalid
statusReason: expected { id: 'u1', name: 'U', …(2) } to be null

[Killed] BlockStatement
lib/auth.ts:49:41
   return null;
 }
 
-function hashPassword(password: string) {
-  return crypto.createHash("sha256").update(password).digest("hex");
-}
+function hashPassword(password: string) {}
 
 export async function verifyCredentials(email: string, password: string) {
killedBy: hashNewUserPassword returns hex string of fixed length for sha256
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] BlockStatement
lib/auth.ts:53:74
   return crypto.createHash("sha256").update(password).digest("hex");
 }
 
-export async function verifyCredentials(email: string, password: string) {
-  const user = await prisma.user.findUnique({ where: { email } });
-  if (!user) return null;
-
-  const hashed = hashPassword(password);
-  if (user.passwordHash !== hashed) {
-    if (process.env.NODE_ENV === "development") {
-      console.warn("[auth] Invalid credentials for", email);
-    }
-    return null;
-  }
-
-  return {
-    id: user.id,
-    name: user.name,
-    email: user.email,
-    role: user.role,
-  } as SessionUser;
-}
+export async function verifyCredentials(email: string, password: string) {}
 
 export async function getSessionUser(): Promise<SessionUser | null> {
killedBy: verifyCredentials returns null when user not found
statusReason: expected undefined to be null

[Killed] BooleanLiteral
lib/auth.ts:55:7
 
 export async function verifyCredentials(email: string, password: string) {
   const user = await prisma.user.findUnique({ where: { email } });
-  if (!user) return null;
+  if (user) return null;
 
   const hashed = hashPassword(password);
killedBy: verifyCredentials returns null when user not found
statusReason: Cannot read properties of null (reading 'passwordHash')

[Killed] ConditionalExpression
lib/auth.ts:55:7
 
 export async function verifyCredentials(email: string, password: string) {
   const user = await prisma.user.findUnique({ where: { email } });
-  if (!user) return null;
+  if (true) return null;
 
   const hashed = hashPassword(password);
killedBy: verifyCredentials returns session user when password matches
statusReason: expected null to deeply equal { id: 'u1', name: 'User', …(2) }

[Killed] BlockStatement
lib/auth.ts:58:37
   if (!user) return null;
 
   const hashed = hashPassword(password);
-  if (user.passwordHash !== hashed) {
-    if (process.env.NODE_ENV === "development") {
-      console.warn("[auth] Invalid credentials for", email);
-    }
-    return null;
-  }
+  if (user.passwordHash !== hashed) {}
 
   return {
killedBy: verifyCredentials returns null when password does not match
statusReason: expected { id: 'u1', name: 'User', …(2) } to be null

[Killed] EqualityOperator
lib/auth.ts:58:7
   if (!user) return null;
 
   const hashed = hashPassword(password);
-  if (user.passwordHash !== hashed) {
+  if (user.passwordHash === hashed) {
     if (process.env.NODE_ENV === "development") {
       console.warn("[auth] Invalid credentials for", email);
killedBy: verifyCredentials returns null when password does not match
statusReason: expected { id: 'u1', name: 'User', …(2) } to be null

[Timeout] ConditionalExpression
lib/auth.ts:59:9
 
   const hashed = hashPassword(password);
   if (user.passwordHash !== hashed) {
-    if (process.env.NODE_ENV === "development") {
+    if (true) {
       console.warn("[auth] Invalid credentials for", email);
     }

[Timeout] ConditionalExpression
lib/auth.ts:59:9
 
   const hashed = hashPassword(password);
   if (user.passwordHash !== hashed) {
-    if (process.env.NODE_ENV === "development") {
+    if (false) {
       console.warn("[auth] Invalid credentials for", email);
     }

[Killed] BlockStatement
lib/auth.ts:73:69
   } as SessionUser;
 }
 
-export async function getSessionUser(): Promise<SessionUser | null> {
-  const cookieStore = await cookies();
-  const raw = cookieStore.get(SESSION_COOKIE)?.value;
-  if (!raw) return null;
-
-  try {
-    let payload: string;
-    // Só tenta verificar assinatura quando SESSION_SECRET está definido; caso contrário o cookie
-    // é JSON legado (e pode conter "." no email, ex.: user@empresa.com).
-    if (getSessionSecret() && raw.includes(".")) {
-      payload = verifyPayload(raw) ?? "";
-      if (!payload) return null;
-    } else {
-      payload = raw;
-    }
-    const data = JSON.parse(payload) as SessionUser;
-    if (typeof data?.id !== "string" || typeof data?.email !== "string" || typeof data?.role !== "string") {
-      return null;
-    }
-    return data;
-  } catch {
-    return null;
-  }
-}
+export async function getSessionUser(): Promise<SessionUser | null> {}
 
 export async function createSession(user: SessionUser) {
killedBy: getSessionUser returns null when no cookie
statusReason: expected undefined to be null

[Killed] OptionalChaining
lib/auth.ts:75:15
 
 export async function getSessionUser(): Promise<SessionUser | null> {
   const cookieStore = await cookies();
-  const raw = cookieStore.get(SESSION_COOKIE)?.value;
+  const raw = cookieStore.get(SESSION_COOKIE).value;
   if (!raw) return null;
 
killedBy: getSessionUser returns null when no cookie
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] ConditionalExpression
lib/auth.ts:76:7
 export async function getSessionUser(): Promise<SessionUser | null> {
   const cookieStore = await cookies();
   const raw = cookieStore.get(SESSION_COOKIE)?.value;
-  if (!raw) return null;
+  if (true) return null;
 
   try {
killedBy: getSessionUser returns user when cookie has valid legacy JSON (no dot)
statusReason: expected null to deeply equal { id: 'u1', name: 'U', …(2) }

[Killed] BooleanLiteral
lib/auth.ts:76:7
 export async function getSessionUser(): Promise<SessionUser | null> {
   const cookieStore = await cookies();
   const raw = cookieStore.get(SESSION_COOKIE)?.value;
-  if (!raw) return null;
+  if (raw) return null;
 
   try {
killedBy: getSessionUser returns user when cookie has valid legacy JSON (no dot)
statusReason: expected null to deeply equal { id: 'u1', name: 'U', …(2) }

[Killed] BlockStatement
lib/auth.ts:78:7
   const raw = cookieStore.get(SESSION_COOKIE)?.value;
   if (!raw) return null;
 
-  try {
-    let payload: string;
-    // Só tenta verificar assinatura quando SESSION_SECRET está definido; caso contrário o cookie
-    // é JSON legado (e pode conter "." no email, ex.: user@empresa.com).
-    if (getSessionSecret() && raw.includes(".")) {
-      payload = verifyPayload(raw) ?? "";
-      if (!payload) return null;
-    } else {
-      payload = raw;
-    }
-    const data = JSON.parse(payload) as SessionUser;
-    if (typeof data?.id !== "string" || typeof data?.email !== "string" || typeof data?.role !== "string") {
-      return null;
-    }
-    return data;
-  } catch {
+  try {} catch {
     return null;
   }
killedBy: getSessionUser returns null when cookie value is invalid JSON
statusReason: expected undefined to be null

[Killed] LogicalOperator
lib/auth.ts:82:9
     let payload: string;
     // Só tenta verificar assinatura quando SESSION_SECRET está definido; caso contrário o cookie
     // é JSON legado (e pode conter "." no email, ex.: user@empresa.com).
-    if (getSessionSecret() && raw.includes(".")) {
+    if (getSessionSecret() || raw.includes(".")) {
       payload = verifyPayload(raw) ?? "";
       if (!payload) return null;
killedBy: getSessionUser returns user when cookie has valid legacy JSON (no dot)
statusReason: expected null to deeply equal { id: 'u1', name: 'U', …(2) }

[Killed] ConditionalExpression
lib/auth.ts:82:9
     let payload: string;
     // Só tenta verificar assinatura quando SESSION_SECRET está definido; caso contrário o cookie
     // é JSON legado (e pode conter "." no email, ex.: user@empresa.com).
-    if (getSessionSecret() && raw.includes(".")) {
+    if (true) {
       payload = verifyPayload(raw) ?? "";
       if (!payload) return null;
killedBy: getSessionUser returns user when cookie has valid legacy JSON (no dot)
statusReason: expected null to deeply equal { id: 'u1', name: 'U', …(2) }

[Killed] LogicalOperator
lib/auth.ts:83:17
     // Só tenta verificar assinatura quando SESSION_SECRET está definido; caso contrário o cookie
     // é JSON legado (e pode conter "." no email, ex.: user@empresa.com).
     if (getSessionSecret() && raw.includes(".")) {
-      payload = verifyPayload(raw) ?? "";
+      payload = verifyPayload(raw) && "";
       if (!payload) return null;
     } else {
killedBy: getSessionUser returns user when SESSION_SECRET set and cookie is signed (createSession + getSessionUser)
statusReason: expected null to deeply equal { id: 'u1', name: 'U', …(2) }

[Timeout] StringLiteral
lib/auth.ts:83:39
     // Só tenta verificar assinatura quando SESSION_SECRET está definido; caso contrário o cookie
     // é JSON legado (e pode conter "." no email, ex.: user@empresa.com).
     if (getSessionSecret() && raw.includes(".")) {
-      payload = verifyPayload(raw) ?? "";
+      payload = verifyPayload(raw) ?? "Stryker was here!";
       if (!payload) return null;
     } else {

[Killed] ConditionalExpression
lib/auth.ts:84:11
     // é JSON legado (e pode conter "." no email, ex.: user@empresa.com).
     if (getSessionSecret() && raw.includes(".")) {
       payload = verifyPayload(raw) ?? "";
-      if (!payload) return null;
+      if (true) return null;
     } else {
       payload = raw;
killedBy: getSessionUser returns user when SESSION_SECRET set and cookie is signed (createSession + getSessionUser)
statusReason: expected null to deeply equal { id: 'u1', name: 'U', …(2) }

[Killed] BooleanLiteral
lib/auth.ts:84:11
     // é JSON legado (e pode conter "." no email, ex.: user@empresa.com).
     if (getSessionSecret() && raw.includes(".")) {
       payload = verifyPayload(raw) ?? "";
-      if (!payload) return null;
+      if (payload) return null;
     } else {
       payload = raw;
killedBy: getSessionUser returns user when SESSION_SECRET set and cookie is signed (createSession + getSessionUser)
statusReason: expected null to deeply equal { id: 'u1', name: 'U', …(2) }

[Killed] BlockStatement
lib/auth.ts:85:12
     if (getSessionSecret() && raw.includes(".")) {
       payload = verifyPayload(raw) ?? "";
       if (!payload) return null;
-    } else {
-      payload = raw;
-    }
+    } else {}
     const data = JSON.parse(payload) as SessionUser;
     if (typeof data?.id !== "string" || typeof data?.email !== "string" || typeof data?.role !== "string") {
killedBy: getSessionUser returns user when cookie has valid legacy JSON (no dot)
statusReason: expected null to deeply equal { id: 'u1', name: 'U', …(2) }

[Killed] EqualityOperator
lib/auth.ts:89:41
       payload = raw;
     }
     const data = JSON.parse(payload) as SessionUser;
-    if (typeof data?.id !== "string" || typeof data?.email !== "string" || typeof data?.role !== "string") {
+    if (typeof data?.id !== "string" || typeof data?.email === "string" || typeof data?.role !== "string") {
       return null;
     }
killedBy: getSessionUser returns user when cookie has valid legacy JSON (no dot)
statusReason: expected null to deeply equal { id: 'u1', name: 'U', …(2) }

[Killed] BlockStatement
lib/auth.ts:89:108
       payload = raw;
     }
     const data = JSON.parse(payload) as SessionUser;
-    if (typeof data?.id !== "string" || typeof data?.email !== "string" || typeof data?.role !== "string") {
-      return null;
-    }
+    if (typeof data?.id !== "string" || typeof data?.email !== "string" || typeof data?.role !== "string") {}
     return data;
   } catch {
killedBy: getSessionUser returns null when payload missing required fields
statusReason: expected { id: 'u1' } to be null

[Killed] BlockStatement
lib/auth.ts:93:11
       return null;
     }
     return data;
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 
killedBy: getSessionUser returns null when cookie value is invalid JSON
statusReason: expected undefined to be null

[Killed] BlockStatement
lib/auth.ts:98:56
   }
 }
 
-export async function createSession(user: SessionUser) {
-  const cookieStore = await cookies();
-  const payload = JSON.stringify(user);
-  const signed = signPayload(payload);
-  cookieStore.set(SESSION_COOKIE, signed, {
-    httpOnly: true,
-    sameSite: "lax",
-    secure: process.env.NODE_ENV === "production",
-    path: "/",
-    maxAge: SESSION_MAX_AGE,
-  });
-}
+export async function createSession(user: SessionUser) {}
 
 export async function destroySession() {
killedBy: getSessionUser returns user when SESSION_SECRET set and cookie is signed (createSession + getSessionUser)
statusReason: Cannot read properties of undefined (reading '1')

[Killed] ObjectLiteral
lib/auth.ts:102:43
   const cookieStore = await cookies();
   const payload = JSON.stringify(user);
   const signed = signPayload(payload);
-  cookieStore.set(SESSION_COOKIE, signed, {
-    httpOnly: true,
-    sameSite: "lax",
-    secure: process.env.NODE_ENV === "production",
-    path: "/",
-    maxAge: SESSION_MAX_AGE,
-  });
+  cookieStore.set(SESSION_COOKIE, signed, {});
 }
 
killedBy: createSession sets cookie with user payload
statusReason: expected "vi.fn()" to be called with arguments: [ 'ds-ferias-session', …(2) ]

Received:

  1st vi.fn() call:

  [
    "ds-ferias-session",

[Killed] BooleanLiteral
lib/auth.ts:103:15
   const payload = JSON.stringify(user);
   const signed = signPayload(payload);
   cookieStore.set(SESSION_COOKIE, signed, {
-    httpOnly: true,
+    httpOnly: false,
     sameSite: "lax",
     secure: process.env.NODE_ENV === "production",
killedBy: createSession sets cookie with user payload
statusReason: expected "vi.fn()" to be called with arguments: [ 'ds-ferias-session', …(2) ]

Received:

  1st vi.fn() call:

  [
    "ds-ferias-session",

[Timeout] ConditionalExpression
lib/auth.ts:105:13
   cookieStore.set(SESSION_COOKIE, signed, {
     httpOnly: true,
     sameSite: "lax",
-    secure: process.env.NODE_ENV === "production",
+    secure: true,
     path: "/",
     maxAge: SESSION_MAX_AGE,

[Timeout] EqualityOperator
lib/auth.ts:105:13
   cookieStore.set(SESSION_COOKIE, signed, {
     httpOnly: true,
     sameSite: "lax",
-    secure: process.env.NODE_ENV === "production",
+    secure: process.env.NODE_ENV !== "production",
     path: "/",
     maxAge: SESSION_MAX_AGE,

[Killed] BlockStatement
lib/auth.ts:111:40
   });
 }
 
-export async function destroySession() {
-  const cookieStore = await cookies();
-  cookieStore.delete(SESSION_COOKIE);
-}
+export async function destroySession() {}
 
 export function hashNewUserPassword(password: string) {
killedBy: destroySession deletes session cookie
statusReason: expected "vi.fn()" to be called with arguments: [ 'ds-ferias-session' ]

Number of calls: 0

[Killed] BlockStatement
lib/auth.ts:116:55
   cookieStore.delete(SESSION_COOKIE);
 }
 
-export function hashNewUserPassword(password: string) {
-  return hashPassword(password);
-}
+export function hashNewUserPassword(password: string) {}
 
 
killedBy: hashNewUserPassword returns hex string of fixed length for sha256
statusReason: .toMatch() expects to receive a string, but got undefined
