[Killed] BlockStatement
lib/requestVisibility.ts:93:33
   const userLevel = getRoleLevel(userRole);
   const view = filters.view === "historico" ? "historico" : "inbox";
 
-  return requests.filter((r) => {
-    const managerId = r.user?.managerId ?? null;
-    const manager = r.user?.manager != null ? { managerId: r.user.manager.managerId ?? null } : null;
-    if (!hasTeamVisibility(userRole, userId, { userId: r.userId, user: { managerId, manager } })) {
-      return false;
-    }
-    if (getRoleLevel(userRole) >= 4 && filters.managerId && filters.managerId !== "ALL") {
-      if (r.user?.manager?.id !== filters.managerId) return false;
-    }
-    if (filters.department && r.user?.department !== filters.department) return false;
-    if (filters.from && r.startDate < new Date(filters.from)) return false;
-    if (filters.to && r.endDate > new Date(filters.to)) return false;
-    if (view === "inbox") {
-      if (userLevel === 2 && r.status !== "PENDENTE") return false;
-      if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
-      if (userLevel >= 4 && r.status !== "APROVADO_GERENTE") return false;
-    } else if (view === "historico") {
-      const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
-      if (!processed.includes(r.status)) return false;
-    }
-    if (filters.query?.trim() && !r.user?.name?.toLowerCase().includes(filters.query.trim().toLowerCase())) return false;
-    if (filters.status && filters.status !== "TODOS" && r.status !== filters.status) return false;
-    return true;
-  });
+  return requests.filter((r) => {});
 }
 
killedBy: filterRequestsByVisibilityAndView keeps request when coord has team visibility and inbox view
statusReason: expected [] to have a length of 1 but got +0

[Killed] MethodExpression
lib/requestVisibility.ts:93:10
   const userLevel = getRoleLevel(userRole);
   const view = filters.view === "historico" ? "historico" : "inbox";
 
-  return requests.filter((r) => {
-    const managerId = r.user?.managerId ?? null;
-    const manager = r.user?.manager != null ? { managerId: r.user.manager.managerId ?? null } : null;
-    if (!hasTeamVisibility(userRole, userId, { userId: r.userId, user: { managerId, manager } })) {
-      return false;
-    }
-    if (getRoleLevel(userRole) >= 4 && filters.managerId && filters.managerId !== "ALL") {
-      if (r.user?.manager?.id !== filters.managerId) return false;
-    }
-    if (filters.department && r.user?.department !== filters.department) return false;
-    if (filters.from && r.startDate < new Date(filters.from)) return false;
-    if (filters.to && r.endDate > new Date(filters.to)) return false;
-    if (view === "inbox") {
-      if (userLevel === 2 && r.status !== "PENDENTE") return false;
-      if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
-      if (userLevel >= 4 && r.status !== "APROVADO_GERENTE") return false;
-    } else if (view === "historico") {
-      const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
-      if (!processed.includes(r.status)) return false;
-    }
-    if (filters.query?.trim() && !r.user?.name?.toLowerCase().includes(filters.query.trim().toLowerCase())) return false;
-    if (filters.status && filters.status !== "TODOS" && r.status !== filters.status) return false;
-    return true;
-  });
+  return requests;
 }
 
killedBy: filterRequestsByVisibilityAndView filters out request when coord has no team visibility
statusReason: expected [ { userId: 'func-1', …(4) } ] to have a length of +0 but got 1

[Killed] BlockStatement
lib/requestVisibility.ts:105:27
     if (filters.department && r.user?.department !== filters.department) return false;
     if (filters.from && r.startDate < new Date(filters.from)) return false;
     if (filters.to && r.endDate > new Date(filters.to)) return false;
-    if (view === "inbox") {
-      if (userLevel === 2 && r.status !== "PENDENTE") return false;
-      if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
-      if (userLevel >= 4 && r.status !== "APROVADO_GERENTE") return false;
-    } else if (view === "historico") {
+    if (view === "inbox") {} else if (view === "historico") {
       const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
       if (!processed.includes(r.status)) return false;
killedBy: filterRequestsByVisibilityAndView filters out PENDENTE for coord in inbox (only PENDENTE shown)
statusReason: expected [ { userId: 'func-1', …(4) } ] to have a length of +0 but got 1

[Killed] EqualityOperator
lib/requestVisibility.ts:109:16
       if (userLevel === 2 && r.status !== "PENDENTE") return false;
       if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
       if (userLevel >= 4 && r.status !== "APROVADO_GERENTE") return false;
-    } else if (view === "historico") {
+    } else if (view !== "historico") {
       const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
       if (!processed.includes(r.status)) return false;
killedBy: filterRequestsByVisibilityAndView historico view: only processed statuses
statusReason: expected [ { userId: 'func-1', …(4) }, …(1) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
lib/requestVisibility.ts:109:16
       if (userLevel === 2 && r.status !== "PENDENTE") return false;
       if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
       if (userLevel >= 4 && r.status !== "APROVADO_GERENTE") return false;
-    } else if (view === "historico") {
+    } else if (false) {
       const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
       if (!processed.includes(r.status)) return false;
killedBy: filterRequestsByVisibilityAndView historico view: only processed statuses
statusReason: expected [ { userId: 'func-1', …(4) }, …(1) ] to have a length of 1 but got 2

[Killed] ArrayDeclaration
lib/requestVisibility.ts:110:25
       if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
       if (userLevel >= 4 && r.status !== "APROVADO_GERENTE") return false;
     } else if (view === "historico") {
-      const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
+      const processed = [];
       if (!processed.includes(r.status)) return false;
     }
killedBy: filterRequestsByVisibilityAndView historico view: only processed statuses
statusReason: expected [] to have a length of 1 but got +0

[Killed] StringLiteral
lib/requestVisibility.ts:110:89
       if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
       if (userLevel >= 4 && r.status !== "APROVADO_GERENTE") return false;
     } else if (view === "historico") {
-      const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
+      const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "", "REPROVADO", "CANCELADO"];
       if (!processed.includes(r.status)) return false;
     }
killedBy: filterRequestsByVisibilityAndView historico view: only processed statuses
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
lib/requestVisibility.ts:111:49
       if (userLevel >= 4 && r.status !== "APROVADO_GERENTE") return false;
     } else if (view === "historico") {
       const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
-      if (!processed.includes(r.status)) return false;
+      if (!processed.includes(r.status)) return true;
     }
     if (filters.query?.trim() && !r.user?.name?.toLowerCase().includes(filters.query.trim().toLowerCase())) return false;
killedBy: filterRequestsByVisibilityAndView historico view: only processed statuses
statusReason: expected [ { userId: 'func-1', …(4) }, …(1) ] to have a length of 1 but got 2

[Killed] LogicalOperator
lib/requestVisibility.ts:113:9
       const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
       if (!processed.includes(r.status)) return false;
     }
-    if (filters.query?.trim() && !r.user?.name?.toLowerCase().includes(filters.query.trim().toLowerCase())) return false;
+    if (filters.query?.trim() || !r.user?.name?.toLowerCase().includes(filters.query.trim().toLowerCase())) return false;
     if (filters.status && filters.status !== "TODOS" && r.status !== filters.status) return false;
     return true;
killedBy: filterRequestsByVisibilityAndView keeps request when coord has team visibility and inbox view
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] OptionalChaining
lib/requestVisibility.ts:113:9
       const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
       if (!processed.includes(r.status)) return false;
     }
-    if (filters.query?.trim() && !r.user?.name?.toLowerCase().includes(filters.query.trim().toLowerCase())) return false;
+    if (filters.query.trim() && !r.user?.name?.toLowerCase().includes(filters.query.trim().toLowerCase())) return false;
     if (filters.status && filters.status !== "TODOS" && r.status !== filters.status) return false;
     return true;
killedBy: filterRequestsByVisibilityAndView keeps request when coord has team visibility and inbox view
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] LogicalOperator
lib/requestVisibility.ts:114:9
       if (!processed.includes(r.status)) return false;
     }
     if (filters.query?.trim() && !r.user?.name?.toLowerCase().includes(filters.query.trim().toLowerCase())) return false;
-    if (filters.status && filters.status !== "TODOS" && r.status !== filters.status) return false;
+    if (filters.status && filters.status !== "TODOS" || r.status !== filters.status) return false;
     return true;
   });
killedBy: filterRequestsByVisibilityAndView keeps request when coord has team visibility and inbox view
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
lib/requestVisibility.ts:114:27
       if (!processed.includes(r.status)) return false;
     }
     if (filters.query?.trim() && !r.user?.name?.toLowerCase().includes(filters.query.trim().toLowerCase())) return false;
-    if (filters.status && filters.status !== "TODOS" && r.status !== filters.status) return false;
+    if (filters.status && filters.status === "TODOS" && r.status !== filters.status) return false;
     return true;
   });
killedBy: filterRequestsByVisibilityAndView filters by status
statusReason: expected [ { userId: 'func-1', …(4) } ] to have a length of +0 but got 1
