[Survived] StringLiteral
lib/vacationRules.ts:39:16
   COLABORADOR: "blue",
   FUNCIONARIO: "blue",
   GESTOR: "indigo",
-  COORDENADOR: "indigo",
+  COORDENADOR: "",
   GERENTE: "purple",
   RH: "emerald",

[Survived] StringLiteral
lib/vacationRules.ts:40:12
   FUNCIONARIO: "blue",
   GESTOR: "indigo",
   COORDENADOR: "indigo",
-  GERENTE: "purple",
+  GERENTE: "",
   RH: "emerald",
 };

[Killed] BlockStatement
lib/vacationRules.ts:62:69
  * Dado o papel do aprovador, retorna o próximo status da solicitação.
  * A progressão segue a hierarquia de cargos.
  */
-export function getNextApprovalStatus(approverRole: string): string {
-  const level = ROLE_LEVEL[approverRole] ?? 1;
-  if (level >= 4) return "APROVADO_RH";
-  if (level === 3) return "APROVADO_GERENTE";
-  return "APROVADO_COORDENADOR";
-}
+export function getNextApprovalStatus(approverRole: string): string {}
 
 /**
killedBy: getNextApprovalStatus returns APROVADO_COORDENADOR for level 2
statusReason: expected undefined to be 'APROVADO_COORDENADOR' // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:64:7
  */
 export function getNextApprovalStatus(approverRole: string): string {
   const level = ROLE_LEVEL[approverRole] ?? 1;
-  if (level >= 4) return "APROVADO_RH";
+  if (false) return "APROVADO_RH";
   if (level === 3) return "APROVADO_GERENTE";
   return "APROVADO_COORDENADOR";
killedBy: getNextApprovalStatus returns APROVADO_RH for level 4
statusReason: expected 'APROVADO_COORDENADOR' to be 'APROVADO_RH' // Object.is equality

[Killed] EqualityOperator
lib/vacationRules.ts:65:7
 export function getNextApprovalStatus(approverRole: string): string {
   const level = ROLE_LEVEL[approverRole] ?? 1;
   if (level >= 4) return "APROVADO_RH";
-  if (level === 3) return "APROVADO_GERENTE";
+  if (level !== 3) return "APROVADO_GERENTE";
   return "APROVADO_COORDENADOR";
 }
killedBy: getNextApprovalStatus returns APROVADO_COORDENADOR for level 2
statusReason: expected 'APROVADO_GERENTE' to be 'APROVADO_COORDENADOR' // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:65:7
 export function getNextApprovalStatus(approverRole: string): string {
   const level = ROLE_LEVEL[approverRole] ?? 1;
   if (level >= 4) return "APROVADO_RH";
-  if (level === 3) return "APROVADO_GERENTE";
+  if (false) return "APROVADO_GERENTE";
   return "APROVADO_COORDENADOR";
 }
killedBy: getNextApprovalStatus returns APROVADO_GERENTE for level 3
statusReason: expected 'APROVADO_COORDENADOR' to be 'APROVADO_GERENTE' // Object.is equality

[Killed] StringLiteral
lib/vacationRules.ts:66:10
   const level = ROLE_LEVEL[approverRole] ?? 1;
   if (level >= 4) return "APROVADO_RH";
   if (level === 3) return "APROVADO_GERENTE";
-  return "APROVADO_COORDENADOR";
+  return "";
 }
 
killedBy: getNextApprovalStatus returns APROVADO_COORDENADOR for level 2
statusReason: expected '' to be 'APROVADO_COORDENADOR' // Object.is equality

[Killed] EqualityOperator
lib/vacationRules.ts:85:7
   },
 ): boolean {
   // Não pode aprovar a própria solicitação
-  if (request.userId === approverUserId) return false;
+  if (request.userId !== approverUserId) return false;
 
   const approverLevel = ROLE_LEVEL[approverRole] ?? 1;
killedBy: canApproveRequest returns false when approver is the request owner (self-approval)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:91:7
   const requesterLevel = ROLE_LEVEL[request.user.role] ?? 1;
 
   // Aprovador deve ser de nível superior ao solicitante
-  if (approverLevel <= requesterLevel) return false;
+  if (true) return false;
 
   // Mapeamento de status → nível mínimo necessário para aprovar
killedBy: canApproveRequest returns true for Coordenador approving PENDENTE from Funcionario
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:97:10
   const requiredLevel = getRequiredApproverLevel(request.status, requesterLevel);
   if (requiredLevel === null) return false; // já está em estado terminal
 
-  return approverLevel >= requiredLevel;
+  return false;
 }
 
killedBy: canApproveRequest returns true for Coordenador approving PENDENTE from Funcionario
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
lib/vacationRules.ts:104:90
  * Retorna o nível mínimo necessário para aprovar uma solicitação
  * dado o status atual e o nível do solicitante.
  */
-function getRequiredApproverLevel(status: string, requesterLevel: number): number | null {
-  switch (status) {
-    case "PENDENTE":
-      // Precisa do próximo nível acima do solicitante
-      return requesterLevel + 1;
-    case "APROVADO_COORDENADOR":
-    case "APROVADO_GESTOR": // legado
-      // Precisa de Gerente (nível 3) ou superior
-      return 3;
-    case "APROVADO_GERENTE":
-      // Precisa de RH (nível 4)
-      return 4;
-    default:
-      // Status terminal: APROVADO_RH, REPROVADO, CANCELADO
-      return null;
-  }
-}
+function getRequiredApproverLevel(status: string, requesterLevel: number): number | null {}
 
 /**
killedBy: canApproveRequest returns true for Coordenador approving PENDENTE from Funcionario
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:106:5
  */
 function getRequiredApproverLevel(status: string, requesterLevel: number): number | null {
   switch (status) {
-    case "PENDENTE":
-      // Precisa do próximo nível acima do solicitante
-      return requesterLevel + 1;
+    case "PENDENTE":
     case "APROVADO_COORDENADOR":
     case "APROVADO_GESTOR": // legado
killedBy: canApproveRequest returns true for Coordenador approving PENDENTE from Funcionario
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
lib/vacationRules.ts:108:14
   switch (status) {
     case "PENDENTE":
       // Precisa do próximo nível acima do solicitante
-      return requesterLevel + 1;
+      return requesterLevel - 1;
     case "APROVADO_COORDENADOR":
     case "APROVADO_GESTOR": // legado
killedBy: getNextApprover returns Coordenador for PENDENTE from Funcionario
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
lib/vacationRules.ts:110:5
       // Precisa do próximo nível acima do solicitante
       return requesterLevel + 1;
     case "APROVADO_COORDENADOR":
-    case "APROVADO_GESTOR": // legado
-      // Precisa de Gerente (nível 3) ou superior
-      return 3;
+    case "APROVADO_GESTOR":
     case "APROVADO_GERENTE":
       // Precisa de RH (nível 4)
killedBy: getNextApprover returns Gerente for APROVADO_COORDENADOR
statusReason: expected 'RH' to contain 'Gerente'

[Survived] StringLiteral
lib/vacationRules.ts:110:10
       // Precisa do próximo nível acima do solicitante
       return requesterLevel + 1;
     case "APROVADO_COORDENADOR":
-    case "APROVADO_GESTOR": // legado
+    case "": // legado
       // Precisa de Gerente (nível 3) ou superior
       return 3;

[Killed] ConditionalExpression
lib/vacationRules.ts:113:5
     case "APROVADO_GESTOR": // legado
       // Precisa de Gerente (nível 3) ou superior
       return 3;
-    case "APROVADO_GERENTE":
-      // Precisa de RH (nível 4)
-      return 4;
+    case "APROVADO_GERENTE":
     default:
       // Status terminal: APROVADO_RH, REPROVADO, CANCELADO
killedBy: canApproveRequest returns true for RH approving APROVADO_GERENTE
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
lib/vacationRules.ts:133:8
 
   const levelToLabel: Record<number, string> = {
     2: "Coordenador(a)",
-    3: "Gerente",
+    3: "",
     4: "RH",
   };
killedBy: getNextApprover returns Gerente for APROVADO_COORDENADOR
statusReason: expected '' to contain 'Gerente'

[Killed] BlockStatement
lib/vacationRules.ts:144:67
  * Retorna as etapas do fluxo de aprovação para um solicitante.
  * Usado para renderizar o indicador de progresso.
  */
-export function getApprovalSteps(requesterRole: string): string[] {
-  const level = ROLE_LEVEL[requesterRole] ?? 1;
-
-  if (level >= 4) return []; // RH não precisa de aprovação de outros (ou precisa de GERENTE)
-  if (level === 3) return ["RH"]; // Gerente só precisa do RH
-  if (level === 2) return ["Gerente", "RH"]; // Coordenador: Gerente → RH
-  return ["Coordenador(a)", "Gerente", "RH"]; // Funcionário: todos os níveis
-}
+export function getApprovalSteps(requesterRole: string): string[] {}
 
 /**
killedBy: getApprovalSteps returns 3 steps for FUNCIONARIO
statusReason: expected undefined to deeply equal [ 'Coordenador(a)', 'Gerente', 'RH' ]

[Killed] EqualityOperator
lib/vacationRules.ts:147:7
 export function getApprovalSteps(requesterRole: string): string[] {
   const level = ROLE_LEVEL[requesterRole] ?? 1;
 
-  if (level >= 4) return []; // RH não precisa de aprovação de outros (ou precisa de GERENTE)
+  if (level < 4) return []; // RH não precisa de aprovação de outros (ou precisa de GERENTE)
   if (level === 3) return ["RH"]; // Gerente só precisa do RH
   if (level === 2) return ["Gerente", "RH"]; // Coordenador: Gerente → RH
killedBy: getApprovalSteps returns 3 steps for FUNCIONARIO
statusReason: expected [] to deeply equal [ 'Coordenador(a)', 'Gerente', 'RH' ]

[Killed] ConditionalExpression
lib/vacationRules.ts:147:7
 export function getApprovalSteps(requesterRole: string): string[] {
   const level = ROLE_LEVEL[requesterRole] ?? 1;
 
-  if (level >= 4) return []; // RH não precisa de aprovação de outros (ou precisa de GERENTE)
+  if (false) return []; // RH não precisa de aprovação de outros (ou precisa de GERENTE)
   if (level === 3) return ["RH"]; // Gerente só precisa do RH
   if (level === 2) return ["Gerente", "RH"]; // Coordenador: Gerente → RH
killedBy: getApprovalSteps returns empty for RH
statusReason: expected [ 'Coordenador(a)', 'Gerente', 'RH' ] to deeply equal []

[Killed] EqualityOperator
lib/vacationRules.ts:148:7
   const level = ROLE_LEVEL[requesterRole] ?? 1;
 
   if (level >= 4) return []; // RH não precisa de aprovação de outros (ou precisa de GERENTE)
-  if (level === 3) return ["RH"]; // Gerente só precisa do RH
+  if (level !== 3) return ["RH"]; // Gerente só precisa do RH
   if (level === 2) return ["Gerente", "RH"]; // Coordenador: Gerente → RH
   return ["Coordenador(a)", "Gerente", "RH"]; // Funcionário: todos os níveis
killedBy: getApprovalSteps returns 3 steps for FUNCIONARIO
statusReason: expected [ 'RH' ] to deeply equal [ 'Coordenador(a)', 'Gerente', 'RH' ]

[Killed] ConditionalExpression
lib/vacationRules.ts:148:7
   const level = ROLE_LEVEL[requesterRole] ?? 1;
 
   if (level >= 4) return []; // RH não precisa de aprovação de outros (ou precisa de GERENTE)
-  if (level === 3) return ["RH"]; // Gerente só precisa do RH
+  if (true) return ["RH"]; // Gerente só precisa do RH
   if (level === 2) return ["Gerente", "RH"]; // Coordenador: Gerente → RH
   return ["Coordenador(a)", "Gerente", "RH"]; // Funcionário: todos os níveis
killedBy: getApprovalSteps returns 3 steps for FUNCIONARIO
statusReason: expected [ 'RH' ] to deeply equal [ 'Coordenador(a)', 'Gerente', 'RH' ]

[Killed] ConditionalExpression
lib/vacationRules.ts:149:7
 
   if (level >= 4) return []; // RH não precisa de aprovação de outros (ou precisa de GERENTE)
   if (level === 3) return ["RH"]; // Gerente só precisa do RH
-  if (level === 2) return ["Gerente", "RH"]; // Coordenador: Gerente → RH
+  if (false) return ["Gerente", "RH"]; // Coordenador: Gerente → RH
   return ["Coordenador(a)", "Gerente", "RH"]; // Funcionário: todos os níveis
 }
killedBy: getApprovalSteps returns 2 steps for COORDENADOR
statusReason: expected [ 'Coordenador(a)', 'Gerente', 'RH' ] to deeply equal [ 'Gerente', 'RH' ]

[Killed] ConditionalExpression
lib/vacationRules.ts:149:7
 
   if (level >= 4) return []; // RH não precisa de aprovação de outros (ou precisa de GERENTE)
   if (level === 3) return ["RH"]; // Gerente só precisa do RH
-  if (level === 2) return ["Gerente", "RH"]; // Coordenador: Gerente → RH
+  if (true) return ["Gerente", "RH"]; // Coordenador: Gerente → RH
   return ["Coordenador(a)", "Gerente", "RH"]; // Funcionário: todos os níveis
 }
killedBy: getApprovalSteps returns 3 steps for FUNCIONARIO
statusReason: expected [ 'Gerente', 'RH' ] to deeply equal [ 'Coordenador(a)', 'Gerente', 'RH' ]

[Killed] StringLiteral
lib/vacationRules.ts:150:29
   if (level >= 4) return []; // RH não precisa de aprovação de outros (ou precisa de GERENTE)
   if (level === 3) return ["RH"]; // Gerente só precisa do RH
   if (level === 2) return ["Gerente", "RH"]; // Coordenador: Gerente → RH
-  return ["Coordenador(a)", "Gerente", "RH"]; // Funcionário: todos os níveis
+  return ["Coordenador(a)", "", "RH"]; // Funcionário: todos os níveis
 }
 
killedBy: getApprovalSteps returns 3 steps for FUNCIONARIO
statusReason: expected [ 'Coordenador(a)', '', 'RH' ] to deeply equal [ 'Coordenador(a)', 'Gerente', 'RH' ]

[Killed] BlockStatement
lib/vacationRules.ts:156:61
 /**
  * Retorna o progresso atual no fluxo de aprovação (etapa atual).
  */
-export function getApprovalProgress(status: string): number {
-  switch (status) {
-    case "PENDENTE": return 0;
-    case "APROVADO_COORDENADOR":
-    case "APROVADO_GESTOR": return 1;
-    case "APROVADO_GERENTE": return 2;
-    case "APROVADO_RH": return 3;
-    default: return 0;
-  }
-}
+export function getApprovalProgress(status: string): number {}
 
 // ============================================================
killedBy: getApprovalProgress returns 0 for PENDENTE
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:158:5
  */
 export function getApprovalProgress(status: string): number {
   switch (status) {
-    case "PENDENTE": return 0;
+    case "PENDENTE":
     case "APROVADO_COORDENADOR":
     case "APROVADO_GESTOR": return 1;
killedBy: getApprovalProgress returns 0 for PENDENTE
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:160:5
   switch (status) {
     case "PENDENTE": return 0;
     case "APROVADO_COORDENADOR":
-    case "APROVADO_GESTOR": return 1;
+    case "APROVADO_GESTOR":
     case "APROVADO_GERENTE": return 2;
     case "APROVADO_RH": return 3;
killedBy: getApprovalProgress returns 1 for APROVADO_COORDENADOR/APROVADO_GESTOR
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:161:5
     case "PENDENTE": return 0;
     case "APROVADO_COORDENADOR":
     case "APROVADO_GESTOR": return 1;
-    case "APROVADO_GERENTE": return 2;
+    case "APROVADO_GERENTE":
     case "APROVADO_RH": return 3;
     default: return 0;
killedBy: getApprovalProgress returns 2 for APROVADO_GERENTE
statusReason: expected 3 to be 2 // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:162:5
     case "APROVADO_COORDENADOR":
     case "APROVADO_GESTOR": return 1;
     case "APROVADO_GERENTE": return 2;
-    case "APROVADO_RH": return 3;
+    case "APROVADO_RH":
     default: return 0;
   }
killedBy: getApprovalProgress returns 3 for APROVADO_RH
statusReason: expected +0 to be 3 // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:163:5
     case "APROVADO_GESTOR": return 1;
     case "APROVADO_GERENTE": return 2;
     case "APROVADO_RH": return 3;
-    default: return 0;
+    default:
   }
 }
killedBy: getApprovalProgress returns 0 for REPROVADO
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:187:7
   },
 ): boolean {
   // RH vê tudo
-  if (approverRole === "RH") return true;
+  if (false) return true;
 
   // Coordenador/Gestor: vê apenas reportes diretos + próprias solicitações
killedBy: hasTeamVisibility RH sees all requests
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:190:7
   if (approverRole === "RH") return true;
 
   // Coordenador/Gestor: vê apenas reportes diretos + próprias solicitações
-  if (ROLE_LEVEL[approverRole] === 2) {
+  if (true) {
     return (
       request.user.managerId === approverUserId ||
killedBy: hasTeamVisibility Gerente sees direct and indirect reports
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
lib/vacationRules.ts:192:7
   // Coordenador/Gestor: vê apenas reportes diretos + próprias solicitações
   if (ROLE_LEVEL[approverRole] === 2) {
     return (
-      request.user.managerId === approverUserId ||
-      request.userId === approverUserId
+      request.user.managerId === approverUserId && request.userId === approverUserId
     );
   }
killedBy: hasTeamVisibility Coordenador sees only direct reports
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:192:7
   // Coordenador/Gestor: vê apenas reportes diretos + próprias solicitações
   if (ROLE_LEVEL[approverRole] === 2) {
     return (
-      request.user.managerId === approverUserId ||
-      request.userId === approverUserId
+      true
     );
   }
killedBy: hasTeamVisibility Coordenador sees only direct reports
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
lib/vacationRules.ts:198:39
   }
 
   // Gerente: vê reportes diretos (coordenadores) E seus subordinados (funcionários)
-  if (ROLE_LEVEL[approverRole] === 3) {
-    return (
-      request.user.managerId === approverUserId ||           // coordenador direto
-      request.user.manager?.managerId === approverUserId ||  // funcionário do coord
-      request.userId === approverUserId                       // própria solicitação
-    );
-  }
+  if (ROLE_LEVEL[approverRole] === 3) {}
 
   return false;
killedBy: hasTeamVisibility Gerente sees direct and indirect reports
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
lib/vacationRules.ts:200:7
   // Gerente: vê reportes diretos (coordenadores) E seus subordinados (funcionários)
   if (ROLE_LEVEL[approverRole] === 3) {
     return (
-      request.user.managerId === approverUserId ||           // coordenador direto
-      request.user.manager?.managerId === approverUserId ||  // funcionário do coord
-      request.userId === approverUserId                       // própria solicitação
+      (request.user.managerId === approverUserId ||
+// coordenador direto
+request.user.manager?.managerId === approverUserId) &&
+// funcionário do coord
+request.userId === approverUserId // própria solicitação                       // própria solicitação
     );
   }
killedBy: hasTeamVisibility Gerente sees direct and indirect reports
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
lib/vacationRules.ts:239:38
     const usedDays = calcUsedDays(approvedRequests, "APROVADO_RH", currentYear);
     const pendingDays = calcUsedDays(approvedRequests, "PENDENTE", currentYear) +
       calcUsedDays(approvedRequests, "APROVADO_COORDENADOR", currentYear) +
-      calcUsedDays(approvedRequests, "APROVADO_GESTOR", currentYear) +
+      calcUsedDays(approvedRequests, "", currentYear) +
       calcUsedDays(approvedRequests, "APROVADO_GERENTE", currentYear);
     return {

[Killed] ObjectLiteral
lib/vacationRules.ts:241:12
       calcUsedDays(approvedRequests, "APROVADO_COORDENADOR", currentYear) +
       calcUsedDays(approvedRequests, "APROVADO_GESTOR", currentYear) +
       calcUsedDays(approvedRequests, "APROVADO_GERENTE", currentYear);
-    return {
-      entitledDays: 30,
-      usedDays,
-      pendingDays,
-      availableDays: Math.max(0, 30 - usedDays - pendingDays),
-      cycleYear: currentYear,
-      hasEntitlement: true,
-      monthsWorked: 999,
-    };
+    return {};
   }
 
killedBy: calculateVacationBalance (null hireDate) returns hasEntitlement true and 30 entitled when hireDate is null
statusReason: expected undefined to be true // Object.is equality

[Killed] ArithmeticOperator
lib/vacationRules.ts:255:5
   const hire = new Date(hireDate);
   // Meses corridos (calendário): 12 meses = 1 período, 24 meses = 2 períodos (60 dias)
   let monthsWorked =
-    (today.getFullYear() - hire.getFullYear()) * 12 +
-    (today.getMonth() - hire.getMonth());
+    (today.getFullYear() - hire.getFullYear()) * 12 - (today.getMonth() - hire.getMonth());
   if (today.getDate() < hire.getDate()) monthsWorked -= 1;
   monthsWorked = Math.max(0, monthsWorked);
killedBy: calculateVacationBalance returns hasEntitlement false when hireDate is less than 12 months ago
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
lib/vacationRules.ts:257:7
   let monthsWorked =
     (today.getFullYear() - hire.getFullYear()) * 12 +
     (today.getMonth() - hire.getMonth());
-  if (today.getDate() < hire.getDate()) monthsWorked -= 1;
+  if (today.getDate() <= hire.getDate()) monthsWorked -= 1;
   monthsWorked = Math.max(0, monthsWorked);
 
killedBy: calculateVacationBalance returns 30 entitled when hireDate is 12+ months ago and no requests
statusReason: expected 30 to be 60 // Object.is equality

[Killed] ObjectLiteral
lib/vacationRules.ts:262:12
 
   if (monthsWorked < 12) {
     // Ainda não adquiriu férias
-    return {
-      entitledDays: 0,
-      usedDays: 0,
-      pendingDays: 0,
-      availableDays: 0,
-      cycleYear: currentYear,
-      hasEntitlement: false,
-      monthsWorked,
-    };
+    return {};
   }
 
killedBy: calculateVacationBalance returns hasEntitlement false when hireDate is less than 12 months ago
statusReason: expected undefined to be false // Object.is equality

[Survived] StringLiteral
lib/vacationRules.ts:285:44
   // Dias em aprovação (pendentes)
   const totalPending = approvedRequests
     .filter((r) =>
-      ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE"].includes(r.status),
+      ["PENDENTE", "APROVADO_COORDENADOR", "", "APROVADO_GERENTE"].includes(r.status),
     )
     .reduce((sum, r) => sum + calcDays(r.startDate, r.endDate), 0);

[Killed] BlockStatement
lib/vacationRules.ts:302:51
   };
 }
 
-function calcDays(start: Date, end: Date): number {
-  const s = new Date(start);
-  const e = new Date(end);
-  // Normaliza para meia-noite para evitar desvios de fuso/horário de verão
-  s.setHours(0, 0, 0, 0);
-  e.setHours(0, 0, 0, 0);
-  const raw = Math.round((e.getTime() - s.getTime()) / ONE_DAY_MS) + 1;
-  // CLT: um período de férias não pode exceder 30 dias; evita 31 por arredondamento/fuso
-  return Math.min(Math.max(1, raw), 30);
-}
+function calcDays(start: Date, end: Date): number {}
 
 function calcUsedDays(
killedBy: getCurrentUserBalance returns balance from findUserWithBalance
statusReason: expected NaN to be 15 // Object.is equality

[Killed] MethodExpression
lib/vacationRules.ts:306:3
   const s = new Date(start);
   const e = new Date(end);
   // Normaliza para meia-noite para evitar desvios de fuso/horário de verão
-  s.setHours(0, 0, 0, 0);
+  s.setMinutes(0, 0, 0, 0);
   e.setHours(0, 0, 0, 0);
   const raw = Math.round((e.getTime() - s.getTime()) / ONE_DAY_MS) + 1;
killedBy: getCurrentUserBalance returns balance from findUserWithBalance
statusReason: expected 14 to be 15 // Object.is equality

[Killed] MethodExpression
lib/vacationRules.ts:307:3
   const e = new Date(end);
   // Normaliza para meia-noite para evitar desvios de fuso/horário de verão
   s.setHours(0, 0, 0, 0);
-  e.setHours(0, 0, 0, 0);
+  e.setMinutes(0, 0, 0, 0);
   const raw = Math.round((e.getTime() - s.getTime()) / ONE_DAY_MS) + 1;
   // CLT: um período de férias não pode exceder 30 dias; evita 31 por arredondamento/fuso
killedBy: calculateVacationBalance counts used days from APROVADO_RH requests
statusReason: expected 16 to be 15 // Object.is equality

[Killed] ArithmeticOperator
lib/vacationRules.ts:308:15
   // Normaliza para meia-noite para evitar desvios de fuso/horário de verão
   s.setHours(0, 0, 0, 0);
   e.setHours(0, 0, 0, 0);
-  const raw = Math.round((e.getTime() - s.getTime()) / ONE_DAY_MS) + 1;
+  const raw = Math.round((e.getTime() - s.getTime()) / ONE_DAY_MS) - 1;
   // CLT: um período de férias não pode exceder 30 dias; evita 31 por arredondamento/fuso
   return Math.min(Math.max(1, raw), 30);
killedBy: calculateVacationBalance counts used days from APROVADO_RH requests
statusReason: expected 13 to be 15 // Object.is equality

[Killed] ArithmeticOperator
lib/vacationRules.ts:308:26
   // Normaliza para meia-noite para evitar desvios de fuso/horário de verão
   s.setHours(0, 0, 0, 0);
   e.setHours(0, 0, 0, 0);
-  const raw = Math.round((e.getTime() - s.getTime()) / ONE_DAY_MS) + 1;
+  const raw = Math.round((e.getTime() - s.getTime()) * ONE_DAY_MS) + 1;
   // CLT: um período de férias não pode exceder 30 dias; evita 31 por arredondamento/fuso
   return Math.min(Math.max(1, raw), 30);
killedBy: getCurrentUserBalance returns balance from findUserWithBalance
statusReason: expected 30 to be 15 // Object.is equality

[Killed] BlockStatement
lib/vacationRules.ts:317:11
   requests: { startDate: Date; endDate: Date; status: string }[],
   status: string,
   year: number,
-): number {
-  return requests
-    .filter((r) => r.status === status && new Date(r.startDate).getFullYear() === year)
-    .reduce((sum, r) => sum + calcDays(r.startDate, r.endDate), 0);
-}
+): number {}
 
 // ============================================================
killedBy: calculateVacationBalance (null hireDate) returns hasEntitlement true and 30 entitled when hireDate is null
statusReason: expected NaN to be 30 // Object.is equality

[Killed] MethodExpression
lib/vacationRules.ts:318:10
   status: string,
   year: number,
 ): number {
-  return requests
-    .filter((r) => r.status === status && new Date(r.startDate).getFullYear() === year)
+  return requests
     .reduce((sum, r) => sum + calcDays(r.startDate, r.endDate), 0);
 }
killedBy: calculateVacationBalance (null hireDate) counts pending days when hireDate is null (current year)
statusReason: expected 60 to be 15 // Object.is equality

[Killed] EqualityOperator
lib/vacationRules.ts:319:43
   year: number,
 ): number {
   return requests
-    .filter((r) => r.status === status && new Date(r.startDate).getFullYear() === year)
+    .filter((r) => r.status === status && new Date(r.startDate).getFullYear() !== year)
     .reduce((sum, r) => sum + calcDays(r.startDate, r.endDate), 0);
 }
killedBy: calculateVacationBalance (null hireDate) counts pending days when hireDate is null (current year)
statusReason: expected +0 to be 15 // Object.is equality

[Killed] EqualityOperator
lib/vacationRules.ts:319:20
   year: number,
 ): number {
   return requests
-    .filter((r) => r.status === status && new Date(r.startDate).getFullYear() === year)
+    .filter((r) => r.status !== status && new Date(r.startDate).getFullYear() === year)
     .reduce((sum, r) => sum + calcDays(r.startDate, r.endDate), 0);
 }
killedBy: calculateVacationBalance (null hireDate) counts pending days when hireDate is null (current year)
statusReason: expected 45 to be 15 // Object.is equality

[Killed] ArrowFunction
lib/vacationRules.ts:320:13
 ): number {
   return requests
     .filter((r) => r.status === status && new Date(r.startDate).getFullYear() === year)
-    .reduce((sum, r) => sum + calcDays(r.startDate, r.endDate), 0);
+    .reduce(() => undefined, 0);
 }
 
killedBy: calculateVacationBalance (null hireDate) counts pending days when hireDate is null (current year)
statusReason: expected NaN to be 15 // Object.is equality

[Killed] ArithmeticOperator
lib/vacationRules.ts:320:25
 ): number {
   return requests
     .filter((r) => r.status === status && new Date(r.startDate).getFullYear() === year)
-    .reduce((sum, r) => sum + calcDays(r.startDate, r.endDate), 0);
+    .reduce((sum, r) => sum - calcDays(r.startDate, r.endDate), 0);
 }
 
killedBy: calculateVacationBalance (null hireDate) counts pending days when hireDate is null (current year)
statusReason: expected -15 to be 15 // Object.is equality

[Survived] MethodExpression
lib/vacationRules.ts:329:3
 
 function isSaoPauloHoliday(date: Date): boolean {
   const d = new Date(date);
-  d.setHours(0, 0, 0, 0);
+  d.setMinutes(0, 0, 0, 0);
   const year = d.getFullYear();
   const month = d.getMonth() + 1; // 1-12

[Killed] ArithmeticOperator
lib/vacationRules.ts:331:17
   const d = new Date(date);
   d.setHours(0, 0, 0, 0);
   const year = d.getFullYear();
-  const month = d.getMonth() + 1; // 1-12
+  const month = d.getMonth() - 1; // 1-12
   const day = d.getDate();
 
killedBy: validateCltPeriods (overlap and 14 days) rejects when start is 2 days before holiday (checkAdvanceNotice)
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ArrayDeclaration
lib/vacationRules.ts:336:5
 
   // Fixos nacionais
   const fixed = [
-    [1, 1],   // 01/01 – Confraternização Universal
+    [],   // 01/01 – Confraternização Universal
     [4, 21],  // 21/04 – Tiradentes
     [5, 1],   // 01/05 – Dia do Trabalho
killedBy: validateCltPeriods (overlap and 14 days) rejects when start is 2 days before holiday (checkAdvanceNotice)
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string
