[Survived] ArrayDeclaration
lib/vacationRules.ts:340:5
     [4, 21],  // 21/04 – Tiradentes
     [5, 1],   // 01/05 – Dia do Trabalho
     [9, 7],   // 07/09 – Independência
-    [10, 12], // 12/10 – N. Sra Aparecida
+    [], // 12/10 – N. Sra Aparecida
     [11, 2],  // 02/11 – Finados
     [11, 15], // 15/11 – Proclamação da República

[Survived] ArrayDeclaration
lib/vacationRules.ts:342:5
     [9, 7],   // 07/09 – Independência
     [10, 12], // 12/10 – N. Sra Aparecida
     [11, 2],  // 02/11 – Finados
-    [11, 15], // 15/11 – Proclamação da República
+    [], // 15/11 – Proclamação da República
     [12, 25], // 25/12 – Natal
   ];

[Killed] ConditionalExpression
lib/vacationRules.ts:353:7
     [11, 20], // 20/11 – Consciência Negra (feriado municipal SP)
   ];
 
-  if (fixed.concat(fixedSp).some(([m, d0]) => m === month && d0 === day)) return true;
+  if (false) return true;
 
   // Móveis baseados na Páscoa: Carnaval (3ª feira), Sexta-Feira Santa, Corpus Christi
killedBy: validateCltPeriods (overlap and 14 days) rejects when start is 2 days before holiday (checkAdvanceNotice)
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Survived] ConditionalExpression
lib/vacationRules.ts:365:12
   return movables.some((h) => {
     const hd = new Date(h);
     hd.setHours(0, 0, 0, 0);
-    return hd.getTime() === d.getTime();
+    return false;
   });
 }

[Survived] ArithmeticOperator
lib/vacationRules.ts:383:24
   const d = Math.floor(b / 4);
   const e = b % 4;
   const f = Math.floor((b + 8) / 25);
-  const g = Math.floor((b - f + 1) / 3);
+  const g = Math.floor((b - f + 1) * 3);
   const h = (19 * a + b - d - g + 15) % 30;
   const i = Math.floor(c / 4);

[Survived] ArithmeticOperator
lib/vacationRules.ts:384:14
   const e = b % 4;
   const f = Math.floor((b + 8) / 25);
   const g = Math.floor((b - f + 1) / 3);
-  const h = (19 * a + b - d - g + 15) % 30;
+  const h = (19 * a + b - d - g - 15) % 30;
   const i = Math.floor(c / 4);
   const k = c % 4;

[Survived] ArithmeticOperator
lib/vacationRules.ts:387:14
   const h = (19 * a + b - d - g + 15) % 30;
   const i = Math.floor(c / 4);
   const k = c % 4;
-  const l = (32 + 2 * e + 2 * i - h - k) % 7;
+  const l = (32 + 2 * e - 2 * i - h - k) % 7;
   const m = Math.floor((a + 11 * h + 22 * l) / 451);
   const month = Math.floor((h + l - 7 * m + 114) / 31); // 3=mar, 4=abr

[Survived] ArithmeticOperator
lib/vacationRules.ts:387:14
   const h = (19 * a + b - d - g + 15) % 30;
   const i = Math.floor(c / 4);
   const k = c % 4;
-  const l = (32 + 2 * e + 2 * i - h - k) % 7;
+  const l = (32 - 2 * e + 2 * i - h - k) % 7;
   const m = Math.floor((a + 11 * h + 22 * l) / 451);
   const month = Math.floor((h + l - 7 * m + 114) / 31); // 3=mar, 4=abr

[Survived] ArithmeticOperator
lib/vacationRules.ts:388:38
   const i = Math.floor(c / 4);
   const k = c % 4;
   const l = (32 + 2 * e + 2 * i - h - k) % 7;
-  const m = Math.floor((a + 11 * h + 22 * l) / 451);
+  const m = Math.floor((a + 11 * h + 22 / l) / 451);
   const month = Math.floor((h + l - 7 * m + 114) / 31); // 3=mar, 4=abr
   const day = ((h + l - 7 * m + 114) % 31) + 1;

[Survived] ArithmeticOperator
lib/vacationRules.ts:390:25
   const l = (32 + 2 * e + 2 * i - h - k) % 7;
   const m = Math.floor((a + 11 * h + 22 * l) / 451);
   const month = Math.floor((h + l - 7 * m + 114) / 31); // 3=mar, 4=abr
-  const day = ((h + l - 7 * m + 114) % 31) + 1;
+  const day = ((h + l - 7 / m + 114) % 31) + 1;
   return new Date(year, month - 1, day);
 }

[Survived] ArithmeticOperator
lib/vacationRules.ts:390:17
   const l = (32 + 2 * e + 2 * i - h - k) % 7;
   const m = Math.floor((a + 11 * h + 22 * l) / 451);
   const month = Math.floor((h + l - 7 * m + 114) / 31); // 3=mar, 4=abr
-  const day = ((h + l - 7 * m + 114) % 31) + 1;
+  const day = ((h + l + 7 * m + 114) % 31) + 1;
   return new Date(year, month - 1, day);
 }

[Survived] StringLiteral
lib/vacationRules.ts:423:80
 
   const conflicting = teamMembers.filter((member) =>
     member.requests.some((r) => {
-      const isActive = ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH"].includes(r.status);
+      const isActive = ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR", "", "APROVADO_RH"].includes(r.status);
       if (!isActive) return false;
       // Overlap check: períodos se sobrepõem se start < r.end && end > r.start

[Survived] StringLiteral
lib/vacationRules.ts:423:37
 
   const conflicting = teamMembers.filter((member) =>
     member.requests.some((r) => {
-      const isActive = ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH"].includes(r.status);
+      const isActive = ["PENDENTE", "", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH"].includes(r.status);
       if (!isActive) return false;
       // Overlap check: períodos se sobrepõem se start < r.end && end > r.start

[Killed] ConditionalExpression
lib/vacationRules.ts:424:11
   const conflicting = teamMembers.filter((member) =>
     member.requests.some((r) => {
       const isActive = ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH"].includes(r.status);
-      if (!isActive) return false;
+      if (true) return false;
       // Overlap check: períodos se sobrepõem se start < r.end && end > r.start
       return new Date(start) < new Date(r.endDate) && new Date(end) > new Date(r.startDate);
killedBy: detectTeamConflicts detects conflict when member has overlapping approved request
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:426:14
       const isActive = ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH"].includes(r.status);
       if (!isActive) return false;
       // Overlap check: períodos se sobrepõem se start < r.end && end > r.start
-      return new Date(start) < new Date(r.endDate) && new Date(end) > new Date(r.startDate);
+      return false;
     }),
   );
killedBy: detectTeamConflicts detects conflict when member has overlapping approved request
statusReason: expected +0 to be 1 // Object.is equality

[Survived] EqualityOperator
lib/vacationRules.ts:437:16
     conflictingCount,
     teamSize,
     conflictPercent,
-    isBlocked: conflictPercent > 50,
+    isBlocked: conflictPercent <= 50,
     isWarning: conflictPercent > 30,
     names: conflicting.map((m) => m.name),

[Killed] BlockStatement
lib/vacationRules.ts:450:82
 /**
  * Validação CLT para UM bloco de férias.
  */
-export function validateCltPeriod(startDate: Date, endDate: Date): string | null {
-  const days = Math.round((endDate.getTime() - startDate.getTime()) / ONE_DAY_MS) + 1;
-
-  if (days < 5) return "Período mínimo de férias é de 5 dias corridos (CLT).";
-  if (days > 30) return "Período máximo em um único bloco é de 30 dias.";
-
-  const startWeekDay = new Date(startDate).getDay();
-  if (startWeekDay === 5 || startWeekDay === 6) {
-    return "O início das férias não pode ocorrer na sexta ou no sábado (art. 134, §3º, CLT).";
-  }
-  const endWeekDay = new Date(endDate).getDay();
-  if (endWeekDay === 0 || endWeekDay === 6) {
-    return "O término das férias não pode ocorrer no sábado ou no domingo (repouso semanal remunerado).";
-  }
-
-  const today = new Date();
-  const diffDays = Math.floor(
-    (new Date(startDate).setHours(0, 0, 0, 0) - today.setHours(0, 0, 0, 0)) / ONE_DAY_MS,
-  );
-
-  if (diffDays < 30) return "Aviso prévio mínimo de 30 dias não respeitado.";
-
-  return null;
-}
+export function validateCltPeriod(startDate: Date, endDate: Date): string | null {}
 
 /**
killedBy: validateCltPeriod rejects period < 5 days
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ArithmeticOperator
lib/vacationRules.ts:451:27
  * Validação CLT para UM bloco de férias.
  */
 export function validateCltPeriod(startDate: Date, endDate: Date): string | null {
-  const days = Math.round((endDate.getTime() - startDate.getTime()) / ONE_DAY_MS) + 1;
+  const days = Math.round((endDate.getTime() - startDate.getTime()) * ONE_DAY_MS) + 1;
 
   if (days < 5) return "Período mínimo de férias é de 5 dias corridos (CLT).";
killedBy: validateCltPeriod rejects period < 5 days
statusReason: expected 'Período máximo em um único bloco é de…' to contain '5'

[Killed] ArithmeticOperator
lib/vacationRules.ts:451:28
  * Validação CLT para UM bloco de férias.
  */
 export function validateCltPeriod(startDate: Date, endDate: Date): string | null {
-  const days = Math.round((endDate.getTime() - startDate.getTime()) / ONE_DAY_MS) + 1;
+  const days = Math.round((endDate.getTime() + startDate.getTime()) / ONE_DAY_MS) + 1;
 
   if (days < 5) return "Período mínimo de férias é de 5 dias corridos (CLT).";
killedBy: validateCltPeriod rejects period < 5 days
statusReason: expected 'Período máximo em um único bloco é de…' to contain '5'

[Killed] ConditionalExpression
lib/vacationRules.ts:453:7
 export function validateCltPeriod(startDate: Date, endDate: Date): string | null {
   const days = Math.round((endDate.getTime() - startDate.getTime()) / ONE_DAY_MS) + 1;
 
-  if (days < 5) return "Período mínimo de férias é de 5 dias corridos (CLT).";
+  if (false) return "Período mínimo de férias é de 5 dias corridos (CLT).";
   if (days > 30) return "Período máximo em um único bloco é de 30 dias.";
 
killedBy: validateCltPeriod rejects period < 5 days
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
lib/vacationRules.ts:457:49
   if (days > 30) return "Período máximo em um único bloco é de 30 dias.";
 
   const startWeekDay = new Date(startDate).getDay();
-  if (startWeekDay === 5 || startWeekDay === 6) {
-    return "O início das férias não pode ocorrer na sexta ou no sábado (art. 134, §3º, CLT).";
-  }
+  if (startWeekDay === 5 || startWeekDay === 6) {}
   const endWeekDay = new Date(endDate).getDay();
   if (endWeekDay === 0 || endWeekDay === 6) {
killedBy: validateCltPeriod (weekend) rejects start on Friday (local date)
statusReason: expected null to be truthy

[Killed] LogicalOperator
lib/vacationRules.ts:457:7
   if (days > 30) return "Período máximo em um único bloco é de 30 dias.";
 
   const startWeekDay = new Date(startDate).getDay();
-  if (startWeekDay === 5 || startWeekDay === 6) {
+  if (startWeekDay === 5 && startWeekDay === 6) {
     return "O início das férias não pode ocorrer na sexta ou no sábado (art. 134, §3º, CLT).";
   }
killedBy: validateCltPeriod (weekend) rejects start on Friday (local date)
statusReason: expected null to be truthy

[Killed] ConditionalExpression
lib/vacationRules.ts:461:27
     return "O início das férias não pode ocorrer na sexta ou no sábado (art. 134, §3º, CLT).";
   }
   const endWeekDay = new Date(endDate).getDay();
-  if (endWeekDay === 0 || endWeekDay === 6) {
+  if (endWeekDay === 0 || false) {
     return "O término das férias não pode ocorrer no sábado ou no domingo (repouso semanal remunerado).";
   }
killedBy: validateCltPeriod (weekend) rejects end on Saturday (local date)
statusReason: expected null to be truthy

[Killed] EqualityOperator
lib/vacationRules.ts:461:27
     return "O início das férias não pode ocorrer na sexta ou no sábado (art. 134, §3º, CLT).";
   }
   const endWeekDay = new Date(endDate).getDay();
-  if (endWeekDay === 0 || endWeekDay === 6) {
+  if (endWeekDay === 0 || endWeekDay !== 6) {
     return "O término das férias não pode ocorrer no sábado ou no domingo (repouso semanal remunerado).";
   }
killedBy: validateCltPeriod (weekend) rejects end on Saturday (local date)
statusReason: expected null to be truthy

[Killed] StringLiteral
lib/vacationRules.ts:462:12
   }
   const endWeekDay = new Date(endDate).getDay();
   if (endWeekDay === 0 || endWeekDay === 6) {
-    return "O término das férias não pode ocorrer no sábado ou no domingo (repouso semanal remunerado).";
+    return "";
   }
 
killedBy: validateCltPeriod (weekend) rejects end on Saturday (local date)
statusReason: expected '' to be truthy

[Survived] MethodExpression
lib/vacationRules.ts:467:6
 
   const today = new Date();
   const diffDays = Math.floor(
-    (new Date(startDate).setHours(0, 0, 0, 0) - today.setHours(0, 0, 0, 0)) / ONE_DAY_MS,
+    (new Date(startDate).setMinutes(0, 0, 0, 0) - today.setHours(0, 0, 0, 0)) / ONE_DAY_MS,
   );
 

[Survived] ArithmeticOperator
lib/vacationRules.ts:467:5
 
   const today = new Date();
   const diffDays = Math.floor(
-    (new Date(startDate).setHours(0, 0, 0, 0) - today.setHours(0, 0, 0, 0)) / ONE_DAY_MS,
+    (new Date(startDate).setHours(0, 0, 0, 0) - today.setHours(0, 0, 0, 0)) * ONE_DAY_MS,
   );
 

[Survived] ConditionalExpression
lib/vacationRules.ts:470:7
     (new Date(startDate).setHours(0, 0, 0, 0) - today.setHours(0, 0, 0, 0)) / ONE_DAY_MS,
   );
 
-  if (diffDays < 30) return "Aviso prévio mínimo de 30 dias não respeitado.";
+  if (false) return "Aviso prévio mínimo de 30 dias não respeitado.";
 
   return null;

[Survived] MethodExpression
lib/vacationRules.ts:494:18
   if (!periods.length) return "É necessário informar ao menos um período de férias.";
   if (periods.length > 3) return "As férias podem ser fracionadas em no máximo 3 períodos.";
 
-  const sorted = [...periods].sort((a, b) => a.start.getTime() - b.start.getTime());
+  const sorted = [...periods];
   const existingDays = options.existingDaysInCycle ?? 0;
 

[Killed] BlockStatement
lib/vacationRules.ts:499:43
 
   let hasPeriodWith14OrMore = false;
 
-  for (let i = 0; i < sorted.length; i++) {
-    const { start, end } = sorted[i];
-    if (isNaN(start.getTime()) || isNaN(end.getTime()) || end < start) {
-      return "Período de férias inválido.";
-    }
-
-    const days = Math.round((end.getTime() - start.getTime()) / ONE_DAY_MS) + 1;
-    if (days < 5) return "Cada período deve ter no mínimo 5 dias corridos.";
-    if (days >= 14) hasPeriodWith14OrMore = true;
-
-    // CLT (art. 134, §3º e interpretação): término não pode ser no sábado ou domingo (DSR)
-    const endWeekDay = end.getDay(); // 0 = domingo, 6 = sábado
-    if (endWeekDay === 0 || endWeekDay === 6) {
-      return "O término das férias não pode ocorrer no sábado ou no domingo (repouso semanal remunerado).";
-    }
-
-    if (i > 0 && start <= sorted[i - 1].end) {
-      return "Os períodos não podem se sobrepor.";
-    }
-  }
+  for (let i = 0; i < sorted.length; i++) {}
 
   // CLT: pelo menos um período de 14 dias no ciclo; se já há 14+ dias em outra solicitação, não exige nesta
killedBy: validateCltPeriods accepts period of 14 days with end on weekday (checkAdvanceNotice false)
statusReason: expected 'Pelo menos um período deve ter 14 dia…' to be null

[Killed] EqualityOperator
lib/vacationRules.ts:499:19
 
   let hasPeriodWith14OrMore = false;
 
-  for (let i = 0; i < sorted.length; i++) {
+  for (let i = 0; i >= sorted.length; i++) {
     const { start, end } = sorted[i];
     if (isNaN(start.getTime()) || isNaN(end.getTime()) || end < start) {
killedBy: validateCltPeriods accepts period of 14 days with end on weekday (checkAdvanceNotice false)
statusReason: expected 'Pelo menos um período deve ter 14 dia…' to be null

[Killed] ConditionalExpression
lib/vacationRules.ts:501:9
 
   for (let i = 0; i < sorted.length; i++) {
     const { start, end } = sorted[i];
-    if (isNaN(start.getTime()) || isNaN(end.getTime()) || end < start) {
+    if (true) {
       return "Período de férias inválido.";
     }
killedBy: validateCltPeriods requires at least one period of 14+ days when existingDaysInCycle < 14
statusReason: expected 'Período de férias inválido.' to contain '14'

[Killed] LogicalOperator
lib/vacationRules.ts:501:9
 
   for (let i = 0; i < sorted.length; i++) {
     const { start, end } = sorted[i];
-    if (isNaN(start.getTime()) || isNaN(end.getTime()) || end < start) {
+    if (isNaN(start.getTime()) && isNaN(end.getTime()) || end < start) {
       return "Período de férias inválido.";
     }
killedBy: validateCltPeriods (overlap and 14 days) rejects invalid period (NaN dates)
statusReason: expected 'O término das férias não pode ocorrer…' to contain 'inválido'

[Killed] StringLiteral
lib/vacationRules.ts:502:14
   for (let i = 0; i < sorted.length; i++) {
     const { start, end } = sorted[i];
     if (isNaN(start.getTime()) || isNaN(end.getTime()) || end < start) {
-      return "Período de férias inválido.";
+      return "";
     }
 
killedBy: validateCltPeriods (overlap and 14 days) rejects invalid period (end < start)
statusReason: expected '' to contain 'inválido'

[Killed] ArithmeticOperator
lib/vacationRules.ts:505:30
       return "Período de férias inválido.";
     }
 
-    const days = Math.round((end.getTime() - start.getTime()) / ONE_DAY_MS) + 1;
+    const days = Math.round((end.getTime() + start.getTime()) / ONE_DAY_MS) + 1;
     if (days < 5) return "Cada período deve ter no mínimo 5 dias corridos.";
     if (days >= 14) hasPeriodWith14OrMore = true;
killedBy: validateCltPeriods requires at least one period of 14+ days when existingDaysInCycle < 14
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ArithmeticOperator
lib/vacationRules.ts:505:29
       return "Período de férias inválido.";
     }
 
-    const days = Math.round((end.getTime() - start.getTime()) / ONE_DAY_MS) + 1;
+    const days = Math.round((end.getTime() - start.getTime()) * ONE_DAY_MS) + 1;
     if (days < 5) return "Cada período deve ter no mínimo 5 dias corridos.";
     if (days >= 14) hasPeriodWith14OrMore = true;
killedBy: validateCltPeriods requires at least one period of 14+ days when existingDaysInCycle < 14
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
lib/vacationRules.ts:506:9
     }
 
     const days = Math.round((end.getTime() - start.getTime()) / ONE_DAY_MS) + 1;
-    if (days < 5) return "Cada período deve ter no mínimo 5 dias corridos.";
+    if (true) return "Cada período deve ter no mínimo 5 dias corridos.";
     if (days >= 14) hasPeriodWith14OrMore = true;
 
killedBy: validateCltPeriods requires at least one period of 14+ days when existingDaysInCycle < 14
statusReason: expected 'Cada período deve ter no mínimo 5 dia…' to contain '14'

[Killed] EqualityOperator
lib/vacationRules.ts:506:9
     }
 
     const days = Math.round((end.getTime() - start.getTime()) / ONE_DAY_MS) + 1;
-    if (days < 5) return "Cada período deve ter no mínimo 5 dias corridos.";
+    if (days >= 5) return "Cada período deve ter no mínimo 5 dias corridos.";
     if (days >= 14) hasPeriodWith14OrMore = true;
 
killedBy: validateCltPeriods requires at least one period of 14+ days when existingDaysInCycle < 14
statusReason: expected 'Cada período deve ter no mínimo 5 dia…' to contain '14'

[Killed] ConditionalExpression
lib/vacationRules.ts:507:9
 
     const days = Math.round((end.getTime() - start.getTime()) / ONE_DAY_MS) + 1;
     if (days < 5) return "Cada período deve ter no mínimo 5 dias corridos.";
-    if (days >= 14) hasPeriodWith14OrMore = true;
+    if (true) hasPeriodWith14OrMore = true;
 
     // CLT (art. 134, §3º e interpretação): término não pode ser no sábado ou domingo (DSR)
killedBy: validateCltPeriods requires at least one period of 14+ days when existingDaysInCycle < 14
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
lib/vacationRules.ts:507:9
 
     const days = Math.round((end.getTime() - start.getTime()) / ONE_DAY_MS) + 1;
     if (days < 5) return "Cada período deve ter no mínimo 5 dias corridos.";
-    if (days >= 14) hasPeriodWith14OrMore = true;
+    if (false) hasPeriodWith14OrMore = true;
 
     // CLT (art. 134, §3º e interpretação): término não pode ser no sábado ou domingo (DSR)
killedBy: validateCltPeriods accepts period of 14 days with end on weekday (checkAdvanceNotice false)
statusReason: expected 'Pelo menos um período deve ter 14 dia…' to be null

[Killed] EqualityOperator
lib/vacationRules.ts:511:29
 
     // CLT (art. 134, §3º e interpretação): término não pode ser no sábado ou domingo (DSR)
     const endWeekDay = end.getDay(); // 0 = domingo, 6 = sábado
-    if (endWeekDay === 0 || endWeekDay === 6) {
+    if (endWeekDay === 0 || endWeekDay !== 6) {
       return "O término das férias não pode ocorrer no sábado ou no domingo (repouso semanal remunerado).";
     }
killedBy: validateCltPeriods requires at least one period of 14+ days when existingDaysInCycle < 14
statusReason: expected 'O término das férias não pode ocorrer…' to contain '14'

[Killed] EqualityOperator
lib/vacationRules.ts:511:9
 
     // CLT (art. 134, §3º e interpretação): término não pode ser no sábado ou domingo (DSR)
     const endWeekDay = end.getDay(); // 0 = domingo, 6 = sábado
-    if (endWeekDay === 0 || endWeekDay === 6) {
+    if (endWeekDay !== 0 || endWeekDay === 6) {
       return "O término das férias não pode ocorrer no sábado ou no domingo (repouso semanal remunerado).";
     }
killedBy: validateCltPeriods requires at least one period of 14+ days when existingDaysInCycle < 14
statusReason: expected 'O término das férias não pode ocorrer…' to contain '14'

[Killed] EqualityOperator
lib/vacationRules.ts:515:18
       return "O término das férias não pode ocorrer no sábado ou no domingo (repouso semanal remunerado).";
     }
 
-    if (i > 0 && start <= sorted[i - 1].end) {
+    if (i > 0 && start > sorted[i - 1].end) {
       return "Os períodos não podem se sobrepor.";
     }
killedBy: validateCltPeriods (overlap and 14 days) rejects overlapping periods (weekday ends)
statusReason: expected 'Pelo menos um período deve ter 14 dia…' to contain 'sobrepor'

[Killed] BlockStatement
lib/vacationRules.ts:515:46
       return "O término das férias não pode ocorrer no sábado ou no domingo (repouso semanal remunerado).";
     }
 
-    if (i > 0 && start <= sorted[i - 1].end) {
-      return "Os períodos não podem se sobrepor.";
-    }
+    if (i > 0 && start <= sorted[i - 1].end) {}
   }
 
killedBy: validateCltPeriods (overlap and 14 days) rejects overlapping periods (weekday ends)
statusReason: expected 'Pelo menos um período deve ter 14 dia…' to contain 'sobrepor'

[Killed] ConditionalExpression
lib/vacationRules.ts:521:7
   }
 
   // CLT: pelo menos um período de 14 dias no ciclo; se já há 14+ dias em outra solicitação, não exige nesta
-  if (existingDays < 14 && !hasPeriodWith14OrMore) {
+  if (true) {
     return "Pelo menos um período deve ter 14 dias ou mais (CLT).";
   }
killedBy: validateCltPeriods accepts period of 14 days with end on weekday (checkAdvanceNotice false)
statusReason: expected 'Pelo menos um período deve ter 14 dia…' to be null

[Killed] BooleanLiteral
lib/vacationRules.ts:521:28
   }
 
   // CLT: pelo menos um período de 14 dias no ciclo; se já há 14+ dias em outra solicitação, não exige nesta
-  if (existingDays < 14 && !hasPeriodWith14OrMore) {
+  if (existingDays < 14 && hasPeriodWith14OrMore) {
     return "Pelo menos um período deve ter 14 dias ou mais (CLT).";
   }
killedBy: validateCltPeriods requires at least one period of 14+ days when existingDaysInCycle < 14
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
lib/vacationRules.ts:525:47
     return "Pelo menos um período deve ter 14 dias ou mais (CLT).";
   }
 
-  const totalDays = sorted.reduce((acc, p) => {
-    return acc + Math.round((p.end.getTime() - p.start.getTime()) / ONE_DAY_MS) + 1;
-  }, 0);
+  const totalDays = sorted.reduce((acc, p) => {}, 0);
 
   const entitled = options.entitledDays ?? 30;
killedBy: validateCltPeriods (overlap and 14 days) rejects total cycle exceeding entitledDays
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ArithmeticOperator
lib/vacationRules.ts:526:12
   }
 
   const totalDays = sorted.reduce((acc, p) => {
-    return acc + Math.round((p.end.getTime() - p.start.getTime()) / ONE_DAY_MS) + 1;
+    return acc - Math.round((p.end.getTime() - p.start.getTime()) / ONE_DAY_MS) + 1;
   }, 0);
 
killedBy: validateCltPeriods (overlap and 14 days) rejects total cycle exceeding entitledDays
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ArithmeticOperator
lib/vacationRules.ts:526:29
   }
 
   const totalDays = sorted.reduce((acc, p) => {
-    return acc + Math.round((p.end.getTime() - p.start.getTime()) / ONE_DAY_MS) + 1;
+    return acc + Math.round((p.end.getTime() - p.start.getTime()) * ONE_DAY_MS) + 1;
   }, 0);
 
killedBy: validateCltPeriods accepts period of 14 days with end on weekday (checkAdvanceNotice false)
statusReason: expected 'Total do ciclo não pode ultrapassar 3…' to be null

[Killed] BlockStatement
lib/vacationRules.ts:531:32
 
   const entitled = options.entitledDays ?? 30;
   const totalInCycle = existingDays + totalDays;
-  if (totalInCycle > entitled) {
-    return `Total do ciclo não pode ultrapassar ${entitled} dias (seu direito). Você já tem ${existingDays} dias no ciclo e está solicitando ${totalDays} (total: ${totalInCycle}).`;
-  }
+  if (totalInCycle > entitled) {}
   // CLT art. 134, §1º: fracionamento permitido em até 3 períodos; não exige os 30 dias numa só solicitação.
   // Pode solicitar 14 agora e o restante depois, desde que um período tenha ≥14 dias e total no ciclo ≤ entitled.
killedBy: validateCltPeriods (overlap and 14 days) rejects total cycle exceeding entitledDays
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
lib/vacationRules.ts:537:7
   // CLT art. 134, §1º: fracionamento permitido em até 3 períodos; não exige os 30 dias numa só solicitação.
   // Pode solicitar 14 agora e o restante depois, desde que um período tenha ≥14 dias e total no ciclo ≤ entitled.
 
-  if (options.checkAdvanceNotice) {
+  if (true) {
     const firstStart = sorted[0].start;
     const today = new Date();
killedBy: validateCltPeriods accepts period of 14 days with end on weekday (checkAdvanceNotice false)
statusReason: expected 'O início das férias não pode ocorrer …' to be null

[Survived] ArithmeticOperator
lib/vacationRules.ts:541:8
     const firstStart = sorted[0].start;
     const today = new Date();
     const diffDays = Math.floor(
-      (firstStart.setHours(0, 0, 0, 0) - today.setHours(0, 0, 0, 0)) / ONE_DAY_MS,
+      (firstStart.setHours(0, 0, 0, 0) + today.setHours(0, 0, 0, 0)) / ONE_DAY_MS,
     );
     if (diffDays < 30) return "O primeiro período deve respeitar aviso prévio mínimo de 30 dias.";

[Survived] ArithmeticOperator
lib/vacationRules.ts:541:7
     const firstStart = sorted[0].start;
     const today = new Date();
     const diffDays = Math.floor(
-      (firstStart.setHours(0, 0, 0, 0) - today.setHours(0, 0, 0, 0)) / ONE_DAY_MS,
+      (firstStart.setHours(0, 0, 0, 0) - today.setHours(0, 0, 0, 0)) * ONE_DAY_MS,
     );
     if (diffDays < 30) return "O primeiro período deve respeitar aviso prévio mínimo de 30 dias.";

[Killed] EqualityOperator
lib/vacationRules.ts:549:26
     // no período de 2 dias que antecede feriado ou repouso semanal remunerado.
     // DSR: assumimos domingo → não permitir início na sexta (5) ou sábado (6).
     const weekDay = firstStart.getDay(); // 0 = domingo, 6 = sábado
-    if (weekDay === 5 || weekDay === 6) {
+    if (weekDay === 5 || weekDay !== 6) {
       return "O início das férias não pode ocorrer na sexta ou no sábado, conforme art. 134, §3º, da CLT.";
     }
killedBy: validateCltPeriods (overlap and 14 days) rejects when start is 2 days before holiday (checkAdvanceNotice)
statusReason: expected 'O início das férias não pode ocorrer …' to contain 'feriado'

[Killed] EqualityOperator
lib/vacationRules.ts:549:9
     // no período de 2 dias que antecede feriado ou repouso semanal remunerado.
     // DSR: assumimos domingo → não permitir início na sexta (5) ou sábado (6).
     const weekDay = firstStart.getDay(); // 0 = domingo, 6 = sábado
-    if (weekDay === 5 || weekDay === 6) {
+    if (weekDay !== 5 || weekDay === 6) {
       return "O início das férias não pode ocorrer na sexta ou no sábado, conforme art. 134, §3º, da CLT.";
     }
killedBy: validateCltPeriods (overlap and 14 days) rejects when start is 2 days before holiday (checkAdvanceNotice)
statusReason: expected 'O início das férias não pode ocorrer …' to contain 'feriado'
