[Killed] EqualityOperator
lib/vacationRules.ts:554:26
     }
 
     // Feriados (São Paulo capital + nacionais): não pode iniciar nos 2 dias que antecedem
-    for (let offset = 1; offset <= 2; offset++) {
+    for (let offset = 1; offset < 2; offset++) {
       const check = new Date(firstStart);
       check.setDate(check.getDate() + offset);
killedBy: validateCltPeriods (overlap and 14 days) rejects when start is 2 days before holiday (checkAdvanceNotice)
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ArithmeticOperator
lib/vacationRules.ts:556:21
     // Feriados (São Paulo capital + nacionais): não pode iniciar nos 2 dias que antecedem
     for (let offset = 1; offset <= 2; offset++) {
       const check = new Date(firstStart);
-      check.setDate(check.getDate() + offset);
+      check.setDate(check.getDate() - offset);
       if (isSaoPauloHoliday(check)) {
         return "O início das férias não pode ocorrer nos 2 dias que antecedem feriado, conforme art. 134, §3º, da CLT.";
killedBy: validateCltPeriods (overlap and 14 days) rejects when start is 2 days before holiday (checkAdvanceNotice)
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] MethodExpression
lib/vacationRules.ts:556:7
     // Feriados (São Paulo capital + nacionais): não pode iniciar nos 2 dias que antecedem
     for (let offset = 1; offset <= 2; offset++) {
       const check = new Date(firstStart);
-      check.setDate(check.getDate() + offset);
+      check.setTime(check.getDate() + offset);
       if (isSaoPauloHoliday(check)) {
         return "O início das férias não pode ocorrer nos 2 dias que antecedem feriado, conforme art. 134, §3º, da CLT.";
killedBy: validateCltPeriods (overlap and 14 days) rejects when start is 2 days before holiday (checkAdvanceNotice)
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
lib/vacationRules.ts:557:37
     for (let offset = 1; offset <= 2; offset++) {
       const check = new Date(firstStart);
       check.setDate(check.getDate() + offset);
-      if (isSaoPauloHoliday(check)) {
-        return "O início das férias não pode ocorrer nos 2 dias que antecedem feriado, conforme art. 134, §3º, da CLT.";
-      }
+      if (isSaoPauloHoliday(check)) {}
     }
   }
killedBy: validateCltPeriods (overlap and 14 days) rejects when start is 2 days before holiday (checkAdvanceNotice)
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
lib/vacationRules.ts:557:11
     for (let offset = 1; offset <= 2; offset++) {
       const check = new Date(firstStart);
       check.setDate(check.getDate() + offset);
-      if (isSaoPauloHoliday(check)) {
+      if (false) {
         return "O início das férias não pode ocorrer nos 2 dias que antecedem feriado, conforme art. 134, §3º, da CLT.";
       }
killedBy: validateCltPeriods (overlap and 14 days) rejects when start is 2 days before holiday (checkAdvanceNotice)
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BooleanLiteral
lib/vacationRules.ts:578:7
   for (const blackout of blackouts) {
     // Aplica se for geral (sem departamento) ou do mesmo departamento
     const applies =
-      !blackout.department ||
+      blackout.department ||
       !userDepartment ||
       blackout.department === userDepartment;
killedBy: checkBlackoutPeriods applies department-specific blackout only to same department
statusReason: expected 'Período bloqueado pela empresa: "TI" …' to be null

[Killed] BooleanLiteral
lib/vacationRules.ts:582:9
       !userDepartment ||
       blackout.department === userDepartment;
 
-    if (!applies) continue;
+    if (applies) continue;
 
     // Verifica sobreposição
killedBy: checkBlackoutPeriods returns message when request overlaps blackout
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
lib/vacationRules.ts:585:105
     if (!applies) continue;
 
     // Verifica sobreposição
-    if (new Date(start) <= new Date(blackout.endDate) && new Date(end) >= new Date(blackout.startDate)) {
-      const startFmt = new Date(blackout.startDate).toLocaleDateString("pt-BR");
-      const endFmt = new Date(blackout.endDate).toLocaleDateString("pt-BR");
-      return `Período bloqueado pela empresa: "${blackout.reason}" (${startFmt} – ${endFmt}).`;
-    }
+    if (new Date(start) <= new Date(blackout.endDate) && new Date(end) >= new Date(blackout.startDate)) {}
   }
   return null;
killedBy: checkBlackoutPeriods returns message when request overlaps blackout
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string
