[Survived] BlockStatement
services/teamMembersService.ts:11:12
 
 function isOnVacationNow(
   requests: Array<{ status: string; startDate: Date; endDate: Date }>
-): boolean {
-  const today = new Date();
-  today.setHours(0, 0, 0, 0);
-  return requests.some((r) => {
-    if (r.status !== "APROVADO_RH") return false;
-    const start = new Date(r.startDate);
-    const end = new Date(r.endDate);
-    start.setHours(0, 0, 0, 0);
-    end.setHours(0, 0, 0, 0);
-    return today >= start && today <= end;
-  });
-}
+): boolean {}
 

[Survived] MethodExpression
services/teamMembersService.ts:14:10
 ): boolean {
   const today = new Date();
   today.setHours(0, 0, 0, 0);
-  return requests.some((r) => {
-    if (r.status !== "APROVADO_RH") return false;
-    const start = new Date(r.startDate);
-    const end = new Date(r.endDate);
-    start.setHours(0, 0, 0, 0);
-    end.setHours(0, 0, 0, 0);
-    return today >= start && today <= end;
-  });
+  return requests.every(r => {
+  if (r.status !== "APROVADO_RH") return false;
+  const start = new Date(r.startDate);
+  const end = new Date(r.endDate);
+  start.setHours(0, 0, 0, 0);
+  end.setHours(0, 0, 0, 0);
+  return today >= start && today <= end;
+});
 }
 

[Survived] BlockStatement
services/teamMembersService.ts:14:31
 ): boolean {
   const today = new Date();
   today.setHours(0, 0, 0, 0);
-  return requests.some((r) => {
-    if (r.status !== "APROVADO_RH") return false;
-    const start = new Date(r.startDate);
-    const end = new Date(r.endDate);
-    start.setHours(0, 0, 0, 0);
-    end.setHours(0, 0, 0, 0);
-    return today >= start && today <= end;
-  });
+  return requests.some((r) => {});
 }
 

[Survived] ConditionalExpression
services/teamMembersService.ts:15:9
   const today = new Date();
   today.setHours(0, 0, 0, 0);
   return requests.some((r) => {
-    if (r.status !== "APROVADO_RH") return false;
+    if (true) return false;
     const start = new Date(r.startDate);
     const end = new Date(r.endDate);

[Survived] MethodExpression
services/teamMembersService.ts:18:5
     if (r.status !== "APROVADO_RH") return false;
     const start = new Date(r.startDate);
     const end = new Date(r.endDate);
-    start.setHours(0, 0, 0, 0);
+    start.setMinutes(0, 0, 0, 0);
     end.setHours(0, 0, 0, 0);
     return today >= start && today <= end;

[Killed] BooleanLiteral
services/teamMembersService.ts:61:11
     members.forEach((m, i) => {
       const u = users[i];
       const coordId = u?.managerId ?? "sem-coord";
-      if (!byCoord[coordId]) byCoord[coordId] = [];
+      if (byCoord[coordId]) byCoord[coordId] = [];
       byCoord[coordId].push(m);
     });
killedBy: getTeamMembersForTimes level 3 (gerente): returns coord structure with teams by coordenador
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] ConditionalExpression
services/teamMembersService.ts:83:9
     const m = members[i];
     const gerenteId = (u as { manager?: { manager?: { id: string; name: string } } }).manager?.manager?.id ?? "sem-gerente";
     const coordId = (u as { manager?: { id: string; name: string } }).manager?.id ?? "sem-coord";
-    if (!byGerente.has(gerenteId)) byGerente.set(gerenteId, new Map());
+    if (false) byGerente.set(gerenteId, new Map());
     const byCoord = byGerente.get(gerenteId)!;
     if (!byCoord.has(coordId)) byCoord.set(coordId, []);
killedBy: getTeamMembersForTimes level 4 (RH): returns rh structure with gerentes
statusReason: Cannot read properties of undefined (reading 'has')

[Killed] BooleanLiteral
services/teamMembersService.ts:85:9
     const coordId = (u as { manager?: { id: string; name: string } }).manager?.id ?? "sem-coord";
     if (!byGerente.has(gerenteId)) byGerente.set(gerenteId, new Map());
     const byCoord = byGerente.get(gerenteId)!;
-    if (!byCoord.has(coordId)) byCoord.set(coordId, []);
+    if (byCoord.has(coordId)) byCoord.set(coordId, []);
     byCoord.get(coordId)!.push(m);
   });
killedBy: getTeamMembersForTimes level 4 (RH): returns rh structure with gerentes
statusReason: Cannot read properties of undefined (reading 'push')
