[Killed] BlockStatement
lib/dashboardFilters.ts:7:40
 export function getManagerOptions(
   userRole: string,
   requests: Array<{ user?: { manager?: { id: string; name: string } | null } }>
-): Array<{ id: string; name: string }> {
-  if (getRoleLevel(userRole) < 4) return [];
-  return Array.from(
-    new Map(
-      requests
-        .filter((r): r is typeof r & { user: { manager: { id: string; name: string } } } => !!r.user?.manager?.id)
-        .map((r) => [r.user.manager.id, r.user.manager.name])
-    ).entries()
-  ).map(([id, name]) => ({ id, name }));
-}
+): Array<{ id: string; name: string }> {}
 
 export function getDepartmentOptions(
killedBy: getManagerOptions returns empty for role level < 4
statusReason: expected undefined to deeply equal []

[Killed] EqualityOperator
lib/dashboardFilters.ts:8:7
   userRole: string,
   requests: Array<{ user?: { manager?: { id: string; name: string } | null } }>
 ): Array<{ id: string; name: string }> {
-  if (getRoleLevel(userRole) < 4) return [];
+  if (getRoleLevel(userRole) >= 4) return [];
   return Array.from(
     new Map(
killedBy: getManagerOptions returns empty for role level < 4
statusReason: expected [ { id: 'g1', name: 'Gerente' } ] to deeply equal []

[Killed] EqualityOperator
lib/dashboardFilters.ts:8:7
   userRole: string,
   requests: Array<{ user?: { manager?: { id: string; name: string } | null } }>
 ): Array<{ id: string; name: string }> {
-  if (getRoleLevel(userRole) < 4) return [];
+  if (getRoleLevel(userRole) <= 4) return [];
   return Array.from(
     new Map(
killedBy: getManagerOptions returns unique managers for RH
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] MethodExpression
lib/dashboardFilters.ts:11:7
   if (getRoleLevel(userRole) < 4) return [];
   return Array.from(
     new Map(
-      requests
-        .filter((r): r is typeof r & { user: { manager: { id: string; name: string } } } => !!r.user?.manager?.id)
+      requests
         .map((r) => [r.user.manager.id, r.user.manager.name])
     ).entries()
killedBy: getManagerOptions skips requests without manager
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BooleanLiteral
lib/dashboardFilters.ts:12:94
   return Array.from(
     new Map(
       requests
-        .filter((r): r is typeof r & { user: { manager: { id: string; name: string } } } => !!r.user?.manager?.id)
+        .filter((r): r is typeof r & { user: { manager: { id: string; name: string } } } => !r.user?.manager?.id)
         .map((r) => [r.user.manager.id, r.user.manager.name])
     ).entries()
killedBy: getManagerOptions returns unique managers for RH
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] ArrowFunction
lib/dashboardFilters.ts:12:17
   return Array.from(
     new Map(
       requests
-        .filter((r): r is typeof r & { user: { manager: { id: string; name: string } } } => !!r.user?.manager?.id)
+        .filter(() => undefined)
         .map((r) => [r.user.manager.id, r.user.manager.name])
     ).entries()
killedBy: getManagerOptions returns unique managers for RH
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] ArrowFunction
lib/dashboardFilters.ts:13:14
     new Map(
       requests
         .filter((r): r is typeof r & { user: { manager: { id: string; name: string } } } => !!r.user?.manager?.id)
-        .map((r) => [r.user.manager.id, r.user.manager.name])
+        .map(() => undefined)
     ).entries()
   ).map(([id, name]) => ({ id, name }));
killedBy: getManagerOptions returns unique managers for RH
statusReason: Iterator value undefined is not an entry object

[Killed] ArrowFunction
lib/dashboardFilters.ts:15:9
         .filter((r): r is typeof r & { user: { manager: { id: string; name: string } } } => !!r.user?.manager?.id)
         .map((r) => [r.user.manager.id, r.user.manager.name])
     ).entries()
-  ).map(([id, name]) => ({ id, name }));
+  ).map(() => undefined);
 }
 
killedBy: getManagerOptions returns unique managers for RH
statusReason: expected [ undefined, undefined ] to deeply equal [ …(2) ]

[Killed] BlockStatement
lib/dashboardFilters.ts:20:13
 
 export function getDepartmentOptions(
   requests: Array<{ user?: { department?: string | null } }>
-): string[] {
-  const depts = new Set<string>();
-  requests.forEach((r) => {
-    if (r.user?.department) depts.add(r.user.department);
-  });
-  return Array.from(depts).sort();
-}
+): string[] {}
 
 type RequestForFilter = {
killedBy: getDepartmentOptions returns sorted unique departments
statusReason: expected undefined to deeply equal [ 'RH', 'TI' ]

[Killed] BlockStatement
lib/dashboardFilters.ts:22:27
   requests: Array<{ user?: { department?: string | null } }>
 ): string[] {
   const depts = new Set<string>();
-  requests.forEach((r) => {
-    if (r.user?.department) depts.add(r.user.department);
-  });
+  requests.forEach((r) => {});
   return Array.from(depts).sort();
 }
killedBy: getDepartmentOptions returns sorted unique departments
statusReason: expected [] to deeply equal [ 'RH', 'TI' ]

[Killed] ConditionalExpression
lib/dashboardFilters.ts:23:9
 ): string[] {
   const depts = new Set<string>();
   requests.forEach((r) => {
-    if (r.user?.department) depts.add(r.user.department);
+    if (false) depts.add(r.user.department);
   });
   return Array.from(depts).sort();
killedBy: getDepartmentOptions returns sorted unique departments
statusReason: expected [] to deeply equal [ 'RH', 'TI' ]

[Killed] ConditionalExpression
lib/dashboardFilters.ts:23:9
 ): string[] {
   const depts = new Set<string>();
   requests.forEach((r) => {
-    if (r.user?.department) depts.add(r.user.department);
+    if (true) depts.add(r.user.department);
   });
   return Array.from(depts).sort();
killedBy: getDepartmentOptions ignores null/undefined department
statusReason: expected [ null, undefined ] to deeply equal []

[Killed] MethodExpression
lib/dashboardFilters.ts:25:10
   requests.forEach((r) => {
     if (r.user?.department) depts.add(r.user.department);
   });
-  return Array.from(depts).sort();
+  return Array.from(depts);
 }
 
killedBy: getDepartmentOptions returns sorted unique departments
statusReason: expected [ 'TI', 'RH' ] to deeply equal [ 'RH', 'TI' ]

[Killed] BlockStatement
lib/dashboardFilters.ts:46:8
   userId: string,
   requests: T[],
   filters: DashboardFilters
-): T[] {
-  return requests.filter((r) => {
-    if (!hasTeamVisibility(userRole, userId, r as Parameters<typeof hasTeamVisibility>[2]))
-      return false;
-    if (getRoleLevel(userRole) >= 4 && filters.managerId && filters.managerId !== "ALL") {
-      if (r.user?.manager?.id !== filters.managerId) return false;
-    }
-    if (filters.department && r.user?.department !== filters.department) return false;
-    if (filters.from && new Date(r.startDate) < new Date(filters.from)) return false;
-    if (filters.to && new Date(r.endDate) > new Date(filters.to)) return false;
-    const userLevel = getRoleLevel(userRole);
-    if (filters.view === "inbox") {
-      if (userLevel === 2 && r.status !== "PENDENTE") return false;
-      if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
-      if (userLevel >= 4 && r.status !== "APROVADO_GERENTE") return false;
-    } else if (filters.view === "historico") {
-      const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
-      if (!processed.includes(r.status)) return false;
-    }
-    if (filters.query && !r.user?.name?.toLowerCase().includes(filters.query.toLowerCase())) return false;
-    if (filters.status !== "TODOS" && r.status !== filters.status) return false;
-    return true;
-  });
-}
+): T[] {}
 
 export function buildExportQuery(filters: DashboardFilters): string {
killedBy: filterRequests keeps request visible to coord with inbox view
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
lib/dashboardFilters.ts:47:33
   requests: T[],
   filters: DashboardFilters
 ): T[] {
-  return requests.filter((r) => {
-    if (!hasTeamVisibility(userRole, userId, r as Parameters<typeof hasTeamVisibility>[2]))
-      return false;
-    if (getRoleLevel(userRole) >= 4 && filters.managerId && filters.managerId !== "ALL") {
-      if (r.user?.manager?.id !== filters.managerId) return false;
-    }
-    if (filters.department && r.user?.department !== filters.department) return false;
-    if (filters.from && new Date(r.startDate) < new Date(filters.from)) return false;
-    if (filters.to && new Date(r.endDate) > new Date(filters.to)) return false;
-    const userLevel = getRoleLevel(userRole);
-    if (filters.view === "inbox") {
-      if (userLevel === 2 && r.status !== "PENDENTE") return false;
-      if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
-      if (userLevel >= 4 && r.status !== "APROVADO_GERENTE") return false;
-    } else if (filters.view === "historico") {
-      const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
-      if (!processed.includes(r.status)) return false;
-    }
-    if (filters.query && !r.user?.name?.toLowerCase().includes(filters.query.toLowerCase())) return false;
-    if (filters.status !== "TODOS" && r.status !== filters.status) return false;
-    return true;
-  });
+  return requests.filter((r) => {});
 }
 
killedBy: filterRequests keeps request visible to coord with inbox view
statusReason: expected [] to have a length of 1 but got +0

[Killed] MethodExpression
lib/dashboardFilters.ts:47:10
   requests: T[],
   filters: DashboardFilters
 ): T[] {
-  return requests.filter((r) => {
-    if (!hasTeamVisibility(userRole, userId, r as Parameters<typeof hasTeamVisibility>[2]))
-      return false;
-    if (getRoleLevel(userRole) >= 4 && filters.managerId && filters.managerId !== "ALL") {
-      if (r.user?.manager?.id !== filters.managerId) return false;
-    }
-    if (filters.department && r.user?.department !== filters.department) return false;
-    if (filters.from && new Date(r.startDate) < new Date(filters.from)) return false;
-    if (filters.to && new Date(r.endDate) > new Date(filters.to)) return false;
-    const userLevel = getRoleLevel(userRole);
-    if (filters.view === "inbox") {
-      if (userLevel === 2 && r.status !== "PENDENTE") return false;
-      if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
-      if (userLevel >= 4 && r.status !== "APROVADO_GERENTE") return false;
-    } else if (filters.view === "historico") {
-      const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
-      if (!processed.includes(r.status)) return false;
-    }
-    if (filters.query && !r.user?.name?.toLowerCase().includes(filters.query.toLowerCase())) return false;
-    if (filters.status !== "TODOS" && r.status !== filters.status) return false;
-    return true;
-  });
+  return requests;
 }
 
killedBy: filterRequests filters by department
statusReason: expected [ { userId: 'f1', …(4) } ] to have a length of +0 but got 1

[Killed] BooleanLiteral
lib/dashboardFilters.ts:48:9
   filters: DashboardFilters
 ): T[] {
   return requests.filter((r) => {
-    if (!hasTeamVisibility(userRole, userId, r as Parameters<typeof hasTeamVisibility>[2]))
+    if (hasTeamVisibility(userRole, userId, r as Parameters<typeof hasTeamVisibility>[2]))
       return false;
     if (getRoleLevel(userRole) >= 4 && filters.managerId && filters.managerId !== "ALL") {
killedBy: filterRequests keeps request visible to coord with inbox view
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
lib/dashboardFilters.ts:48:9
   filters: DashboardFilters
 ): T[] {
   return requests.filter((r) => {
-    if (!hasTeamVisibility(userRole, userId, r as Parameters<typeof hasTeamVisibility>[2]))
+    if (true)
       return false;
     if (getRoleLevel(userRole) >= 4 && filters.managerId && filters.managerId !== "ALL") {
killedBy: filterRequests keeps request visible to coord with inbox view
statusReason: expected [] to have a length of 1 but got +0

[Timeout] BooleanLiteral
lib/dashboardFilters.ts:49:14
 ): T[] {
   return requests.filter((r) => {
     if (!hasTeamVisibility(userRole, userId, r as Parameters<typeof hasTeamVisibility>[2]))
-      return false;
+      return true;
     if (getRoleLevel(userRole) >= 4 && filters.managerId && filters.managerId !== "ALL") {
       if (r.user?.manager?.id !== filters.managerId) return false;

[Killed] LogicalOperator
lib/dashboardFilters.ts:50:9
   return requests.filter((r) => {
     if (!hasTeamVisibility(userRole, userId, r as Parameters<typeof hasTeamVisibility>[2]))
       return false;
-    if (getRoleLevel(userRole) >= 4 && filters.managerId && filters.managerId !== "ALL") {
+    if (getRoleLevel(userRole) >= 4 && filters.managerId || filters.managerId !== "ALL") {
       if (r.user?.manager?.id !== filters.managerId) return false;
     }
killedBy: filterRequests keeps request visible to coord with inbox view
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
lib/dashboardFilters.ts:50:9
   return requests.filter((r) => {
     if (!hasTeamVisibility(userRole, userId, r as Parameters<typeof hasTeamVisibility>[2]))
       return false;
-    if (getRoleLevel(userRole) >= 4 && filters.managerId && filters.managerId !== "ALL") {
+    if (true) {
       if (r.user?.manager?.id !== filters.managerId) return false;
     }
killedBy: filterRequests keeps request visible to coord with inbox view
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
lib/dashboardFilters.ts:51:61
     if (!hasTeamVisibility(userRole, userId, r as Parameters<typeof hasTeamVisibility>[2]))
       return false;
     if (getRoleLevel(userRole) >= 4 && filters.managerId && filters.managerId !== "ALL") {
-      if (r.user?.manager?.id !== filters.managerId) return false;
+      if (r.user?.manager?.id !== filters.managerId) return true;
     }
     if (filters.department && r.user?.department !== filters.department) return false;
killedBy: filterRequests RH with managerId filter excludes other managers
statusReason: expected [ { userId: 'f1', …(4) } ] to have a length of +0 but got 1

[Timeout] ConditionalExpression
lib/dashboardFilters.ts:51:11
     if (!hasTeamVisibility(userRole, userId, r as Parameters<typeof hasTeamVisibility>[2]))
       return false;
     if (getRoleLevel(userRole) >= 4 && filters.managerId && filters.managerId !== "ALL") {
-      if (r.user?.manager?.id !== filters.managerId) return false;
+      if (true) return false;
     }
     if (filters.department && r.user?.department !== filters.department) return false;

[Killed] ConditionalExpression
lib/dashboardFilters.ts:53:9
     if (getRoleLevel(userRole) >= 4 && filters.managerId && filters.managerId !== "ALL") {
       if (r.user?.manager?.id !== filters.managerId) return false;
     }
-    if (filters.department && r.user?.department !== filters.department) return false;
+    if (true) return false;
     if (filters.from && new Date(r.startDate) < new Date(filters.from)) return false;
     if (filters.to && new Date(r.endDate) > new Date(filters.to)) return false;
killedBy: filterRequests keeps request visible to coord with inbox view
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
lib/dashboardFilters.ts:53:81
     if (getRoleLevel(userRole) >= 4 && filters.managerId && filters.managerId !== "ALL") {
       if (r.user?.manager?.id !== filters.managerId) return false;
     }
-    if (filters.department && r.user?.department !== filters.department) return false;
+    if (filters.department && r.user?.department !== filters.department) return true;
     if (filters.from && new Date(r.startDate) < new Date(filters.from)) return false;
     if (filters.to && new Date(r.endDate) > new Date(filters.to)) return false;
killedBy: filterRequests filters by department
statusReason: expected [ { userId: 'f1', …(4) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
lib/dashboardFilters.ts:54:9
       if (r.user?.manager?.id !== filters.managerId) return false;
     }
     if (filters.department && r.user?.department !== filters.department) return false;
-    if (filters.from && new Date(r.startDate) < new Date(filters.from)) return false;
+    if (true) return false;
     if (filters.to && new Date(r.endDate) > new Date(filters.to)) return false;
     const userLevel = getRoleLevel(userRole);
killedBy: filterRequests keeps request visible to coord with inbox view
statusReason: expected [] to have a length of 1 but got +0

[Timeout] EqualityOperator
lib/dashboardFilters.ts:54:25
       if (r.user?.manager?.id !== filters.managerId) return false;
     }
     if (filters.department && r.user?.department !== filters.department) return false;
-    if (filters.from && new Date(r.startDate) < new Date(filters.from)) return false;
+    if (filters.from && new Date(r.startDate) >= new Date(filters.from)) return false;
     if (filters.to && new Date(r.endDate) > new Date(filters.to)) return false;
     const userLevel = getRoleLevel(userRole);

[Killed] ConditionalExpression
lib/dashboardFilters.ts:55:9
     }
     if (filters.department && r.user?.department !== filters.department) return false;
     if (filters.from && new Date(r.startDate) < new Date(filters.from)) return false;
-    if (filters.to && new Date(r.endDate) > new Date(filters.to)) return false;
+    if (true) return false;
     const userLevel = getRoleLevel(userRole);
     if (filters.view === "inbox") {
killedBy: filterRequests keeps request visible to coord with inbox view
statusReason: expected [] to have a length of 1 but got +0

[Timeout] EqualityOperator
lib/dashboardFilters.ts:55:23
     }
     if (filters.department && r.user?.department !== filters.department) return false;
     if (filters.from && new Date(r.startDate) < new Date(filters.from)) return false;
-    if (filters.to && new Date(r.endDate) > new Date(filters.to)) return false;
+    if (filters.to && new Date(r.endDate) >= new Date(filters.to)) return false;
     const userLevel = getRoleLevel(userRole);
     if (filters.view === "inbox") {

[Killed] ConditionalExpression
lib/dashboardFilters.ts:57:9
     if (filters.from && new Date(r.startDate) < new Date(filters.from)) return false;
     if (filters.to && new Date(r.endDate) > new Date(filters.to)) return false;
     const userLevel = getRoleLevel(userRole);
-    if (filters.view === "inbox") {
+    if (true) {
       if (userLevel === 2 && r.status !== "PENDENTE") return false;
       if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
killedBy: filterRequests filters by view historico
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
lib/dashboardFilters.ts:57:9
     if (filters.from && new Date(r.startDate) < new Date(filters.from)) return false;
     if (filters.to && new Date(r.endDate) > new Date(filters.to)) return false;
     const userLevel = getRoleLevel(userRole);
-    if (filters.view === "inbox") {
+    if (filters.view !== "inbox") {
       if (userLevel === 2 && r.status !== "PENDENTE") return false;
       if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
killedBy: filterRequests filters by view historico
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
lib/dashboardFilters.ts:58:30
     if (filters.to && new Date(r.endDate) > new Date(filters.to)) return false;
     const userLevel = getRoleLevel(userRole);
     if (filters.view === "inbox") {
-      if (userLevel === 2 && r.status !== "PENDENTE") return false;
+      if (userLevel === 2 && true) return false;
       if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
       if (userLevel >= 4 && r.status !== "APROVADO_GERENTE") return false;
killedBy: filterRequests keeps request visible to coord with inbox view
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
lib/dashboardFilters.ts:58:30
     if (filters.to && new Date(r.endDate) > new Date(filters.to)) return false;
     const userLevel = getRoleLevel(userRole);
     if (filters.view === "inbox") {
-      if (userLevel === 2 && r.status !== "PENDENTE") return false;
+      if (userLevel === 2 && r.status === "PENDENTE") return false;
       if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
       if (userLevel >= 4 && r.status !== "APROVADO_GERENTE") return false;
killedBy: filterRequests keeps request visible to coord with inbox view
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
lib/dashboardFilters.ts:59:11
     const userLevel = getRoleLevel(userRole);
     if (filters.view === "inbox") {
       if (userLevel === 2 && r.status !== "PENDENTE") return false;
-      if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
+      if (true) return false;
       if (userLevel >= 4 && r.status !== "APROVADO_GERENTE") return false;
     } else if (filters.view === "historico") {
killedBy: filterRequests keeps request visible to coord with inbox view
statusReason: expected [] to have a length of 1 but got +0

[Timeout] BooleanLiteral
lib/dashboardFilters.ts:59:30
     const userLevel = getRoleLevel(userRole);
     if (filters.view === "inbox") {
       if (userLevel === 2 && r.status !== "PENDENTE") return false;
-      if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
+      if (userLevel === 3 && ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
       if (userLevel >= 4 && r.status !== "APROVADO_GERENTE") return false;
     } else if (filters.view === "historico") {

[Killed] ConditionalExpression
lib/dashboardFilters.ts:60:11
     if (filters.view === "inbox") {
       if (userLevel === 2 && r.status !== "PENDENTE") return false;
       if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
-      if (userLevel >= 4 && r.status !== "APROVADO_GERENTE") return false;
+      if (true) return false;
     } else if (filters.view === "historico") {
       const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
killedBy: filterRequests keeps request visible to coord with inbox view
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
lib/dashboardFilters.ts:60:11
     if (filters.view === "inbox") {
       if (userLevel === 2 && r.status !== "PENDENTE") return false;
       if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
-      if (userLevel >= 4 && r.status !== "APROVADO_GERENTE") return false;
+      if (true && r.status !== "APROVADO_GERENTE") return false;
     } else if (filters.view === "historico") {
       const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
killedBy: filterRequests keeps request visible to coord with inbox view
statusReason: expected [] to have a length of 1 but got +0

[Timeout] BlockStatement
lib/dashboardFilters.ts:61:46
       if (userLevel === 2 && r.status !== "PENDENTE") return false;
       if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
       if (userLevel >= 4 && r.status !== "APROVADO_GERENTE") return false;
-    } else if (filters.view === "historico") {
-      const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
-      if (!processed.includes(r.status)) return false;
-    }
+    } else if (filters.view === "historico") {}
     if (filters.query && !r.user?.name?.toLowerCase().includes(filters.query.toLowerCase())) return false;
     if (filters.status !== "TODOS" && r.status !== filters.status) return false;

[Timeout] ConditionalExpression
lib/dashboardFilters.ts:61:16
       if (userLevel === 2 && r.status !== "PENDENTE") return false;
       if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
       if (userLevel >= 4 && r.status !== "APROVADO_GERENTE") return false;
-    } else if (filters.view === "historico") {
+    } else if (true) {
       const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
       if (!processed.includes(r.status)) return false;

[Timeout] StringLiteral
lib/dashboardFilters.ts:62:50
       if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
       if (userLevel >= 4 && r.status !== "APROVADO_GERENTE") return false;
     } else if (filters.view === "historico") {
-      const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
+      const processed = ["APROVADO_COORDENADOR", "", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
       if (!processed.includes(r.status)) return false;
     }

[Killed] BooleanLiteral
lib/dashboardFilters.ts:63:11
       if (userLevel >= 4 && r.status !== "APROVADO_GERENTE") return false;
     } else if (filters.view === "historico") {
       const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
-      if (!processed.includes(r.status)) return false;
+      if (processed.includes(r.status)) return false;
     }
     if (filters.query && !r.user?.name?.toLowerCase().includes(filters.query.toLowerCase())) return false;
killedBy: filterRequests filters by view historico
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
lib/dashboardFilters.ts:63:11
       if (userLevel >= 4 && r.status !== "APROVADO_GERENTE") return false;
     } else if (filters.view === "historico") {
       const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
-      if (!processed.includes(r.status)) return false;
+      if (true) return false;
     }
     if (filters.query && !r.user?.name?.toLowerCase().includes(filters.query.toLowerCase())) return false;
killedBy: filterRequests filters by view historico
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
lib/dashboardFilters.ts:65:9
       const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
       if (!processed.includes(r.status)) return false;
     }
-    if (filters.query && !r.user?.name?.toLowerCase().includes(filters.query.toLowerCase())) return false;
+    if (true) return false;
     if (filters.status !== "TODOS" && r.status !== filters.status) return false;
     return true;
killedBy: filterRequests keeps request visible to coord with inbox view
statusReason: expected [] to have a length of 1 but got +0

[Timeout] ConditionalExpression
lib/dashboardFilters.ts:65:9
       const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
       if (!processed.includes(r.status)) return false;
     }
-    if (filters.query && !r.user?.name?.toLowerCase().includes(filters.query.toLowerCase())) return false;
+    if (false) return false;
     if (filters.status !== "TODOS" && r.status !== filters.status) return false;
     return true;

[Killed] ConditionalExpression
lib/dashboardFilters.ts:66:9
       if (!processed.includes(r.status)) return false;
     }
     if (filters.query && !r.user?.name?.toLowerCase().includes(filters.query.toLowerCase())) return false;
-    if (filters.status !== "TODOS" && r.status !== filters.status) return false;
+    if (true) return false;
     return true;
   });
killedBy: filterRequests keeps request visible to coord with inbox view
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
lib/dashboardFilters.ts:66:9
       if (!processed.includes(r.status)) return false;
     }
     if (filters.query && !r.user?.name?.toLowerCase().includes(filters.query.toLowerCase())) return false;
-    if (filters.status !== "TODOS" && r.status !== filters.status) return false;
+    if (true && r.status !== filters.status) return false;
     return true;
   });
killedBy: filterRequests keeps request visible to coord with inbox view
statusReason: expected [] to have a length of 1 but got +0

[Timeout] BooleanLiteral
lib/dashboardFilters.ts:67:12
     }
     if (filters.query && !r.user?.name?.toLowerCase().includes(filters.query.toLowerCase())) return false;
     if (filters.status !== "TODOS" && r.status !== filters.status) return false;
-    return true;
+    return false;
   });
 }
