[Killed] BlockStatement
lib/dashboardFilters.ts:71:69
   });
 }
 
-export function buildExportQuery(filters: DashboardFilters): string {
-  const params: Record<string, string> = {
-    q: filters.query,
-    status: filters.status || "TODOS",
-    view: filters.view,
-  };
-  if (filters.managerId) params.managerId = filters.managerId;
-  if (filters.from) params.from = filters.from;
-  if (filters.to) params.to = filters.to;
-  if (filters.department) params.department = filters.department;
-  return new URLSearchParams(params).toString();
-}
+export function buildExportQuery(filters: DashboardFilters): string {}
 
killedBy: buildExportQuery builds query string from filters
statusReason: expected null to be 'test' // Object.is equality

[Killed] ConditionalExpression
lib/dashboardFilters.ts:74:13
 export function buildExportQuery(filters: DashboardFilters): string {
   const params: Record<string, string> = {
     q: filters.query,
-    status: filters.status || "TODOS",
+    status: true,
     view: filters.view,
   };
killedBy: buildExportQuery builds query string from filters
statusReason: expected 'true' to be 'PENDENTE' // Object.is equality

[Killed] LogicalOperator
lib/dashboardFilters.ts:74:13
 export function buildExportQuery(filters: DashboardFilters): string {
   const params: Record<string, string> = {
     q: filters.query,
-    status: filters.status || "TODOS",
+    status: filters.status && "TODOS",
     view: filters.view,
   };
killedBy: buildExportQuery builds query string from filters
statusReason: expected 'TODOS' to be 'PENDENTE' // Object.is equality

[Killed] ConditionalExpression
lib/dashboardFilters.ts:77:7
     status: filters.status || "TODOS",
     view: filters.view,
   };
-  if (filters.managerId) params.managerId = filters.managerId;
+  if (false) params.managerId = filters.managerId;
   if (filters.from) params.from = filters.from;
   if (filters.to) params.to = filters.to;
killedBy: buildExportQuery builds query string from filters
statusReason: expected null to be 'g1' // Object.is equality

[Timeout] ConditionalExpression
lib/dashboardFilters.ts:77:7
     status: filters.status || "TODOS",
     view: filters.view,
   };
-  if (filters.managerId) params.managerId = filters.managerId;
+  if (true) params.managerId = filters.managerId;
   if (filters.from) params.from = filters.from;
   if (filters.to) params.to = filters.to;

[Killed] ConditionalExpression
lib/dashboardFilters.ts:78:7
     view: filters.view,
   };
   if (filters.managerId) params.managerId = filters.managerId;
-  if (filters.from) params.from = filters.from;
+  if (false) params.from = filters.from;
   if (filters.to) params.to = filters.to;
   if (filters.department) params.department = filters.department;
killedBy: buildExportQuery builds query string from filters
statusReason: expected null to be '2026-01-01' // Object.is equality

[Timeout] ConditionalExpression
lib/dashboardFilters.ts:78:7
     view: filters.view,
   };
   if (filters.managerId) params.managerId = filters.managerId;
-  if (filters.from) params.from = filters.from;
+  if (true) params.from = filters.from;
   if (filters.to) params.to = filters.to;
   if (filters.department) params.department = filters.department;

[Killed] ConditionalExpression
lib/dashboardFilters.ts:79:7
   };
   if (filters.managerId) params.managerId = filters.managerId;
   if (filters.from) params.from = filters.from;
-  if (filters.to) params.to = filters.to;
+  if (false) params.to = filters.to;
   if (filters.department) params.department = filters.department;
   return new URLSearchParams(params).toString();
killedBy: buildExportQuery builds query string from filters
statusReason: expected null to be '2026-12-31' // Object.is equality

[Timeout] ConditionalExpression
lib/dashboardFilters.ts:79:7
   };
   if (filters.managerId) params.managerId = filters.managerId;
   if (filters.from) params.from = filters.from;
-  if (filters.to) params.to = filters.to;
+  if (true) params.to = filters.to;
   if (filters.department) params.department = filters.department;
   return new URLSearchParams(params).toString();

[Killed] ConditionalExpression
lib/dashboardFilters.ts:80:7
   if (filters.managerId) params.managerId = filters.managerId;
   if (filters.from) params.from = filters.from;
   if (filters.to) params.to = filters.to;
-  if (filters.department) params.department = filters.department;
+  if (false) params.department = filters.department;
   return new URLSearchParams(params).toString();
 }
killedBy: buildExportQuery builds query string from filters
statusReason: expected null to be 'TI' // Object.is equality

[Timeout] ConditionalExpression
lib/dashboardFilters.ts:80:7
   if (filters.managerId) params.managerId = filters.managerId;
   if (filters.from) params.from = filters.from;
   if (filters.to) params.to = filters.to;
-  if (filters.department) params.department = filters.department;
+  if (true) params.department = filters.department;
   return new URLSearchParams(params).toString();
 }
