[Killed] BlockStatement
lib/holidaysApi.ts:16:48
 
 const nationalHolidaysCache = new Map<number, YearCache>();
 
-function getYearCache(year: number): YearCache {
-  let cache = nationalHolidaysCache.get(year);
-  if (!cache) {
-    cache = { dates: new Set<string>(), loaded: false };
-    nationalHolidaysCache.set(year, cache);
-  }
-  return cache;
-}
+function getYearCache(year: number): YearCache {}
 
 export async function ensureNationalHolidaysLoaded(year: number): Promise<void> {
killedBy: ensureNationalHolidaysLoaded (NODE_ENV=test) deve marcar o ano como carregado sem chamar a API externa em ambiente de teste
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Killed] ConditionalExpression
lib/holidaysApi.ts:18:7
 
 function getYearCache(year: number): YearCache {
   let cache = nationalHolidaysCache.get(year);
-  if (!cache) {
+  if (false) {
     cache = { dates: new Set<string>(), loaded: false };
     nationalHolidaysCache.set(year, cache);
killedBy: ensureNationalHolidaysLoaded (NODE_ENV=test) deve marcar o ano como carregado sem chamar a API externa em ambiente de teste
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Killed] ConditionalExpression
lib/holidaysApi.ts:18:7
 
 function getYearCache(year: number): YearCache {
   let cache = nationalHolidaysCache.get(year);
-  if (!cache) {
+  if (true) {
     cache = { dates: new Set<string>(), loaded: false };
     nationalHolidaysCache.set(year, cache);
killedBy: ensureNationalHolidaysLoaded (ambiente real, com fetch mockado) marca como carregado mesmo quando a API retorna erro (ok = false)
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Timeout] BooleanLiteral
lib/holidaysApi.ts:19:49
 function getYearCache(year: number): YearCache {
   let cache = nationalHolidaysCache.get(year);
   if (!cache) {
-    cache = { dates: new Set<string>(), loaded: false };
+    cache = { dates: new Set<string>(), loaded: true };
     nationalHolidaysCache.set(year, cache);
   }

[Killed] ObjectLiteral
lib/holidaysApi.ts:19:13
 function getYearCache(year: number): YearCache {
   let cache = nationalHolidaysCache.get(year);
   if (!cache) {
-    cache = { dates: new Set<string>(), loaded: false };
+    cache = {};
     nationalHolidaysCache.set(year, cache);
   }
killedBy: ensureNationalHolidaysLoaded (ambiente real, com fetch mockado) carrega feriados nacionais quando a API responde com sucesso
statusReason: Cannot read properties of undefined (reading 'has')

[Killed] ConditionalExpression
lib/holidaysApi.ts:27:7
 
 export async function ensureNationalHolidaysLoaded(year: number): Promise<void> {
   const cache = getYearCache(year);
-  if (cache.loaded) return;
+  if (false) return;
 
   // Em ambiente de teste, não bate na API externa para manter os testes determinísticos.
killedBy: ensureNationalHolidaysLoaded (ambiente real, com fetch mockado) marca como carregado mesmo quando a API retorna erro (ok = false)
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
lib/holidaysApi.ts:27:7
 
 export async function ensureNationalHolidaysLoaded(year: number): Promise<void> {
   const cache = getYearCache(year);
-  if (cache.loaded) return;
+  if (true) return;
 
   // Em ambiente de teste, não bate na API externa para manter os testes determinísticos.
killedBy: ensureNationalHolidaysLoaded (ambiente real, com fetch mockado) carrega feriados nacionais quando a API responde com sucesso
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/holidaysApi.ts:30:7
   if (cache.loaded) return;
 
   // Em ambiente de teste, não bate na API externa para manter os testes determinísticos.
-  if (process.env.NODE_ENV === "test") {
+  if (true) {
     cache.loaded = true;
     return;
killedBy: ensureNationalHolidaysLoaded (ambiente real, com fetch mockado) carrega feriados nacionais quando a API responde com sucesso
statusReason: expected false to be true // Object.is equality

[Timeout] EqualityOperator
lib/holidaysApi.ts:30:7
   if (cache.loaded) return;
 
   // Em ambiente de teste, não bate na API externa para manter os testes determinísticos.
-  if (process.env.NODE_ENV === "test") {
+  if (process.env.NODE_ENV !== "test") {
     cache.loaded = true;
     return;

[Timeout] BooleanLiteral
lib/holidaysApi.ts:31:20
 
   // Em ambiente de teste, não bate na API externa para manter os testes determinísticos.
   if (process.env.NODE_ENV === "test") {
-    cache.loaded = true;
+    cache.loaded = false;
     return;
   }

[Timeout] BlockStatement
lib/holidaysApi.ts:35:7
     return;
   }
 
-  try {
-    const res = await fetch(`${HOLIDAY_API_BASE}/${year}`, {
-      method: "GET",
-      headers: { accept: "application/json" },
-    });
-
-    if (!res.ok) {
-      cache.loaded = true;
-      return;
-    }
-
-    const data = (await res.json()) as HolidayApiItem[];
-    for (const h of data) {
-      cache.dates.add(h.date); // YYYY-MM-DD
-    }
-    cache.loaded = true;
-  } catch {
+  try {} catch {
     // Em caso de falha na API, apenas marcamos como loaded vazio.
     cache.loaded = true;

[Timeout] ObjectLiteral
lib/holidaysApi.ts:36:60
   }
 
   try {
-    const res = await fetch(`${HOLIDAY_API_BASE}/${year}`, {
-      method: "GET",
-      headers: { accept: "application/json" },
-    });
+    const res = await fetch(`${HOLIDAY_API_BASE}/${year}`, {});
 
     if (!res.ok) {

[Timeout] ObjectLiteral
lib/holidaysApi.ts:38:16
   try {
     const res = await fetch(`${HOLIDAY_API_BASE}/${year}`, {
       method: "GET",
-      headers: { accept: "application/json" },
+      headers: {},
     });
 

[Killed] BooleanLiteral
lib/holidaysApi.ts:42:22
     });
 
     if (!res.ok) {
-      cache.loaded = true;
+      cache.loaded = false;
       return;
     }
killedBy: ensureNationalHolidaysLoaded (ambiente real, com fetch mockado) marca como carregado mesmo quando a API retorna erro (ok = false)
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BlockStatement
lib/holidaysApi.ts:47:27
     }
 
     const data = (await res.json()) as HolidayApiItem[];
-    for (const h of data) {
-      cache.dates.add(h.date); // YYYY-MM-DD
-    }
+    for (const h of data) {}
     cache.loaded = true;
   } catch {
killedBy: ensureNationalHolidaysLoaded (ambiente real, com fetch mockado) carrega feriados nacionais quando a API responde com sucesso
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
lib/holidaysApi.ts:50:20
     for (const h of data) {
       cache.dates.add(h.date); // YYYY-MM-DD
     }
-    cache.loaded = true;
+    cache.loaded = false;
   } catch {
     // Em caso de falha na API, apenas marcamos como loaded vazio.
killedBy: ensureNationalHolidaysLoaded (ambiente real, com fetch mockado) carrega feriados nacionais quando a API responde com sucesso
statusReason: expected false to be true // Object.is equality

[Timeout] BlockStatement
lib/holidaysApi.ts:51:11
       cache.dates.add(h.date); // YYYY-MM-DD
     }
     cache.loaded = true;
-  } catch {
-    // Em caso de falha na API, apenas marcamos como loaded vazio.
-    cache.loaded = true;
-  }
+  } catch {}
 }
 

[Timeout] BooleanLiteral
lib/holidaysApi.ts:53:20
     cache.loaded = true;
   } catch {
     // Em caso de falha na API, apenas marcamos como loaded vazio.
-    cache.loaded = true;
+    cache.loaded = false;
   }
 }

[Timeout] BlockStatement
lib/holidaysApi.ts:57:62
   }
 }
 
-export function isNationalHolidayCached(date: Date): boolean {
-  const year = date.getUTCFullYear();
-  const cache = nationalHolidaysCache.get(year);
-  if (!cache || !cache.loaded) return false;
-  const month = date.getUTCMonth() + 1;
-  const day = date.getUTCDate();
-  const key = `${year.toString().padStart(4, "0")}-${month.toString().padStart(2, "0")}-${day
-    .toString()
-    .padStart(2, "0")}`;
-  return cache.dates.has(key);
-}
+export function isNationalHolidayCached(date: Date): boolean {}
 
 

[Killed] BooleanLiteral
lib/holidaysApi.ts:60:17
 export function isNationalHolidayCached(date: Date): boolean {
   const year = date.getUTCFullYear();
   const cache = nationalHolidaysCache.get(year);
-  if (!cache || !cache.loaded) return false;
+  if (!cache || cache.loaded) return false;
   const month = date.getUTCMonth() + 1;
   const day = date.getUTCDate();
killedBy: ensureNationalHolidaysLoaded (ambiente real, com fetch mockado) carrega feriados nacionais quando a API responde com sucesso
statusReason: expected false to be true // Object.is equality

[Timeout] LogicalOperator
lib/holidaysApi.ts:60:7
 export function isNationalHolidayCached(date: Date): boolean {
   const year = date.getUTCFullYear();
   const cache = nationalHolidaysCache.get(year);
-  if (!cache || !cache.loaded) return false;
+  if (!cache && !cache.loaded) return false;
   const month = date.getUTCMonth() + 1;
   const day = date.getUTCDate();

[Timeout] ArithmeticOperator
lib/holidaysApi.ts:61:17
   const year = date.getUTCFullYear();
   const cache = nationalHolidaysCache.get(year);
   if (!cache || !cache.loaded) return false;
-  const month = date.getUTCMonth() + 1;
+  const month = date.getUTCMonth() - 1;
   const day = date.getUTCDate();
   const key = `${year.toString().padStart(4, "0")}-${month.toString().padStart(2, "0")}-${day
