[Timeout] BlockStatement
lib/logger.ts:14:87
   timestamp?: string;
 };
 
-function log(level: LogLevel, message: string, context: Record<string, unknown> = {}) {
-  const payload: LogPayload = {
-    level,
-    message,
-    timestamp: new Date().toISOString(),
-    ...context,
-  };
-  const line = JSON.stringify(payload);
-  if (level === "error") {
-    console.error(line);
-  } else if (level === "warn") {
-    console.warn(line);
-  } else {
-    console.log(line);
-  }
-}
+function log(level: LogLevel, message: string, context: Record<string, unknown> = {}) {}
 
 export const logger = {

[Timeout] ConditionalExpression
lib/logger.ts:22:7
     ...context,
   };
   const line = JSON.stringify(payload);
-  if (level === "error") {
+  if (false) {
     console.error(line);
   } else if (level === "warn") {

[Timeout] EqualityOperator
lib/logger.ts:22:7
     ...context,
   };
   const line = JSON.stringify(payload);
-  if (level === "error") {
+  if (level !== "error") {
     console.error(line);
   } else if (level === "warn") {

[Timeout] BlockStatement
lib/logger.ts:24:32
   const line = JSON.stringify(payload);
   if (level === "error") {
     console.error(line);
-  } else if (level === "warn") {
-    console.warn(line);
-  } else {
+  } else if (level === "warn") {} else {
     console.log(line);
   }

[Timeout] ConditionalExpression
lib/logger.ts:24:14
   const line = JSON.stringify(payload);
   if (level === "error") {
     console.error(line);
-  } else if (level === "warn") {
+  } else if (false) {
     console.warn(line);
   } else {

[Timeout] BlockStatement
lib/logger.ts:26:10
     console.error(line);
   } else if (level === "warn") {
     console.warn(line);
-  } else {
-    console.log(line);
-  }
+  } else {}
 }
 

[Timeout] BlockStatement
lib/logger.ts:32:60
 }
 
 export const logger = {
-  info(message: string, context?: Record<string, unknown>) {
-    log("info", message, context);
-  },
+  info(message: string, context?: Record<string, unknown>) {},
   warn(message: string, context?: Record<string, unknown>) {
     log("warn", message, context);

[Timeout] StringLiteral
lib/logger.ts:33:9
 
 export const logger = {
   info(message: string, context?: Record<string, unknown>) {
-    log("info", message, context);
+    log("", message, context);
   },
   warn(message: string, context?: Record<string, unknown>) {

[Timeout] BlockStatement
lib/logger.ts:35:60
   info(message: string, context?: Record<string, unknown>) {
     log("info", message, context);
   },
-  warn(message: string, context?: Record<string, unknown>) {
-    log("warn", message, context);
-  },
+  warn(message: string, context?: Record<string, unknown>) {},
   error(message: string, context?: Record<string, unknown>) {
     log("error", message, context);

[Timeout] BlockStatement
lib/logger.ts:38:61
   warn(message: string, context?: Record<string, unknown>) {
     log("warn", message, context);
   },
-  error(message: string, context?: Record<string, unknown>) {
-    log("error", message, context);
-  },
+  error(message: string, context?: Record<string, unknown>) {},
 };
 
