[Timeout] BlockStatement
lib/notifications.ts:11:39
   | { type: "APPROVED"; requestId: string; userName: string; userEmail: string; approverName: string; status: string }
   | { type: "REJECTED"; requestId: string; userName: string; userEmail: string; approverName: string; note?: string | null };
 
-function logEvent(event: NotifyEvent) {
-  if (process.env.NODE_ENV === "development") {
-    // eslint-disable-next-line no-console
-    console.log("[notify]", event.type, event);
-  }
-}
+function logEvent(event: NotifyEvent) {}
 
 /**

[Timeout] EqualityOperator
lib/notifications.ts:12:7
   | { type: "REJECTED"; requestId: string; userName: string; userEmail: string; approverName: string; note?: string | null };
 
 function logEvent(event: NotifyEvent) {
-  if (process.env.NODE_ENV === "development") {
+  if (process.env.NODE_ENV !== "development") {
     // eslint-disable-next-line no-console
     console.log("[notify]", event.type, event);

[Timeout] BlockStatement
lib/notifications.ts:12:47
   | { type: "REJECTED"; requestId: string; userName: string; userEmail: string; approverName: string; note?: string | null };
 
 function logEvent(event: NotifyEvent) {
-  if (process.env.NODE_ENV === "development") {
-    // eslint-disable-next-line no-console
-    console.log("[notify]", event.type, event);
-  }
+  if (process.env.NODE_ENV === "development") {}
 }
 

[Killed] BlockStatement
lib/notifications.ts:22:65
  * Envia notificação (webhook genérico ou log).
  * Para ativar: NOTIFY_WEBHOOK_URL (POST JSON) ou implementar envio por e-mail (ex.: Resend).
  */
-export async function notify(event: NotifyEvent): Promise<void> {
-  logEvent(event);
-
-  const webhookUrl = process.env.NOTIFY_WEBHOOK_URL;
-  if (webhookUrl) {
-    try {
-      const res = await fetch(webhookUrl, {
-        method: "POST",
-        headers: { "Content-Type": "application/json" },
-        body: JSON.stringify({
-          source: "ds-ferias",
-          ...event,
-          at: new Date().toISOString(),
-        }),
-      });
-      if (!res.ok) {
-        console.error("[notify] webhook failed", res.status, await res.text());
-      }
-    } catch (err) {
-      console.error("[notify] webhook error", err);
-    }
-  }
-}
+export async function notify(event: NotifyEvent): Promise<void> {}
 
 /** Notifica coordenador/gerente sobre nova solicitação de férias. */
killedBy: notify calls fetch when NOTIFY_WEBHOOK_URL is set
statusReason: expected "vi.fn()" to be called with arguments: [ 'https://example.com/hook', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
lib/notifications.ts:26:7
   logEvent(event);
 
   const webhookUrl = process.env.NOTIFY_WEBHOOK_URL;
-  if (webhookUrl) {
+  if (false) {
     try {
       const res = await fetch(webhookUrl, {
killedBy: notify calls fetch when NOTIFY_WEBHOOK_URL is set
statusReason: expected "vi.fn()" to be called with arguments: [ 'https://example.com/hook', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
lib/notifications.ts:26:7
   logEvent(event);
 
   const webhookUrl = process.env.NOTIFY_WEBHOOK_URL;
-  if (webhookUrl) {
+  if (true) {
     try {
       const res = await fetch(webhookUrl, {
killedBy: notify does not call fetch when NOTIFY_WEBHOOK_URL is empty
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "",

[Killed] BlockStatement
lib/notifications.ts:27:9
 
   const webhookUrl = process.env.NOTIFY_WEBHOOK_URL;
   if (webhookUrl) {
-    try {
-      const res = await fetch(webhookUrl, {
-        method: "POST",
-        headers: { "Content-Type": "application/json" },
-        body: JSON.stringify({
-          source: "ds-ferias",
-          ...event,
-          at: new Date().toISOString(),
-        }),
-      });
-      if (!res.ok) {
-        console.error("[notify] webhook failed", res.status, await res.text());
-      }
-    } catch (err) {
+    try {} catch (err) {
       console.error("[notify] webhook error", err);
     }
killedBy: notify calls fetch when NOTIFY_WEBHOOK_URL is set
statusReason: expected "vi.fn()" to be called with arguments: [ 'https://example.com/hook', …(1) ]

Number of calls: 0

[Killed] ObjectLiteral
lib/notifications.ts:31:30
       const res = await fetch(webhookUrl, {
         method: "POST",
         headers: { "Content-Type": "application/json" },
-        body: JSON.stringify({
-          source: "ds-ferias",
-          ...event,
-          at: new Date().toISOString(),
-        }),
+        body: JSON.stringify({}),
       });
       if (!res.ok) {
killedBy: notify calls fetch when NOTIFY_WEBHOOK_URL is set
statusReason: expected undefined to be 'NEW_REQUEST' // Object.is equality

[Killed] ConditionalExpression
lib/notifications.ts:37:11
           at: new Date().toISOString(),
         }),
       });
-      if (!res.ok) {
+      if (false) {
         console.error("[notify] webhook failed", res.status, await res.text());
       }
killedBy: notify does not throw when webhook returns not ok
statusReason: expected "error" to be called at least once

[Killed] BooleanLiteral
lib/notifications.ts:37:11
           at: new Date().toISOString(),
         }),
       });
-      if (!res.ok) {
+      if (res.ok) {
         console.error("[notify] webhook failed", res.status, await res.text());
       }
killedBy: notify does not throw when webhook returns not ok
statusReason: expected "error" to be called at least once

[Killed] BlockStatement
lib/notifications.ts:40:19
       if (!res.ok) {
         console.error("[notify] webhook failed", res.status, await res.text());
       }
-    } catch (err) {
-      console.error("[notify] webhook error", err);
-    }
+    } catch (err) {}
   }
 }
killedBy: notify does not throw when fetch throws
statusReason: expected "error" to be called at least once

[Timeout] StringLiteral
lib/notifications.ts:41:21
         console.error("[notify] webhook failed", res.status, await res.text());
       }
     } catch (err) {
-      console.error("[notify] webhook error", err);
+      console.error("", err);
     }
   }

[Killed] BlockStatement
lib/notifications.ts:54:4
   managerEmail?: string | null;
   startDate: Date;
   endDate: Date;
-}) {
-  return notify({
-    type: "NEW_REQUEST",
-    requestId: payload.requestId,
-    userName: payload.userName,
-    userEmail: payload.userEmail,
-    managerEmail: payload.managerEmail,
-    startDate: payload.startDate.toISOString().slice(0, 10),
-    endDate: payload.endDate.toISOString().slice(0, 10),
-  });
-}
+}) {}
 
 /** Notifica colaborador sobre aprovação. */
killedBy: notifyNewRequest sends NEW_REQUEST with date strings
statusReason: expected "vi.fn()" to be called at least once

[Killed] MethodExpression
lib/notifications.ts:61:16
     userName: payload.userName,
     userEmail: payload.userEmail,
     managerEmail: payload.managerEmail,
-    startDate: payload.startDate.toISOString().slice(0, 10),
+    startDate: payload.startDate.toISOString(),
     endDate: payload.endDate.toISOString().slice(0, 10),
   });
killedBy: notifyNewRequest sends NEW_REQUEST with date strings
statusReason: expected '2026-06-01T00:00:00.000Z' to be '2026-06-01' // Object.is equality

[Killed] MethodExpression
lib/notifications.ts:62:14
     userEmail: payload.userEmail,
     managerEmail: payload.managerEmail,
     startDate: payload.startDate.toISOString().slice(0, 10),
-    endDate: payload.endDate.toISOString().slice(0, 10),
+    endDate: payload.endDate.toISOString(),
   });
 }
killedBy: notifyNewRequest sends NEW_REQUEST with date strings
statusReason: expected '2026-06-14T00:00:00.000Z' to be '2026-06-14' // Object.is equality

[Killed] BlockStatement
lib/notifications.ts:73:4
   userEmail: string;
   approverName: string;
   status: string;
-}) {
-  return notify({
-    type: "APPROVED",
-    ...payload,
-  });
-}
+}) {}
 
 /** Notifica colaborador sobre reprovação. */
killedBy: notifyApproved sends APPROVED event
statusReason: Cannot read properties of undefined (reading '1')

[Killed] ObjectLiteral
lib/notifications.ts:74:17
   approverName: string;
   status: string;
 }) {
-  return notify({
-    type: "APPROVED",
-    ...payload,
-  });
+  return notify({});
 }
 
killedBy: notifyApproved sends APPROVED event
statusReason: expected undefined to be 'APPROVED' // Object.is equality

[Killed] StringLiteral
lib/notifications.ts:75:11
   status: string;
 }) {
   return notify({
-    type: "APPROVED",
+    type: "",
     ...payload,
   });
killedBy: notifyApproved sends APPROVED event
statusReason: expected '' to be 'APPROVED' // Object.is equality

[Killed] BlockStatement
lib/notifications.ts:87:4
   userEmail: string;
   approverName: string;
   note?: string | null;
-}) {
-  return notify({
-    type: "REJECTED",
-    ...payload,
-  });
-}
+}) {}
 
killedBy: notifyRejected sends REJECTED event with optional note
statusReason: Cannot read properties of undefined (reading '1')
