[Timeout] ArithmeticOperator
lib/rateLimit.ts:7:19
  */
 
 const store = new Map<string, number[]>();
-const WINDOW_MS = 60 * 1000; // 1 minuto
+const WINDOW_MS = 60 / 1000; // 1 minuto
 
 function prune(key: string, windowMs: number) {

[Timeout] BlockStatement
lib/rateLimit.ts:9:47
 const store = new Map<string, number[]>();
 const WINDOW_MS = 60 * 1000; // 1 minuto
 
-function prune(key: string, windowMs: number) {
-  const now = Date.now();
-  const list = store.get(key) ?? [];
-  const kept = list.filter((t) => now - t < windowMs);
-  if (kept.length === 0) store.delete(key);
-  else store.set(key, kept);
-}
+function prune(key: string, windowMs: number) {}
 
 /**

[Killed] LogicalOperator
lib/rateLimit.ts:11:16
 
 function prune(key: string, windowMs: number) {
   const now = Date.now();
-  const list = store.get(key) ?? [];
+  const list = store.get(key) && [];
   const kept = list.filter((t) => now - t < windowMs);
   if (kept.length === 0) store.delete(key);
killedBy: checkRateLimit allows up to maxRequests within window
statusReason: Cannot read properties of undefined (reading 'filter')

[Timeout] ArrayDeclaration
lib/rateLimit.ts:11:34
 
 function prune(key: string, windowMs: number) {
   const now = Date.now();
-  const list = store.get(key) ?? [];
+  const list = store.get(key) ?? ["Stryker was here"];
   const kept = list.filter((t) => now - t < windowMs);
   if (kept.length === 0) store.delete(key);

[Killed] ArrowFunction
lib/rateLimit.ts:12:28
 function prune(key: string, windowMs: number) {
   const now = Date.now();
   const list = store.get(key) ?? [];
-  const kept = list.filter((t) => now - t < windowMs);
+  const kept = list.filter(() => undefined);
   if (kept.length === 0) store.delete(key);
   else store.set(key, kept);
killedBy: checkRateLimit allows up to maxRequests within window
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
lib/rateLimit.ts:12:35
 function prune(key: string, windowMs: number) {
   const now = Date.now();
   const list = store.get(key) ?? [];
-  const kept = list.filter((t) => now - t < windowMs);
+  const kept = list.filter((t) => now - t >= windowMs);
   if (kept.length === 0) store.delete(key);
   else store.set(key, kept);
killedBy: checkRateLimit allows up to maxRequests within window
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
lib/rateLimit.ts:13:7
   const now = Date.now();
   const list = store.get(key) ?? [];
   const kept = list.filter((t) => now - t < windowMs);
-  if (kept.length === 0) store.delete(key);
+  if (kept.length !== 0) store.delete(key);
   else store.set(key, kept);
 }
killedBy: checkRateLimit allows up to maxRequests within window
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
lib/rateLimit.ts:13:7
   const now = Date.now();
   const list = store.get(key) ?? [];
   const kept = list.filter((t) => now - t < windowMs);
-  if (kept.length === 0) store.delete(key);
+  if (true) store.delete(key);
   else store.set(key, kept);
 }
killedBy: checkRateLimit allows up to maxRequests within window
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
lib/rateLimit.ts:27:12
   key: string,
   maxRequests: number,
   windowMs: number = WINDOW_MS,
-): boolean {
-  prune(key, windowMs);
-  const list = store.get(key) ?? [];
-  if (list.length >= maxRequests) return false;
-  list.push(Date.now());
-  store.set(key, list);
-  return true;
-}
+): boolean {}
 
 export function getClientId(request: Request): string {
killedBy: checkRateLimit allows up to maxRequests within window
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
lib/rateLimit.ts:29:16
   windowMs: number = WINDOW_MS,
 ): boolean {
   prune(key, windowMs);
-  const list = store.get(key) ?? [];
+  const list = store.get(key) && [];
   if (list.length >= maxRequests) return false;
   list.push(Date.now());
killedBy: checkRateLimit allows up to maxRequests within window
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
lib/rateLimit.ts:30:7
 ): boolean {
   prune(key, windowMs);
   const list = store.get(key) ?? [];
-  if (list.length >= maxRequests) return false;
+  if (true) return false;
   list.push(Date.now());
   store.set(key, list);
killedBy: checkRateLimit allows up to maxRequests within window
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
lib/rateLimit.ts:30:7
 ): boolean {
   prune(key, windowMs);
   const list = store.get(key) ?? [];
-  if (list.length >= maxRequests) return false;
+  if (list.length < maxRequests) return false;
   list.push(Date.now());
   store.set(key, list);
killedBy: checkRateLimit allows up to maxRequests within window
statusReason: expected false to be true // Object.is equality

[Timeout] BooleanLiteral
lib/rateLimit.ts:33:10
   if (list.length >= maxRequests) return false;
   list.push(Date.now());
   store.set(key, list);
-  return true;
+  return false;
 }
 

[Killed] BlockStatement
lib/rateLimit.ts:36:55
   return true;
 }
 
-export function getClientId(request: Request): string {
-  const forwarded = request.headers.get("x-forwarded-for");
-  const real = request.headers.get("x-real-ip");
-  const ip = (forwarded ?? real ?? "127.0.0.1").split(",")[0].trim();
-  return ip || "127.0.0.1";
-}
+export function getClientId(request: Request): string {}
 
killedBy: getClientId uses x-forwarded-for when present
statusReason: expected undefined to be '1.1.1.1' // Object.is equality

[Killed] LogicalOperator
lib/rateLimit.ts:39:15
 export function getClientId(request: Request): string {
   const forwarded = request.headers.get("x-forwarded-for");
   const real = request.headers.get("x-real-ip");
-  const ip = (forwarded ?? real ?? "127.0.0.1").split(",")[0].trim();
+  const ip = (forwarded && real ?? "127.0.0.1").split(",")[0].trim();
   return ip || "127.0.0.1";
 }
killedBy: getClientId uses x-forwarded-for when present
statusReason: expected '127.0.0.1' to be '1.1.1.1' // Object.is equality

[Killed] LogicalOperator
lib/rateLimit.ts:39:15
 export function getClientId(request: Request): string {
   const forwarded = request.headers.get("x-forwarded-for");
   const real = request.headers.get("x-real-ip");
-  const ip = (forwarded ?? real ?? "127.0.0.1").split(",")[0].trim();
+  const ip = ((forwarded ?? real) && "127.0.0.1").split(",")[0].trim();
   return ip || "127.0.0.1";
 }
killedBy: getClientId uses x-forwarded-for when present
statusReason: expected '127.0.0.1' to be '1.1.1.1' // Object.is equality

[Killed] ConditionalExpression
lib/rateLimit.ts:40:10
   const forwarded = request.headers.get("x-forwarded-for");
   const real = request.headers.get("x-real-ip");
   const ip = (forwarded ?? real ?? "127.0.0.1").split(",")[0].trim();
-  return ip || "127.0.0.1";
+  return false;
 }
 
killedBy: getClientId uses x-forwarded-for when present
statusReason: expected false to be '1.1.1.1' // Object.is equality

[Killed] LogicalOperator
lib/rateLimit.ts:40:10
   const forwarded = request.headers.get("x-forwarded-for");
   const real = request.headers.get("x-real-ip");
   const ip = (forwarded ?? real ?? "127.0.0.1").split(",")[0].trim();
-  return ip || "127.0.0.1";
+  return ip && "127.0.0.1";
 }
 
killedBy: getClientId uses x-forwarded-for when present
statusReason: expected '127.0.0.1' to be '1.1.1.1' // Object.is equality
