[Killed] EqualityOperator
lib/requestVisibility.ts:30:25
   const level = getRoleLevel(userRole);
   const where: Record<string, unknown> = {};
 
-  if (filters.status && filters.status !== "TODOS") {
+  if (filters.status && filters.status === "TODOS") {
     where.status = filters.status;
   }
killedBy: buildManagedRequestsWhere adds status when filter provided
statusReason: expected undefined to be 'PENDENTE' // Object.is equality

[Killed] ConditionalExpression
lib/requestVisibility.ts:30:25
   const level = getRoleLevel(userRole);
   const where: Record<string, unknown> = {};
 
-  if (filters.status && filters.status !== "TODOS") {
+  if (filters.status && true) {
     where.status = filters.status;
   }
killedBy: buildManagedRequestsWhere ignores TODOS status
statusReason: expected 'TODOS' to be undefined

[Killed] ConditionalExpression
lib/requestVisibility.ts:34:7
     where.status = filters.status;
   }
 
-  if (filters.query?.trim()) {
+  if (false) {
     where.user = { name: { contains: filters.query.trim(), mode: "insensitive" as const } };
   }
killedBy: buildManagedRequestsWhere adds user name contains for query
statusReason: expected undefined to deeply equal { name: { contains: 'João', …(1) } }

[Killed] OptionalChaining
lib/requestVisibility.ts:34:7
     where.status = filters.status;
   }
 
-  if (filters.query?.trim()) {
+  if (filters.query.trim()) {
     where.user = { name: { contains: filters.query.trim(), mode: "insensitive" as const } };
   }
killedBy: buildManagedRequestsWhere returns empty where for level 1 (colaborador not used in practice)
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] MethodExpression
lib/requestVisibility.ts:35:38
   }
 
   if (filters.query?.trim()) {
-    where.user = { name: { contains: filters.query.trim(), mode: "insensitive" as const } };
+    where.user = { name: { contains: filters.query, mode: "insensitive" as const } };
   }
 
killedBy: buildManagedRequestsWhere adds user name contains for query
statusReason: expected { Object (name) } to deeply equal { name: { contains: 'João', …(1) } }

[Killed] ObjectLiteral
lib/requestVisibility.ts:35:26
   }
 
   if (filters.query?.trim()) {
-    where.user = { name: { contains: filters.query.trim(), mode: "insensitive" as const } };
+    where.user = { name: {} };
   }
 
killedBy: buildManagedRequestsWhere adds user name contains for query
statusReason: expected { name: {} } to deeply equal { name: { contains: 'João', …(1) } }

[Killed] ConditionalExpression
lib/requestVisibility.ts:38:7
     where.user = { name: { contains: filters.query.trim(), mode: "insensitive" as const } };
   }
 
-  if (filters.department) {
+  if (true) {
     if (where.user && typeof where.user === "object" && !Array.isArray(where.user)) {
       (where.user as Record<string, unknown>).department = filters.department;
killedBy: buildManagedRequestsWhere returns empty where for level 1 (colaborador not used in practice)
statusReason: expected { user: { department: undefined } } to deeply equal {}

[Killed] BlockStatement
lib/requestVisibility.ts:38:27
     where.user = { name: { contains: filters.query.trim(), mode: "insensitive" as const } };
   }
 
-  if (filters.department) {
-    if (where.user && typeof where.user === "object" && !Array.isArray(where.user)) {
-      (where.user as Record<string, unknown>).department = filters.department;
-    } else {
-      where.user = { department: filters.department };
-    }
-  }
+  if (filters.department) {}
 
   if (level === 2) {
killedBy: buildManagedRequestsWhere adds department when filter provided
statusReason: expected undefined to deeply equal { department: 'TI' }

[Killed] BooleanLiteral
lib/requestVisibility.ts:39:57
   }
 
   if (filters.department) {
-    if (where.user && typeof where.user === "object" && !Array.isArray(where.user)) {
+    if (where.user && typeof where.user === "object" && Array.isArray(where.user)) {
       (where.user as Record<string, unknown>).department = filters.department;
     } else {
killedBy: buildManagedRequestsWhere level 2 with query and department: merges all into user
statusReason: expected { department: 'TI', …(1) } to match object { managerId: 'coord-1', …(2) }

[Killed] EqualityOperator
lib/requestVisibility.ts:39:23
   }
 
   if (filters.department) {
-    if (where.user && typeof where.user === "object" && !Array.isArray(where.user)) {
+    if (where.user && typeof where.user !== "object" && !Array.isArray(where.user)) {
       (where.user as Record<string, unknown>).department = filters.department;
     } else {
killedBy: buildManagedRequestsWhere level 2 with query and department: merges all into user
statusReason: expected { department: 'TI', …(1) } to match object { managerId: 'coord-1', …(2) }

[Killed] BlockStatement
lib/requestVisibility.ts:41:12
   if (filters.department) {
     if (where.user && typeof where.user === "object" && !Array.isArray(where.user)) {
       (where.user as Record<string, unknown>).department = filters.department;
-    } else {
-      where.user = { department: filters.department };
-    }
+    } else {}
   }
 
killedBy: buildManagedRequestsWhere adds department when filter provided
statusReason: expected undefined to deeply equal { department: 'TI' }

[Killed] ConditionalExpression
lib/requestVisibility.ts:46:7
     }
   }
 
-  if (level === 2) {
+  if (false) {
     if (where.user && typeof where.user === "object" && !Array.isArray(where.user)) {
       (where.user as Record<string, unknown>).managerId = userId;
killedBy: buildManagedRequestsWhere level 2 (coordenador): filters by managerId
statusReason: expected undefined to deeply equal { managerId: 'coord-1' }

[Killed] BlockStatement
lib/requestVisibility.ts:46:20
     }
   }
 
-  if (level === 2) {
-    if (where.user && typeof where.user === "object" && !Array.isArray(where.user)) {
-      (where.user as Record<string, unknown>).managerId = userId;
-    } else {
-      where.user = { managerId: userId };
-    }
-  } else if (level === 3) {
+  if (level === 2) {} else if (level === 3) {
     const orClause = [
       { user: { managerId: userId } },
killedBy: buildManagedRequestsWhere level 2 (coordenador): filters by managerId
statusReason: expected undefined to deeply equal { managerId: 'coord-1' }

[Killed] ConditionalExpression
lib/requestVisibility.ts:47:9
   }
 
   if (level === 2) {
-    if (where.user && typeof where.user === "object" && !Array.isArray(where.user)) {
+    if (false) {
       (where.user as Record<string, unknown>).managerId = userId;
     } else {
killedBy: buildManagedRequestsWhere level 2 with query: merges user conditions
statusReason: expected { managerId: 'coord-1' } to match object { Object (managerId, name) }

[Killed] BlockStatement
lib/requestVisibility.ts:47:85
   }
 
   if (level === 2) {
-    if (where.user && typeof where.user === "object" && !Array.isArray(where.user)) {
-      (where.user as Record<string, unknown>).managerId = userId;
-    } else {
+    if (where.user && typeof where.user === "object" && !Array.isArray(where.user)) {} else {
       where.user = { managerId: userId };
     }
killedBy: buildManagedRequestsWhere level 2 with query: merges user conditions
statusReason: expected { name: { contains: 'Maria', …(1) } } to match object { Object (managerId, name) }

[Killed] BlockStatement
lib/requestVisibility.ts:49:12
   if (level === 2) {
     if (where.user && typeof where.user === "object" && !Array.isArray(where.user)) {
       (where.user as Record<string, unknown>).managerId = userId;
-    } else {
-      where.user = { managerId: userId };
-    }
+    } else {}
   } else if (level === 3) {
     const orClause = [
killedBy: buildManagedRequestsWhere level 2 (coordenador): filters by managerId
statusReason: expected undefined to deeply equal { managerId: 'coord-1' }

[Killed] BlockStatement
lib/requestVisibility.ts:52:27
     } else {
       where.user = { managerId: userId };
     }
-  } else if (level === 3) {
-    const orClause = [
-      { user: { managerId: userId } },
-      { user: { manager: { managerId: userId } } },
-    ];
-    const base = where.user && typeof where.user === "object" && !Array.isArray(where.user)
-      ? { user: where.user }
-      : {};
-    where.AND = [
-      { OR: orClause },
-      ...(Object.keys(base).length > 0 ? [base] : []),
-    ];
-    delete where.user;
-  }
+  } else if (level === 3) {}
   return where;
 }
killedBy: buildManagedRequestsWhere level 3 (gerente) with existing user filter: uses AND with base
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
lib/requestVisibility.ts:52:14
     } else {
       where.user = { managerId: userId };
     }
-  } else if (level === 3) {
+  } else if (false) {
     const orClause = [
       { user: { managerId: userId } },
killedBy: buildManagedRequestsWhere level 3 (gerente) with existing user filter: uses AND with base
statusReason: expected undefined to be defined

[Killed] ObjectLiteral
lib/requestVisibility.ts:54:7
     }
   } else if (level === 3) {
     const orClause = [
-      { user: { managerId: userId } },
+      {},
       { user: { manager: { managerId: userId } } },
     ];
killedBy: buildManagedRequestsWhere level 3 (gerente): uses OR for direct and indirect reports
statusReason: expected { OR: [ {}, { user: { …(1) } } ] } to match object { OR: [ { user: { …(1) } }, …(1) ] }

[Killed] ObjectLiteral
lib/requestVisibility.ts:55:7
   } else if (level === 3) {
     const orClause = [
       { user: { managerId: userId } },
-      { user: { manager: { managerId: userId } } },
+      {},
     ];
     const base = where.user && typeof where.user === "object" && !Array.isArray(where.user)
killedBy: buildManagedRequestsWhere level 3 (gerente): uses OR for direct and indirect reports
statusReason: expected { OR: [ { user: { …(1) } }, {} ] } to match object { OR: [ { user: { …(1) } }, …(1) ] }

[Killed] BooleanLiteral
lib/requestVisibility.ts:57:66
       { user: { managerId: userId } },
       { user: { manager: { managerId: userId } } },
     ];
-    const base = where.user && typeof where.user === "object" && !Array.isArray(where.user)
+    const base = where.user && typeof where.user === "object" && Array.isArray(where.user)
       ? { user: where.user }
       : {};
killedBy: buildManagedRequestsWhere level 3 (gerente) with existing user filter: uses AND with base
statusReason: expected [ Array(1) ] to have a length of 2 but got 1

[Killed] ConditionalExpression
lib/requestVisibility.ts:57:18
       { user: { managerId: userId } },
       { user: { manager: { managerId: userId } } },
     ];
-    const base = where.user && typeof where.user === "object" && !Array.isArray(where.user)
+    const base = false
       ? { user: where.user }
       : {};
killedBy: buildManagedRequestsWhere level 3 (gerente) with existing user filter: uses AND with base
statusReason: expected [ Array(1) ] to have a length of 2 but got 1

[Killed] ArrayDeclaration
lib/requestVisibility.ts:60:17
     const base = where.user && typeof where.user === "object" && !Array.isArray(where.user)
       ? { user: where.user }
       : {};
-    where.AND = [
-      { OR: orClause },
-      ...(Object.keys(base).length > 0 ? [base] : []),
-    ];
+    where.AND = [];
     delete where.user;
   }
killedBy: buildManagedRequestsWhere level 3 (gerente) with existing user filter: uses AND with base
statusReason: expected [] to have a length of 2 but got +0

[Killed] ObjectLiteral
lib/requestVisibility.ts:61:7
       ? { user: where.user }
       : {};
     where.AND = [
-      { OR: orClause },
+      {},
       ...(Object.keys(base).length > 0 ? [base] : []),
     ];
killedBy: buildManagedRequestsWhere level 3 (gerente): uses OR for direct and indirect reports
statusReason: expected {} to match object { OR: [ { user: { …(1) } }, …(1) ] }

[Killed] ConditionalExpression
lib/requestVisibility.ts:62:11
       : {};
     where.AND = [
       { OR: orClause },
-      ...(Object.keys(base).length > 0 ? [base] : []),
+      ...(true ? [base] : []),
     ];
     delete where.user;
killedBy: buildManagedRequestsWhere level 3 (gerente): uses OR for direct and indirect reports
statusReason: expected [ { OR: [ …(2) ] }, {} ] to have a length of 1 but got 2

[Killed] EqualityOperator
lib/requestVisibility.ts:62:11
       : {};
     where.AND = [
       { OR: orClause },
-      ...(Object.keys(base).length > 0 ? [base] : []),
+      ...(Object.keys(base).length >= 0 ? [base] : []),
     ];
     delete where.user;
killedBy: buildManagedRequestsWhere level 3 (gerente): uses OR for direct and indirect reports
statusReason: expected [ { OR: [ …(2) ] }, {} ] to have a length of 1 but got 2

[Killed] ConditionalExpression
lib/requestVisibility.ts:91:16
   filters: DashboardFilters,
 ): typeof requests {
   const userLevel = getRoleLevel(userRole);
-  const view = filters.view === "historico" ? "historico" : "inbox";
+  const view = false ? "historico" : "inbox";
 
   return requests.filter((r) => {
killedBy: filterRequestsByVisibilityAndView historico view: only processed statuses
statusReason: expected 'PENDENTE' to be 'APROVADO_RH' // Object.is equality

[Killed] ConditionalExpression
lib/requestVisibility.ts:91:16
   filters: DashboardFilters,
 ): typeof requests {
   const userLevel = getRoleLevel(userRole);
-  const view = filters.view === "historico" ? "historico" : "inbox";
+  const view = true ? "historico" : "inbox";
 
   return requests.filter((r) => {
killedBy: filterRequestsByVisibilityAndView keeps request when coord has team visibility and inbox view
statusReason: expected [] to have a length of 1 but got +0

[Killed] LogicalOperator
lib/requestVisibility.ts:94:23
   const view = filters.view === "historico" ? "historico" : "inbox";
 
   return requests.filter((r) => {
-    const managerId = r.user?.managerId ?? null;
+    const managerId = r.user?.managerId && null;
     const manager = r.user?.manager != null ? { managerId: r.user.manager.managerId ?? null } : null;
     if (!hasTeamVisibility(userRole, userId, { userId: r.userId, user: { managerId, manager } })) {
killedBy: filterRequestsByVisibilityAndView keeps request when coord has team visibility and inbox view
statusReason: expected [] to have a length of 1 but got +0

[Timeout] OptionalChaining
lib/requestVisibility.ts:94:23
   const view = filters.view === "historico" ? "historico" : "inbox";
 
   return requests.filter((r) => {
-    const managerId = r.user?.managerId ?? null;
+    const managerId = r.user.managerId ?? null;
     const manager = r.user?.manager != null ? { managerId: r.user.manager.managerId ?? null } : null;
     if (!hasTeamVisibility(userRole, userId, { userId: r.userId, user: { managerId, manager } })) {

[Killed] ConditionalExpression
lib/requestVisibility.ts:95:21
 
   return requests.filter((r) => {
     const managerId = r.user?.managerId ?? null;
-    const manager = r.user?.manager != null ? { managerId: r.user.manager.managerId ?? null } : null;
+    const manager = true ? { managerId: r.user.manager.managerId ?? null } : null;
     if (!hasTeamVisibility(userRole, userId, { userId: r.userId, user: { managerId, manager } })) {
       return false;
killedBy: filterRequestsByVisibilityAndView filters out request when coord has no team visibility
statusReason: Cannot read properties of null (reading 'managerId')

[Killed] EqualityOperator
lib/requestVisibility.ts:95:21
 
   return requests.filter((r) => {
     const managerId = r.user?.managerId ?? null;
-    const manager = r.user?.manager != null ? { managerId: r.user.manager.managerId ?? null } : null;
+    const manager = r.user?.manager == null ? { managerId: r.user.manager.managerId ?? null } : null;
     if (!hasTeamVisibility(userRole, userId, { userId: r.userId, user: { managerId, manager } })) {
       return false;
killedBy: filterRequestsByVisibilityAndView filters out request when coord has no team visibility
statusReason: Cannot read properties of null (reading 'managerId')

[Killed] BlockStatement
lib/requestVisibility.ts:96:99
   return requests.filter((r) => {
     const managerId = r.user?.managerId ?? null;
     const manager = r.user?.manager != null ? { managerId: r.user.manager.managerId ?? null } : null;
-    if (!hasTeamVisibility(userRole, userId, { userId: r.userId, user: { managerId, manager } })) {
-      return false;
-    }
+    if (!hasTeamVisibility(userRole, userId, { userId: r.userId, user: { managerId, manager } })) {}
     if (getRoleLevel(userRole) >= 4 && filters.managerId && filters.managerId !== "ALL") {
       if (r.user?.manager?.id !== filters.managerId) return false;
killedBy: filterRequestsByVisibilityAndView filters out request when coord has no team visibility
statusReason: expected [ { userId: 'func-1', …(4) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
lib/requestVisibility.ts:96:9
   return requests.filter((r) => {
     const managerId = r.user?.managerId ?? null;
     const manager = r.user?.manager != null ? { managerId: r.user.manager.managerId ?? null } : null;
-    if (!hasTeamVisibility(userRole, userId, { userId: r.userId, user: { managerId, manager } })) {
+    if (true) {
       return false;
     }
killedBy: filterRequestsByVisibilityAndView keeps request when coord has team visibility and inbox view
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
lib/requestVisibility.ts:97:14
     const managerId = r.user?.managerId ?? null;
     const manager = r.user?.manager != null ? { managerId: r.user.manager.managerId ?? null } : null;
     if (!hasTeamVisibility(userRole, userId, { userId: r.userId, user: { managerId, manager } })) {
-      return false;
+      return true;
     }
     if (getRoleLevel(userRole) >= 4 && filters.managerId && filters.managerId !== "ALL") {
killedBy: filterRequestsByVisibilityAndView filters out request when coord has no team visibility
statusReason: expected [ { userId: 'func-1', …(4) } ] to have a length of +0 but got 1

[Timeout] BlockStatement
lib/requestVisibility.ts:99:90
     if (!hasTeamVisibility(userRole, userId, { userId: r.userId, user: { managerId, manager } })) {
       return false;
     }
-    if (getRoleLevel(userRole) >= 4 && filters.managerId && filters.managerId !== "ALL") {
-      if (r.user?.manager?.id !== filters.managerId) return false;
-    }
+    if (getRoleLevel(userRole) >= 4 && filters.managerId && filters.managerId !== "ALL") {}
     if (filters.department && r.user?.department !== filters.department) return false;
     if (filters.from && r.startDate < new Date(filters.from)) return false;

[Timeout] LogicalOperator
lib/requestVisibility.ts:99:9
     if (!hasTeamVisibility(userRole, userId, { userId: r.userId, user: { managerId, manager } })) {
       return false;
     }
-    if (getRoleLevel(userRole) >= 4 && filters.managerId && filters.managerId !== "ALL") {
+    if (getRoleLevel(userRole) >= 4 || filters.managerId && filters.managerId !== "ALL") {
       if (r.user?.manager?.id !== filters.managerId) return false;
     }

[Killed] EqualityOperator
lib/requestVisibility.ts:100:11
       return false;
     }
     if (getRoleLevel(userRole) >= 4 && filters.managerId && filters.managerId !== "ALL") {
-      if (r.user?.manager?.id !== filters.managerId) return false;
+      if (r.user?.manager?.id === filters.managerId) return false;
     }
     if (filters.department && r.user?.department !== filters.department) return false;
killedBy: filterRequestsByVisibilityAndView RH with managerId filter
statusReason: expected [] to have a length of 1 but got +0

[Killed] LogicalOperator
lib/requestVisibility.ts:102:9
     if (getRoleLevel(userRole) >= 4 && filters.managerId && filters.managerId !== "ALL") {
       if (r.user?.manager?.id !== filters.managerId) return false;
     }
-    if (filters.department && r.user?.department !== filters.department) return false;
+    if (filters.department || r.user?.department !== filters.department) return false;
     if (filters.from && r.startDate < new Date(filters.from)) return false;
     if (filters.to && r.endDate > new Date(filters.to)) return false;
killedBy: filterRequestsByVisibilityAndView keeps request when coord has team visibility and inbox view
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
lib/requestVisibility.ts:103:70
       if (r.user?.manager?.id !== filters.managerId) return false;
     }
     if (filters.department && r.user?.department !== filters.department) return false;
-    if (filters.from && r.startDate < new Date(filters.from)) return false;
+    if (filters.from && r.startDate < new Date(filters.from)) return true;
     if (filters.to && r.endDate > new Date(filters.to)) return false;
     if (view === "inbox") {
killedBy: filterRequestsByVisibilityAndView filters by from/to date
statusReason: expected [ { userId: 'func-1', …(4) } ] to have a length of +0 but got 1

[Killed] EqualityOperator
lib/requestVisibility.ts:103:25
       if (r.user?.manager?.id !== filters.managerId) return false;
     }
     if (filters.department && r.user?.department !== filters.department) return false;
-    if (filters.from && r.startDate < new Date(filters.from)) return false;
+    if (filters.from && r.startDate >= new Date(filters.from)) return false;
     if (filters.to && r.endDate > new Date(filters.to)) return false;
     if (view === "inbox") {
killedBy: filterRequestsByVisibilityAndView filters by from/to date
statusReason: expected [ { userId: 'func-1', …(4) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
lib/requestVisibility.ts:104:9
     }
     if (filters.department && r.user?.department !== filters.department) return false;
     if (filters.from && r.startDate < new Date(filters.from)) return false;
-    if (filters.to && r.endDate > new Date(filters.to)) return false;
+    if (true) return false;
     if (view === "inbox") {
       if (userLevel === 2 && r.status !== "PENDENTE") return false;
killedBy: filterRequestsByVisibilityAndView keeps request when coord has team visibility and inbox view
statusReason: expected [] to have a length of 1 but got +0

[Timeout] EqualityOperator
lib/requestVisibility.ts:104:23
     }
     if (filters.department && r.user?.department !== filters.department) return false;
     if (filters.from && r.startDate < new Date(filters.from)) return false;
-    if (filters.to && r.endDate > new Date(filters.to)) return false;
+    if (filters.to && r.endDate <= new Date(filters.to)) return false;
     if (view === "inbox") {
       if (userLevel === 2 && r.status !== "PENDENTE") return false;

[Killed] ConditionalExpression
lib/requestVisibility.ts:105:9
     if (filters.department && r.user?.department !== filters.department) return false;
     if (filters.from && r.startDate < new Date(filters.from)) return false;
     if (filters.to && r.endDate > new Date(filters.to)) return false;
-    if (view === "inbox") {
+    if (false) {
       if (userLevel === 2 && r.status !== "PENDENTE") return false;
       if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
killedBy: filterRequestsByVisibilityAndView filters out PENDENTE for coord in inbox (only PENDENTE shown)
statusReason: expected [ { userId: 'func-1', …(4) } ] to have a length of +0 but got 1

[Killed] BlockStatement
lib/requestVisibility.ts:105:27
     if (filters.department && r.user?.department !== filters.department) return false;
     if (filters.from && r.startDate < new Date(filters.from)) return false;
     if (filters.to && r.endDate > new Date(filters.to)) return false;
-    if (view === "inbox") {
-      if (userLevel === 2 && r.status !== "PENDENTE") return false;
-      if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
-      if (
-        userLevel >= 4 &&
-        !["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE"].includes(r.status)
-      ) {
-        return false;
-      }
-    } else if (view === "historico") {
+    if (view === "inbox") {} else if (view === "historico") {
       const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
       if (!processed.includes(r.status)) return false;
killedBy: filterRequestsByVisibilityAndView filters out PENDENTE for coord in inbox (only PENDENTE shown)
statusReason: expected [ { userId: 'func-1', …(4) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
lib/requestVisibility.ts:106:11
     if (filters.from && r.startDate < new Date(filters.from)) return false;
     if (filters.to && r.endDate > new Date(filters.to)) return false;
     if (view === "inbox") {
-      if (userLevel === 2 && r.status !== "PENDENTE") return false;
+      if (true) return false;
       if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
       if (
killedBy: filterRequestsByVisibilityAndView keeps request when coord has team visibility and inbox view
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
lib/requestVisibility.ts:106:11
     if (filters.from && r.startDate < new Date(filters.from)) return false;
     if (filters.to && r.endDate > new Date(filters.to)) return false;
     if (view === "inbox") {
-      if (userLevel === 2 && r.status !== "PENDENTE") return false;
+      if (true && r.status !== "PENDENTE") return false;
       if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
       if (
killedBy: filterRequestsByVisibilityAndView RH with managerId filter
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
lib/requestVisibility.ts:107:11
     if (filters.to && r.endDate > new Date(filters.to)) return false;
     if (view === "inbox") {
       if (userLevel === 2 && r.status !== "PENDENTE") return false;
-      if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
+      if (true && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
       if (
         userLevel >= 4 &&
killedBy: filterRequestsByVisibilityAndView RH with managerId filter
statusReason: expected [] to have a length of 1 but got +0

[Killed] LogicalOperator
lib/requestVisibility.ts:109:9
       if (userLevel === 2 && r.status !== "PENDENTE") return false;
       if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
       if (
-        userLevel >= 4 &&
-        !["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE"].includes(r.status)
+        userLevel >= 4 || !["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE"].includes(r.status)
       ) {
         return false;
killedBy: filterRequestsByVisibilityAndView keeps request when coord has team visibility and inbox view
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
lib/requestVisibility.ts:109:9
       if (userLevel === 2 && r.status !== "PENDENTE") return false;
       if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
       if (
-        userLevel >= 4 &&
+        userLevel < 4 &&
         !["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE"].includes(r.status)
       ) {
killedBy: filterRequestsByVisibilityAndView keeps request when coord has team visibility and inbox view
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
lib/requestVisibility.ts:110:9
       if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
       if (
         userLevel >= 4 &&
-        !["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE"].includes(r.status)
+        ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE"].includes(r.status)
       ) {
         return false;
killedBy: filterRequestsByVisibilityAndView RH with managerId filter
statusReason: expected [] to have a length of 1 but got +0

[Killed] StringLiteral
lib/requestVisibility.ts:110:11
       if (userLevel === 3 && !["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status)) return false;
       if (
         userLevel >= 4 &&
-        !["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE"].includes(r.status)
+        !["", "APROVADO_GESTOR", "APROVADO_GERENTE"].includes(r.status)
       ) {
         return false;
killedBy: filterRequestsByVisibilityAndView RH inbox sees approvals pendentes para RH (APROVADO_COORDENADOR / GERENTE)
statusReason: expected [ 'APROVADO_GERENTE' ] to include 'APROVADO_COORDENADOR'

[Killed] BlockStatement
lib/requestVisibility.ts:111:9
       if (
         userLevel >= 4 &&
         !["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE"].includes(r.status)
-      ) {
-        return false;
-      }
+      ) {}
     } else if (view === "historico") {
       const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
killedBy: filterRequestsByVisibilityAndView RH inbox sees approvals pendentes para RH (APROVADO_COORDENADOR / GERENTE)
statusReason: expected [ 'APROVADO_COORDENADOR', …(2) ] to not include 'PENDENTE'
