[Killed] ConditionalExpression
lib/requestVisibility.ts:114:16
       ) {
         return false;
       }
-    } else if (view === "historico") {
+    } else if (false) {
       const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
       if (!processed.includes(r.status)) return false;
killedBy: filterRequestsByVisibilityAndView historico view: only processed statuses
statusReason: expected [ { userId: 'func-1', …(4) }, …(1) ] to have a length of 1 but got 2

[Killed] EqualityOperator
lib/requestVisibility.ts:114:16
       ) {
         return false;
       }
-    } else if (view === "historico") {
+    } else if (view !== "historico") {
       const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
       if (!processed.includes(r.status)) return false;
killedBy: filterRequestsByVisibilityAndView historico view: only processed statuses
statusReason: expected [ { userId: 'func-1', …(4) }, …(1) ] to have a length of 1 but got 2

[Timeout] StringLiteral
lib/requestVisibility.ts:115:50
         return false;
       }
     } else if (view === "historico") {
-      const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
+      const processed = ["APROVADO_COORDENADOR", "", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
       if (!processed.includes(r.status)) return false;
     }

[Timeout] StringLiteral
lib/requestVisibility.ts:115:104
         return false;
       }
     } else if (view === "historico") {
-      const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
+      const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "", "CANCELADO"];
       if (!processed.includes(r.status)) return false;
     }

[Killed] ConditionalExpression
lib/requestVisibility.ts:116:11
       }
     } else if (view === "historico") {
       const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
-      if (!processed.includes(r.status)) return false;
+      if (false) return false;
     }
     if (filters.query?.trim() && !r.user?.name?.toLowerCase().includes(filters.query.trim().toLowerCase())) return false;
killedBy: filterRequestsByVisibilityAndView historico view: only processed statuses
statusReason: expected [ { userId: 'func-1', …(4) }, …(1) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
lib/requestVisibility.ts:118:9
       const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
       if (!processed.includes(r.status)) return false;
     }
-    if (filters.query?.trim() && !r.user?.name?.toLowerCase().includes(filters.query.trim().toLowerCase())) return false;
+    if (false) return false;
     if (filters.status && filters.status !== "TODOS" && r.status !== filters.status) return false;
     return true;
killedBy: filterRequestsByVisibilityAndView filters by query (name)
statusReason: expected [ { userId: 'func-1', …(4) } ] to have a length of +0 but got 1

[Killed] BooleanLiteral
lib/requestVisibility.ts:118:34
       const processed = ["APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH", "REPROVADO", "CANCELADO"];
       if (!processed.includes(r.status)) return false;
     }
-    if (filters.query?.trim() && !r.user?.name?.toLowerCase().includes(filters.query.trim().toLowerCase())) return false;
+    if (filters.query?.trim() && r.user?.name?.toLowerCase().includes(filters.query.trim().toLowerCase())) return false;
     if (filters.status && filters.status !== "TODOS" && r.status !== filters.status) return false;
     return true;
killedBy: filterRequestsByVisibilityAndView filters by query (name)
statusReason: expected [ { userId: 'func-1', …(4) } ] to have a length of +0 but got 1

[Killed] EqualityOperator
lib/requestVisibility.ts:119:57
       if (!processed.includes(r.status)) return false;
     }
     if (filters.query?.trim() && !r.user?.name?.toLowerCase().includes(filters.query.trim().toLowerCase())) return false;
-    if (filters.status && filters.status !== "TODOS" && r.status !== filters.status) return false;
+    if (filters.status && filters.status !== "TODOS" && r.status === filters.status) return false;
     return true;
   });
killedBy: filterRequestsByVisibilityAndView filters by status
statusReason: expected [ { userId: 'func-1', …(4) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
lib/requestVisibility.ts:119:9
       if (!processed.includes(r.status)) return false;
     }
     if (filters.query?.trim() && !r.user?.name?.toLowerCase().includes(filters.query.trim().toLowerCase())) return false;
-    if (filters.status && filters.status !== "TODOS" && r.status !== filters.status) return false;
+    if (false) return false;
     return true;
   });
killedBy: filterRequestsByVisibilityAndView filters by status
statusReason: expected [ { userId: 'func-1', …(4) } ] to have a length of +0 but got 1

[Killed] BooleanLiteral
lib/requestVisibility.ts:120:12
     }
     if (filters.query?.trim() && !r.user?.name?.toLowerCase().includes(filters.query.trim().toLowerCase())) return false;
     if (filters.status && filters.status !== "TODOS" && r.status !== filters.status) return false;
-    return true;
+    return false;
   });
 }
killedBy: filterRequestsByVisibilityAndView keeps request when coord has team visibility and inbox view
statusReason: expected [] to have a length of 1 but got +0
