[Killed] BlockStatement
lib/utils.ts:8:88
   return twMerge(clsx(inputs))
 }
 
-export function normalizeParam(param: string | string[] | undefined, def = ""): string {
-  if (typeof param === "string") return param;
-  if (Array.isArray(param)) return param[0] ?? def;
-  return def;
-}
+export function normalizeParam(param: string | string[] | undefined, def = ""): string {}
 
killedBy: normalizeParam returns string as-is
statusReason: expected undefined to be 'hello' // Object.is equality

[Killed] ConditionalExpression
lib/utils.ts:9:7
 }
 
 export function normalizeParam(param: string | string[] | undefined, def = ""): string {
-  if (typeof param === "string") return param;
+  if (true) return param;
   if (Array.isArray(param)) return param[0] ?? def;
   return def;
killedBy: normalizeParam returns first element for array
statusReason: expected [ 'a', 'b' ] to be 'a' // Object.is equality

[Killed] EqualityOperator
lib/utils.ts:9:7
 }
 
 export function normalizeParam(param: string | string[] | undefined, def = ""): string {
-  if (typeof param === "string") return param;
+  if (typeof param !== "string") return param;
   if (Array.isArray(param)) return param[0] ?? def;
   return def;
killedBy: normalizeParam returns string as-is
statusReason: expected '' to be 'hello' // Object.is equality

[Killed] ConditionalExpression
lib/utils.ts:10:7
 
 export function normalizeParam(param: string | string[] | undefined, def = ""): string {
   if (typeof param === "string") return param;
-  if (Array.isArray(param)) return param[0] ?? def;
+  if (true) return param[0] ?? def;
   return def;
 }
killedBy: normalizeParam returns default for undefined
statusReason: Cannot read properties of undefined (reading '0')

[Killed] LogicalOperator
lib/utils.ts:10:36
 
 export function normalizeParam(param: string | string[] | undefined, def = ""): string {
   if (typeof param === "string") return param;
-  if (Array.isArray(param)) return param[0] ?? def;
+  if (Array.isArray(param)) return param[0] && def;
   return def;
 }
killedBy: normalizeParam returns first element for array
statusReason: expected '' to be 'a' // Object.is equality
