[Killed] ArithmeticOperator
lib/vacationRules.ts:6:27
 // Hierarquia: FUNCIONARIO → COORDENADOR → GERENTE → RH
 // ============================================================
 
-export const ONE_DAY_MS = 24 * 60 * 60 * 1000;
+export const ONE_DAY_MS = 24 * 60 / 60 * 1000;
 
 function toUtcMidnight(date: Date): Date {
killedBy: validateCltPeriods requires at least one period of 14+ days when existingDaysInCycle < 14
statusReason: expected 'Total do ciclo não pode ultrapassar 3…' to contain '14'

[Killed] ArithmeticOperator
lib/vacationRules.ts:6:27
 // Hierarquia: FUNCIONARIO → COORDENADOR → GERENTE → RH
 // ============================================================
 
-export const ONE_DAY_MS = 24 * 60 * 60 * 1000;
+export const ONE_DAY_MS = 24 / 60 * 60 * 1000;
 
 function toUtcMidnight(date: Date): Date {
killedBy: validateCltPeriods requires at least one period of 14+ days when existingDaysInCycle < 14
statusReason: expected 'Total do ciclo não pode ultrapassar 3…' to contain '14'

[Killed] BlockStatement
lib/vacationRules.ts:8:42
 
 export const ONE_DAY_MS = 24 * 60 * 60 * 1000;
 
-function toUtcMidnight(date: Date): Date {
-  return new Date(Date.UTC(date.getUTCFullYear(), date.getUTCMonth(), date.getUTCDate()));
-}
+function toUtcMidnight(date: Date): Date {}
 
 function daysBetweenInclusive(start: Date, end: Date): number {
killedBy: getCurrentUserBalance returns balance from findUserWithBalance
statusReason: Cannot read properties of undefined (reading 'getFullYear')

[Killed] BlockStatement
lib/vacationRules.ts:12:63
   return new Date(Date.UTC(date.getUTCFullYear(), date.getUTCMonth(), date.getUTCDate()));
 }
 
-function daysBetweenInclusive(start: Date, end: Date): number {
-  const s = toUtcMidnight(start);
-  const e = toUtcMidnight(end);
-  return Math.round((e.getTime() - s.getTime()) / ONE_DAY_MS) + 1;
-}
+function daysBetweenInclusive(start: Date, end: Date): number {}
 
 function getUtcWeekDay(date: Date): number {
killedBy: getCurrentUserBalance returns balance from findUserWithBalance
statusReason: expected NaN to be 15 // Object.is equality

[Killed] ArithmeticOperator
lib/vacationRules.ts:15:10
 function daysBetweenInclusive(start: Date, end: Date): number {
   const s = toUtcMidnight(start);
   const e = toUtcMidnight(end);
-  return Math.round((e.getTime() - s.getTime()) / ONE_DAY_MS) + 1;
+  return Math.round((e.getTime() - s.getTime()) / ONE_DAY_MS) - 1;
 }
 
killedBy: validateCltPeriods accepts period of 14 days with end on weekday (checkAdvanceNotice false)
statusReason: expected 'Pelo menos um período deve ter 14 dia…' to be null

[Killed] ArithmeticOperator
lib/vacationRules.ts:15:21
 function daysBetweenInclusive(start: Date, end: Date): number {
   const s = toUtcMidnight(start);
   const e = toUtcMidnight(end);
-  return Math.round((e.getTime() - s.getTime()) / ONE_DAY_MS) + 1;
+  return Math.round((e.getTime() - s.getTime()) * ONE_DAY_MS) + 1;
 }
 
killedBy: getCurrentUserBalance returns balance from findUserWithBalance
statusReason: expected 30 to be 15 // Object.is equality

[Killed] BlockStatement
lib/vacationRules.ts:18:44
   return Math.round((e.getTime() - s.getTime()) / ONE_DAY_MS) + 1;
 }
 
-function getUtcWeekDay(date: Date): number {
-  const d = toUtcMidnight(date);
-  return d.getUTCDay(); // 0..6
-}
+function getUtcWeekDay(date: Date): number {}
 
 export type VacationPeriod = {
killedBy: validateCltPeriod (weekend) rejects start on Friday (local date)
statusReason: expected null to be truthy

[Killed] ObjectLiteral
lib/vacationRules.ts:41:51
   RH: 4,
 };
 
-export const ROLE_LABEL: Record<string, string> = {
-  COLABORADOR: "Funcionário(a)",
-  FUNCIONARIO: "Funcionário(a)",
-  GESTOR: "Coordenador(a)",
-  COORDENADOR: "Coordenador(a)",
-  GERENTE: "Gerente",
-  RH: "RH / Admin",
-};
+export const ROLE_LABEL: Record<string, string> = {};
 
 export const ROLE_COLOR: Record<string, string> = {
killedBy: getRoleLabel returns label for known roles
statusReason: expected 'FUNCIONARIO' to be 'Funcionário(a)' // Object.is equality

[Timeout] StringLiteral
lib/vacationRules.ts:42:16
 };
 
 export const ROLE_LABEL: Record<string, string> = {
-  COLABORADOR: "Funcionário(a)",
+  COLABORADOR: "",
   FUNCIONARIO: "Funcionário(a)",
   GESTOR: "Coordenador(a)",

[Killed] StringLiteral
lib/vacationRules.ts:47:7
   GESTOR: "Coordenador(a)",
   COORDENADOR: "Coordenador(a)",
   GERENTE: "Gerente",
-  RH: "RH / Admin",
+  RH: "",
 };
 
killedBy: getRoleLabel returns label for known roles
statusReason: expected '' to be 'RH / Admin' // Object.is equality

[Killed] ObjectLiteral
lib/vacationRules.ts:50:51
   RH: "RH / Admin",
 };
 
-export const ROLE_COLOR: Record<string, string> = {
-  COLABORADOR: "blue",
-  FUNCIONARIO: "blue",
-  GESTOR: "indigo",
-  COORDENADOR: "indigo",
-  GERENTE: "purple",
-  RH: "emerald",
-};
+export const ROLE_COLOR: Record<string, string> = {};
 
 /** Retorna o nível numérico do papel (1=Funcionário, 4=RH) */
killedBy: ROLE_COLOR returns color for known roles
statusReason: expected undefined to be 'blue' // Object.is equality

[Timeout] StringLiteral
lib/vacationRules.ts:51:16
 };
 
 export const ROLE_COLOR: Record<string, string> = {
-  COLABORADOR: "blue",
+  COLABORADOR: "",
   FUNCIONARIO: "blue",
   GESTOR: "indigo",

[Killed] BlockStatement
lib/vacationRules.ts:60:52
 };
 
 /** Retorna o nível numérico do papel (1=Funcionário, 4=RH) */
-export function getRoleLevel(role: string): number {
-  return ROLE_LEVEL[role] ?? 1;
-}
+export function getRoleLevel(role: string): number {}
 
 /** Retorna o rótulo amigável do papel */
killedBy: getRoleLevel returns 1 for FUNCIONARIO and COLABORADOR
statusReason: expected undefined to be 1 // Object.is equality

[Killed] LogicalOperator
lib/vacationRules.ts:61:10
 
 /** Retorna o nível numérico do papel (1=Funcionário, 4=RH) */
 export function getRoleLevel(role: string): number {
-  return ROLE_LEVEL[role] ?? 1;
+  return ROLE_LEVEL[role] && 1;
 }
 
killedBy: getRoleLevel returns 2 for COORDENADOR and GESTOR
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
lib/vacationRules.ts:65:52
 }
 
 /** Retorna o rótulo amigável do papel */
-export function getRoleLabel(role: string): string {
-  return ROLE_LABEL[role] ?? role;
-}
+export function getRoleLabel(role: string): string {}
 
 // ============================================================
killedBy: getRoleLabel returns label for known roles
statusReason: expected undefined to be 'Funcionário(a)' // Object.is equality

[Killed] LogicalOperator
lib/vacationRules.ts:66:10
 
 /** Retorna o rótulo amigável do papel */
 export function getRoleLabel(role: string): string {
-  return ROLE_LABEL[role] ?? role;
+  return ROLE_LABEL[role] && role;
 }
 
killedBy: getRoleLabel returns label for known roles
statusReason: expected 'FUNCIONARIO' to be 'Funcionário(a)' // Object.is equality

[Killed] BlockStatement
lib/vacationRules.ts:77:69
  * Dado o papel do aprovador, retorna o próximo status da solicitação.
  * A progressão segue a hierarquia de cargos.
  */
-export function getNextApprovalStatus(approverRole: string): string {
-  const level = ROLE_LEVEL[approverRole] ?? 1;
-  if (level >= 4) return "APROVADO_RH";
-  // Primeira etapa única: Coordenador OU Gerente podem aprovar para APROVADO_COORDENADOR
-  return "APROVADO_COORDENADOR";
-}
+export function getNextApprovalStatus(approverRole: string): string {}
 
 /**
killedBy: getNextApprovalStatus returns APROVADO_COORDENADOR for level 2
statusReason: expected undefined to be 'APROVADO_COORDENADOR' // Object.is equality

[Killed] LogicalOperator
lib/vacationRules.ts:78:17
  * A progressão segue a hierarquia de cargos.
  */
 export function getNextApprovalStatus(approverRole: string): string {
-  const level = ROLE_LEVEL[approverRole] ?? 1;
+  const level = ROLE_LEVEL[approverRole] && 1;
   if (level >= 4) return "APROVADO_RH";
   // Primeira etapa única: Coordenador OU Gerente podem aprovar para APROVADO_COORDENADOR
killedBy: getNextApprovalStatus returns APROVADO_RH for level 4
statusReason: expected 'APROVADO_COORDENADOR' to be 'APROVADO_RH' // Object.is equality

[Killed] EqualityOperator
lib/vacationRules.ts:79:7
  */
 export function getNextApprovalStatus(approverRole: string): string {
   const level = ROLE_LEVEL[approverRole] ?? 1;
-  if (level >= 4) return "APROVADO_RH";
+  if (level < 4) return "APROVADO_RH";
   // Primeira etapa única: Coordenador OU Gerente podem aprovar para APROVADO_COORDENADOR
   return "APROVADO_COORDENADOR";
killedBy: getNextApprovalStatus returns APROVADO_COORDENADOR for level 2
statusReason: expected 'APROVADO_RH' to be 'APROVADO_COORDENADOR' // Object.is equality

[Killed] EqualityOperator
lib/vacationRules.ts:79:7
  */
 export function getNextApprovalStatus(approverRole: string): string {
   const level = ROLE_LEVEL[approverRole] ?? 1;
-  if (level >= 4) return "APROVADO_RH";
+  if (level > 4) return "APROVADO_RH";
   // Primeira etapa única: Coordenador OU Gerente podem aprovar para APROVADO_COORDENADOR
   return "APROVADO_COORDENADOR";
killedBy: getNextApprovalStatus returns APROVADO_RH for level 4
statusReason: expected 'APROVADO_COORDENADOR' to be 'APROVADO_RH' // Object.is equality

[Killed] BlockStatement
lib/vacationRules.ts:98:12
     status: string;
     user: { role: string };
   },
-): boolean {
-  // Não pode aprovar a própria solicitação
-  if (request.userId === approverUserId) return false;
-
-  const approverLevel = ROLE_LEVEL[approverRole] ?? 1;
-  const requesterLevel = ROLE_LEVEL[request.user.role] ?? 1;
-
-  // Aprovador deve ser de nível superior ao solicitante
-  if (approverLevel <= requesterLevel) return false;
-
-  // Mapeamento de status → nível mínimo necessário para aprovar
-  const requiredLevel = getRequiredApproverLevel(request.status, requesterLevel);
-  if (requiredLevel === null) return false; // já está em estado terminal
-
-  return approverLevel >= requiredLevel;
-}
+): boolean {}
 
 /**
killedBy: canApproveRequest returns false when approver is the request owner (self-approval)
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:100:7
   },
 ): boolean {
   // Não pode aprovar a própria solicitação
-  if (request.userId === approverUserId) return false;
+  if (false) return false;
 
   const approverLevel = ROLE_LEVEL[approverRole] ?? 1;
killedBy: canApproveRequest returns false when approver is the request owner (self-approval)
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
lib/vacationRules.ts:100:49
   },
 ): boolean {
   // Não pode aprovar a própria solicitação
-  if (request.userId === approverUserId) return false;
+  if (request.userId === approverUserId) return true;
 
   const approverLevel = ROLE_LEVEL[approverRole] ?? 1;
killedBy: canApproveRequest returns false when approver is the request owner (self-approval)
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
lib/vacationRules.ts:102:25
   // Não pode aprovar a própria solicitação
   if (request.userId === approverUserId) return false;
 
-  const approverLevel = ROLE_LEVEL[approverRole] ?? 1;
+  const approverLevel = ROLE_LEVEL[approverRole] && 1;
   const requesterLevel = ROLE_LEVEL[request.user.role] ?? 1;
 
killedBy: canApproveRequest returns true for Coordenador approving PENDENTE from Funcionario
statusReason: expected false to be true // Object.is equality

[Timeout] LogicalOperator
lib/vacationRules.ts:103:26
   if (request.userId === approverUserId) return false;
 
   const approverLevel = ROLE_LEVEL[approverRole] ?? 1;
-  const requesterLevel = ROLE_LEVEL[request.user.role] ?? 1;
+  const requesterLevel = ROLE_LEVEL[request.user.role] && 1;
 
   // Aprovador deve ser de nível superior ao solicitante

[Killed] EqualityOperator
lib/vacationRules.ts:106:7
   const requesterLevel = ROLE_LEVEL[request.user.role] ?? 1;
 
   // Aprovador deve ser de nível superior ao solicitante
-  if (approverLevel <= requesterLevel) return false;
+  if (approverLevel > requesterLevel) return false;
 
   // Mapeamento de status → nível mínimo necessário para aprovar
killedBy: canApproveRequest returns true for Coordenador approving PENDENTE from Funcionario
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
lib/vacationRules.ts:106:47
   const requesterLevel = ROLE_LEVEL[request.user.role] ?? 1;
 
   // Aprovador deve ser de nível superior ao solicitante
-  if (approverLevel <= requesterLevel) return false;
+  if (approverLevel <= requesterLevel) return true;
 
   // Mapeamento de status → nível mínimo necessário para aprovar
killedBy: canApproveRequest returns false when approver level <= requester level
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:110:7
 
   // Mapeamento de status → nível mínimo necessário para aprovar
   const requiredLevel = getRequiredApproverLevel(request.status, requesterLevel);
-  if (requiredLevel === null) return false; // já está em estado terminal
+  if (true) return false; // já está em estado terminal
 
   return approverLevel >= requiredLevel;
killedBy: canApproveRequest returns true for Coordenador approving PENDENTE from Funcionario
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
lib/vacationRules.ts:110:7
 
   // Mapeamento de status → nível mínimo necessário para aprovar
   const requiredLevel = getRequiredApproverLevel(request.status, requesterLevel);
-  if (requiredLevel === null) return false; // já está em estado terminal
+  if (requiredLevel !== null) return false; // já está em estado terminal
 
   return approverLevel >= requiredLevel;
killedBy: canApproveRequest returns true for Coordenador approving PENDENTE from Funcionario
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:112:10
   const requiredLevel = getRequiredApproverLevel(request.status, requesterLevel);
   if (requiredLevel === null) return false; // já está em estado terminal
 
-  return approverLevel >= requiredLevel;
+  return true;
 }
 
killedBy: canApproveRequest returns false for Coordenador approving APROVADO_GERENTE (needs RH)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
lib/vacationRules.ts:112:10
   const requiredLevel = getRequiredApproverLevel(request.status, requesterLevel);
   if (requiredLevel === null) return false; // já está em estado terminal
 
-  return approverLevel >= requiredLevel;
+  return approverLevel < requiredLevel;
 }
 
killedBy: canApproveRequest returns true for Coordenador approving PENDENTE from Funcionario
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
lib/vacationRules.ts:119:90
  * Retorna o nível mínimo necessário para aprovar uma solicitação
  * dado o status atual e o nível do solicitante.
  */
-function getRequiredApproverLevel(status: string, requesterLevel: number): number | null {
-  switch (status) {
-    case "PENDENTE":
-      // Primeira etapa pode ser feita por Coordenador OU Gerente (nível 2+)
-      return 2;
-    case "APROVADO_COORDENADOR":
-    case "APROVADO_GESTOR": // legado
-    case "APROVADO_GERENTE": // legado
-      // Após primeira aprovação, apenas RH conclui
-      return 4;
-    default:
-      // Status terminal: APROVADO_RH, REPROVADO, CANCELADO
-      return null;
-  }
-}
+function getRequiredApproverLevel(status: string, requesterLevel: number): number | null {}
 
 /**
killedBy: canApproveRequest returns true for Coordenador approving PENDENTE from Funcionario
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:121:5
  */
 function getRequiredApproverLevel(status: string, requesterLevel: number): number | null {
   switch (status) {
-    case "PENDENTE":
-      // Primeira etapa pode ser feita por Coordenador OU Gerente (nível 2+)
-      return 2;
+    case "PENDENTE":
     case "APROVADO_COORDENADOR":
     case "APROVADO_GESTOR": // legado
killedBy: canApproveRequest returns true for Coordenador approving PENDENTE from Funcionario
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
lib/vacationRules.ts:121:10
  */
 function getRequiredApproverLevel(status: string, requesterLevel: number): number | null {
   switch (status) {
-    case "PENDENTE":
+    case "":
       // Primeira etapa pode ser feita por Coordenador OU Gerente (nível 2+)
       return 2;
killedBy: Workflow: approval chain (Coordenador/ Gerente → RH) PENDENTE can be approved by Coordenador or Gerente
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:126:5
       return 2;
     case "APROVADO_COORDENADOR":
     case "APROVADO_GESTOR": // legado
-    case "APROVADO_GERENTE": // legado
-      // Após primeira aprovação, apenas RH conclui
-      return 4;
+    // legado
+case "APROVADO_GERENTE":
     default:
       // Status terminal: APROVADO_RH, REPROVADO, CANCELADO
killedBy: canApproveRequest returns true for RH approving APROVADO_GERENTE
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
lib/vacationRules.ts:126:10
       return 2;
     case "APROVADO_COORDENADOR":
     case "APROVADO_GESTOR": // legado
-    case "APROVADO_GERENTE": // legado
+    case "": // legado
       // Após primeira aprovação, apenas RH conclui
       return 4;
killedBy: canApproveRequest returns true for RH approving APROVADO_GERENTE
statusReason: expected false to be true // Object.is equality

[Timeout] ConditionalExpression
lib/vacationRules.ts:129:5
     case "APROVADO_GERENTE": // legado
       // Após primeira aprovação, apenas RH conclui
       return 4;
-    default:
-      // Status terminal: APROVADO_RH, REPROVADO, CANCELADO
-      return null;
+    default:
   }
 }

[Killed] BlockStatement
lib/vacationRules.ts:138:87
 /**
  * Retorna quem precisa aprovar em seguida, para exibição na UI.
  */
-export function getNextApprover(status: string, requesterRole: string): string | null {
-  const requesterLevel = ROLE_LEVEL[requesterRole] ?? 1;
-  const requiredLevel = getRequiredApproverLevel(status, requesterLevel);
-
-  if (requiredLevel === null) return null;
-
-  const levelToLabel: Record<number, string> = {
-    2: "Coordenador(a)",
-    3: "Gerente",
-    4: "RH",
-  };
-
-  return levelToLabel[requiredLevel] ?? null;
-}
+export function getNextApprover(status: string, requesterRole: string): string | null {}
 
 /**
killedBy: getNextApprover returns Coordenador for PENDENTE from Funcionario
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Timeout] LogicalOperator
lib/vacationRules.ts:139:26
  * Retorna quem precisa aprovar em seguida, para exibição na UI.
  */
 export function getNextApprover(status: string, requesterRole: string): string | null {
-  const requesterLevel = ROLE_LEVEL[requesterRole] ?? 1;
+  const requesterLevel = ROLE_LEVEL[requesterRole] && 1;
   const requiredLevel = getRequiredApproverLevel(status, requesterLevel);
 

[Killed] ConditionalExpression
lib/vacationRules.ts:142:7
   const requesterLevel = ROLE_LEVEL[requesterRole] ?? 1;
   const requiredLevel = getRequiredApproverLevel(status, requesterLevel);
 
-  if (requiredLevel === null) return null;
+  if (true) return null;
 
   const levelToLabel: Record<number, string> = {
killedBy: getNextApprover returns Coordenador for PENDENTE from Funcionario
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] EqualityOperator
lib/vacationRules.ts:142:7
   const requesterLevel = ROLE_LEVEL[requesterRole] ?? 1;
   const requiredLevel = getRequiredApproverLevel(status, requesterLevel);
 
-  if (requiredLevel === null) return null;
+  if (requiredLevel !== null) return null;
 
   const levelToLabel: Record<number, string> = {
killedBy: getNextApprover returns Coordenador for PENDENTE from Funcionario
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ObjectLiteral
lib/vacationRules.ts:144:48
 
   if (requiredLevel === null) return null;
 
-  const levelToLabel: Record<number, string> = {
-    2: "Coordenador(a)",
-    3: "Gerente",
-    4: "RH",
-  };
+  const levelToLabel: Record<number, string> = {};
 
   return levelToLabel[requiredLevel] ?? null;
killedBy: getNextApprover returns Coordenador for PENDENTE from Funcionario
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] StringLiteral
lib/vacationRules.ts:145:8
   if (requiredLevel === null) return null;
 
   const levelToLabel: Record<number, string> = {
-    2: "Coordenador(a)",
+    2: "",
     3: "Gerente",
     4: "RH",
killedBy: getNextApprover returns Coordenador for PENDENTE from Funcionario
statusReason: expected '' to contain 'Coordenador'

[Killed] StringLiteral
lib/vacationRules.ts:147:8
   const levelToLabel: Record<number, string> = {
     2: "Coordenador(a)",
     3: "Gerente",
-    4: "RH",
+    4: "",
   };
 
killedBy: getNextApprover returns RH for APROVADO_COORDENADOR
statusReason: expected '' to contain 'RH'

[Killed] LogicalOperator
lib/vacationRules.ts:150:10
     4: "RH",
   };
 
-  return levelToLabel[requiredLevel] ?? null;
+  return levelToLabel[requiredLevel] && null;
 }
 
killedBy: getNextApprover returns Coordenador for PENDENTE from Funcionario
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
lib/vacationRules.ts:157:67
  * Retorna as etapas do fluxo de aprovação para um solicitante.
  * Usado para renderizar o indicador de progresso.
  */
-export function getApprovalSteps(requesterRole: string): string[] {
-  const level = ROLE_LEVEL[requesterRole] ?? 1;
-
-  if (level >= 4) return []; // RH não precisa de aprovação de outros
-  // Para Funcionário/Colaborador, Coordenador ou Gerente: duas etapas visíveis
-  return ["Coordenador(a) / Gerente", "RH"];
-}
+export function getApprovalSteps(requesterRole: string): string[] {}
 
 /**
killedBy: getApprovalSteps returns 2 steps (Coordenador/Gerente → RH) for FUNCIONARIO
statusReason: expected undefined to deeply equal [ 'Coordenador(a) / Gerente', 'RH' ]

[Killed] LogicalOperator
lib/vacationRules.ts:158:17
  * Usado para renderizar o indicador de progresso.
  */
 export function getApprovalSteps(requesterRole: string): string[] {
-  const level = ROLE_LEVEL[requesterRole] ?? 1;
+  const level = ROLE_LEVEL[requesterRole] && 1;
 
   if (level >= 4) return []; // RH não precisa de aprovação de outros
killedBy: getApprovalSteps returns empty for RH
statusReason: expected [ 'Coordenador(a) / Gerente', 'RH' ] to deeply equal []

[Killed] ConditionalExpression
lib/vacationRules.ts:160:7
 export function getApprovalSteps(requesterRole: string): string[] {
   const level = ROLE_LEVEL[requesterRole] ?? 1;
 
-  if (level >= 4) return []; // RH não precisa de aprovação de outros
+  if (false) return []; // RH não precisa de aprovação de outros
   // Para Funcionário/Colaborador, Coordenador ou Gerente: duas etapas visíveis
   return ["Coordenador(a) / Gerente", "RH"];
killedBy: getApprovalSteps returns empty for RH
statusReason: expected [ 'Coordenador(a) / Gerente', 'RH' ] to deeply equal []

[Killed] EqualityOperator
lib/vacationRules.ts:160:7
 export function getApprovalSteps(requesterRole: string): string[] {
   const level = ROLE_LEVEL[requesterRole] ?? 1;
 
-  if (level >= 4) return []; // RH não precisa de aprovação de outros
+  if (level > 4) return []; // RH não precisa de aprovação de outros
   // Para Funcionário/Colaborador, Coordenador ou Gerente: duas etapas visíveis
   return ["Coordenador(a) / Gerente", "RH"];
killedBy: getApprovalSteps returns empty for RH
statusReason: expected [ 'Coordenador(a) / Gerente', 'RH' ] to deeply equal []

[Killed] BlockStatement
lib/vacationRules.ts:168:61
 /**
  * Retorna o progresso atual no fluxo de aprovação (etapa atual).
  */
-export function getApprovalProgress(status: string): number {
-  switch (status) {
-    case "PENDENTE":
-      return 0;
-    case "APROVADO_COORDENADOR":
-    case "APROVADO_GESTOR": // legado
-    case "APROVADO_GERENTE": // legado
-      return 1;
-    case "APROVADO_RH":
-      return 2;
-    default:
-      return 0;
-  }
-}
+export function getApprovalProgress(status: string): number {}
 
 // ============================================================
killedBy: getApprovalProgress returns 0 for PENDENTE
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:170:5
  */
 export function getApprovalProgress(status: string): number {
   switch (status) {
-    case "PENDENTE":
-      return 0;
+    case "PENDENTE":
     case "APROVADO_COORDENADOR":
     case "APROVADO_GESTOR": // legado
killedBy: getApprovalProgress returns 0 for PENDENTE
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:174:5
       return 0;
     case "APROVADO_COORDENADOR":
     case "APROVADO_GESTOR": // legado
-    case "APROVADO_GERENTE": // legado
-      return 1;
+    // legado
+case "APROVADO_GERENTE":
     case "APROVADO_RH":
       return 2;
killedBy: getApprovalProgress returns 1 for APROVADO_COORDENADOR/APROVADO_GESTOR
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:176:5
     case "APROVADO_GESTOR": // legado
     case "APROVADO_GERENTE": // legado
       return 1;
-    case "APROVADO_RH":
-      return 2;
+    case "APROVADO_RH":
     default:
       return 0;
killedBy: getApprovalProgress returns 2 for APROVADO_RH
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:178:5
       return 1;
     case "APROVADO_RH":
       return 2;
-    default:
-      return 0;
+    default:
   }
 }
killedBy: getApprovalProgress returns 0 for REPROVADO
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
lib/vacationRules.ts:201:12
       manager?: { managerId: string | null } | null;
     };
   },
-): boolean {
-  // RH vê tudo
-  if (approverRole === "RH") return true;
-
-  // Coordenador/Gestor: vê apenas reportes diretos + próprias solicitações
-  if (ROLE_LEVEL[approverRole] === 2) {
-    return (
-      request.user.managerId === approverUserId ||
-      request.userId === approverUserId
-    );
-  }
-
-  // Gerente: vê reportes diretos (coordenadores) E seus subordinados (funcionários)
-  if (ROLE_LEVEL[approverRole] === 3) {
-    return (
-      request.user.managerId === approverUserId ||           // coordenador direto
-      request.user.manager?.managerId === approverUserId ||  // funcionário do coord
-      request.userId === approverUserId                       // própria solicitação
-    );
-  }
-
-  return false;
-}
+): boolean {}
 
 // ============================================================
killedBy: hasTeamVisibility RH sees all requests
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
lib/vacationRules.ts:203:37
   },
 ): boolean {
   // RH vê tudo
-  if (approverRole === "RH") return true;
+  if (approverRole === "RH") return false;
 
   // Coordenador/Gestor: vê apenas reportes diretos + próprias solicitações
killedBy: hasTeamVisibility RH sees all requests
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:203:7
   },
 ): boolean {
   // RH vê tudo
-  if (approverRole === "RH") return true;
+  if (true) return true;
 
   // Coordenador/Gestor: vê apenas reportes diretos + próprias solicitações
killedBy: hasTeamVisibility Coordenador sees only direct reports
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
lib/vacationRules.ts:206:39
   if (approverRole === "RH") return true;
 
   // Coordenador/Gestor: vê apenas reportes diretos + próprias solicitações
-  if (ROLE_LEVEL[approverRole] === 2) {
-    return (
-      request.user.managerId === approverUserId ||
-      request.userId === approverUserId
-    );
-  }
+  if (ROLE_LEVEL[approverRole] === 2) {}
 
   // Gerente: vê reportes diretos (coordenadores) E seus subordinados (funcionários)
killedBy: hasTeamVisibility Coordenador sees only direct reports
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:206:7
   if (approverRole === "RH") return true;
 
   // Coordenador/Gestor: vê apenas reportes diretos + próprias solicitações
-  if (ROLE_LEVEL[approverRole] === 2) {
+  if (false) {
     return (
       request.user.managerId === approverUserId ||
killedBy: hasTeamVisibility Coordenador sees only direct reports
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:208:7
   // Coordenador/Gestor: vê apenas reportes diretos + próprias solicitações
   if (ROLE_LEVEL[approverRole] === 2) {
     return (
-      request.user.managerId === approverUserId ||
-      request.userId === approverUserId
+      false
     );
   }
killedBy: hasTeamVisibility Coordenador sees only direct reports
statusReason: expected false to be true // Object.is equality
