[Killed] ConditionalExpression
lib/vacationRules.ts:208:7
   // Coordenador/Gestor: vê apenas reportes diretos + próprias solicitações
   if (ROLE_LEVEL[approverRole] === 2) {
     return (
-      request.user.managerId === approverUserId ||
+      false ||
       request.userId === approverUserId
     );
killedBy: hasTeamVisibility Coordenador sees only direct reports
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
lib/vacationRules.ts:209:7
   if (ROLE_LEVEL[approverRole] === 2) {
     return (
       request.user.managerId === approverUserId ||
-      request.userId === approverUserId
+      request.userId !== approverUserId
     );
   }
killedBy: hasTeamVisibility Coordenador sees only direct reports
statusReason: expected true to be false // Object.is equality

[Timeout] ConditionalExpression
lib/vacationRules.ts:209:7
   if (ROLE_LEVEL[approverRole] === 2) {
     return (
       request.user.managerId === approverUserId ||
-      request.userId === approverUserId
+      false
     );
   }

[Killed] EqualityOperator
lib/vacationRules.ts:214:7
   }
 
   // Gerente: vê reportes diretos (coordenadores) E seus subordinados (funcionários)
-  if (ROLE_LEVEL[approverRole] === 3) {
+  if (ROLE_LEVEL[approverRole] !== 3) {
     return (
       request.user.managerId === approverUserId ||           // coordenador direto
killedBy: hasTeamVisibility Gerente sees direct and indirect reports
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:214:7
   }
 
   // Gerente: vê reportes diretos (coordenadores) E seus subordinados (funcionários)
-  if (ROLE_LEVEL[approverRole] === 3) {
+  if (false) {
     return (
       request.user.managerId === approverUserId ||           // coordenador direto
killedBy: hasTeamVisibility Gerente sees direct and indirect reports
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
lib/vacationRules.ts:216:7
   // Gerente: vê reportes diretos (coordenadores) E seus subordinados (funcionários)
   if (ROLE_LEVEL[approverRole] === 3) {
     return (
-      request.user.managerId === approverUserId ||           // coordenador direto
+      request.user.managerId !== approverUserId ||           // coordenador direto
       request.user.manager?.managerId === approverUserId ||  // funcionário do coord
       request.userId === approverUserId                       // própria solicitação
killedBy: hasTeamVisibility Gerente sees direct and indirect reports
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
lib/vacationRules.ts:216:7
   // Gerente: vê reportes diretos (coordenadores) E seus subordinados (funcionários)
   if (ROLE_LEVEL[approverRole] === 3) {
     return (
-      request.user.managerId === approverUserId ||           // coordenador direto
-      request.user.manager?.managerId === approverUserId ||  // funcionário do coord
+      request.user.managerId === approverUserId &&
+// coordenador direto
+request.user.manager?.managerId === approverUserId ||  // funcionário do coord
       request.userId === approverUserId                       // própria solicitação
     );
killedBy: hasTeamVisibility Gerente sees direct and indirect reports
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:217:7
   if (ROLE_LEVEL[approverRole] === 3) {
     return (
       request.user.managerId === approverUserId ||           // coordenador direto
-      request.user.manager?.managerId === approverUserId ||  // funcionário do coord
+      false ||  // funcionário do coord
       request.userId === approverUserId                       // própria solicitação
     );
killedBy: hasTeamVisibility Gerente sees direct and indirect reports
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
lib/vacationRules.ts:217:7
   if (ROLE_LEVEL[approverRole] === 3) {
     return (
       request.user.managerId === approverUserId ||           // coordenador direto
-      request.user.manager?.managerId === approverUserId ||  // funcionário do coord
+      // coordenador direto
+request.user.manager?.managerId !== approverUserId ||  // funcionário do coord
       request.userId === approverUserId                       // própria solicitação
     );
killedBy: hasTeamVisibility Gerente sees direct and indirect reports
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
lib/vacationRules.ts:218:7
     return (
       request.user.managerId === approverUserId ||           // coordenador direto
       request.user.manager?.managerId === approverUserId ||  // funcionário do coord
-      request.userId === approverUserId                       // própria solicitação
+      // funcionário do coord
+request.userId !== approverUserId                       // própria solicitação
     );
   }
killedBy: hasTeamVisibility Gerente sees direct and indirect reports
statusReason: expected true to be false // Object.is equality

[Timeout] ConditionalExpression
lib/vacationRules.ts:218:7
     return (
       request.user.managerId === approverUserId ||           // coordenador direto
       request.user.manager?.managerId === approverUserId ||  // funcionário do coord
-      request.userId === approverUserId                       // própria solicitação
+      false                       // própria solicitação
     );
   }

[Killed] ConditionalExpression
lib/vacationRules.ts:250:7
 ): VacationBalance {
   const currentYear = today.getFullYear();
 
-  if (!hireDate) {
+  if (true) {
     // Sem data de admissão: assume entitlement completo
     const usedDays = calcUsedDays(approvedRequests, "APROVADO_RH", currentYear);
killedBy: calculateVacationBalance returns hasEntitlement false when hireDate is less than 12 months ago
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
lib/vacationRules.ts:250:7
 ): VacationBalance {
   const currentYear = today.getFullYear();
 
-  if (!hireDate) {
+  if (hireDate) {
     // Sem data de admissão: assume entitlement completo
     const usedDays = calcUsedDays(approvedRequests, "APROVADO_RH", currentYear);
killedBy: calculateVacationBalance returns hasEntitlement false when hireDate is less than 12 months ago
statusReason: expected true to be false // Object.is equality

[Timeout] ArithmeticOperator
lib/vacationRules.ts:253:25
   if (!hireDate) {
     // Sem data de admissão: assume entitlement completo
     const usedDays = calcUsedDays(approvedRequests, "APROVADO_RH", currentYear);
-    const pendingDays = calcUsedDays(approvedRequests, "PENDENTE", currentYear) +
-      calcUsedDays(approvedRequests, "APROVADO_COORDENADOR", currentYear) +
+    const pendingDays = calcUsedDays(approvedRequests, "PENDENTE", currentYear) - calcUsedDays(approvedRequests, "APROVADO_COORDENADOR", currentYear) +
       calcUsedDays(approvedRequests, "APROVADO_GESTOR", currentYear) +
       calcUsedDays(approvedRequests, "APROVADO_GERENTE", currentYear);

[Killed] StringLiteral
lib/vacationRules.ts:253:56
   if (!hireDate) {
     // Sem data de admissão: assume entitlement completo
     const usedDays = calcUsedDays(approvedRequests, "APROVADO_RH", currentYear);
-    const pendingDays = calcUsedDays(approvedRequests, "PENDENTE", currentYear) +
+    const pendingDays = calcUsedDays(approvedRequests, "", currentYear) +
       calcUsedDays(approvedRequests, "APROVADO_COORDENADOR", currentYear) +
       calcUsedDays(approvedRequests, "APROVADO_GESTOR", currentYear) +
killedBy: calculateVacationBalance (null hireDate) counts pending days when hireDate is null (current year)
statusReason: expected +0 to be 15 // Object.is equality

[Timeout] StringLiteral
lib/vacationRules.ts:254:38
     // Sem data de admissão: assume entitlement completo
     const usedDays = calcUsedDays(approvedRequests, "APROVADO_RH", currentYear);
     const pendingDays = calcUsedDays(approvedRequests, "PENDENTE", currentYear) +
-      calcUsedDays(approvedRequests, "APROVADO_COORDENADOR", currentYear) +
+      calcUsedDays(approvedRequests, "", currentYear) +
       calcUsedDays(approvedRequests, "APROVADO_GESTOR", currentYear) +
       calcUsedDays(approvedRequests, "APROVADO_GERENTE", currentYear);

[Killed] MethodExpression
lib/vacationRules.ts:261:22
       entitledDays: 30,
       usedDays,
       pendingDays,
-      availableDays: Math.max(0, 30 - usedDays - pendingDays),
+      availableDays: Math.min(0, 30 - usedDays - pendingDays),
       cycleYear: currentYear,
       hasEntitlement: true,
killedBy: calculateVacationBalance (null hireDate) returns hasEntitlement true and 30 entitled when hireDate is null
statusReason: expected +0 to be 30 // Object.is equality

[Killed] ArithmeticOperator
lib/vacationRules.ts:261:34
       entitledDays: 30,
       usedDays,
       pendingDays,
-      availableDays: Math.max(0, 30 - usedDays - pendingDays),
+      availableDays: Math.max(0, 30 - usedDays + pendingDays),
       cycleYear: currentYear,
       hasEntitlement: true,
killedBy: calculateVacationBalance (null hireDate) counts pending days when hireDate is null (current year)
statusReason: expected 45 to be less than 30

[Killed] BooleanLiteral
lib/vacationRules.ts:263:23
       pendingDays,
       availableDays: Math.max(0, 30 - usedDays - pendingDays),
       cycleYear: currentYear,
-      hasEntitlement: true,
+      hasEntitlement: false,
       monthsWorked: 999,
     };
killedBy: calculateVacationBalance (null hireDate) returns hasEntitlement true and 30 entitled when hireDate is null
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
lib/vacationRules.ts:271:6
   const hire = toUtcMidnight(new Date(hireDate));
   // Meses corridos (calendário): 12 meses = 1 período, 24 meses = 2 períodos (60 dias)
   let monthsWorked =
-    (today.getFullYear() - hire.getFullYear()) * 12 +
+    (today.getFullYear() + hire.getFullYear()) * 12 +
     (today.getMonth() - hire.getMonth());
   if (today.getDate() < hire.getDate()) monthsWorked -= 1;
killedBy: calculateVacationBalance returns hasEntitlement false when hireDate is less than 12 months ago
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
lib/vacationRules.ts:271:5
   const hire = toUtcMidnight(new Date(hireDate));
   // Meses corridos (calendário): 12 meses = 1 período, 24 meses = 2 períodos (60 dias)
   let monthsWorked =
-    (today.getFullYear() - hire.getFullYear()) * 12 +
+    (today.getFullYear() - hire.getFullYear()) / 12 +
     (today.getMonth() - hire.getMonth());
   if (today.getDate() < hire.getDate()) monthsWorked -= 1;
killedBy: calculateVacationBalance returns 30 entitled when hireDate is 12+ months ago and no requests
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
lib/vacationRules.ts:272:6
   // Meses corridos (calendário): 12 meses = 1 período, 24 meses = 2 períodos (60 dias)
   let monthsWorked =
     (today.getFullYear() - hire.getFullYear()) * 12 +
-    (today.getMonth() - hire.getMonth());
+    (today.getMonth() + hire.getMonth());
   if (today.getDate() < hire.getDate()) monthsWorked -= 1;
   monthsWorked = Math.max(0, monthsWorked);
killedBy: calculateVacationBalance returns hasEntitlement false when hireDate is less than 12 months ago
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
lib/vacationRules.ts:273:7
   let monthsWorked =
     (today.getFullYear() - hire.getFullYear()) * 12 +
     (today.getMonth() - hire.getMonth());
-  if (today.getDate() < hire.getDate()) monthsWorked -= 1;
+  if (today.getDate() >= hire.getDate()) monthsWorked -= 1;
   monthsWorked = Math.max(0, monthsWorked);
 
killedBy: calculateVacationBalance returns 30 entitled when hireDate is 12+ months ago and no requests
statusReason: expected 30 to be 60 // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:273:7
   let monthsWorked =
     (today.getFullYear() - hire.getFullYear()) * 12 +
     (today.getMonth() - hire.getMonth());
-  if (today.getDate() < hire.getDate()) monthsWorked -= 1;
+  if (true) monthsWorked -= 1;
   monthsWorked = Math.max(0, monthsWorked);
 
killedBy: calculateVacationBalance returns 30 entitled when hireDate is 12+ months ago and no requests
statusReason: expected 30 to be 60 // Object.is equality

[Killed] MethodExpression
lib/vacationRules.ts:274:18
     (today.getFullYear() - hire.getFullYear()) * 12 +
     (today.getMonth() - hire.getMonth());
   if (today.getDate() < hire.getDate()) monthsWorked -= 1;
-  monthsWorked = Math.max(0, monthsWorked);
+  monthsWorked = Math.min(0, monthsWorked);
 
   if (monthsWorked < 12) {
killedBy: calculateVacationBalance returns 30 entitled when hireDate is 12+ months ago and no requests
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
lib/vacationRules.ts:276:7
   if (today.getDate() < hire.getDate()) monthsWorked -= 1;
   monthsWorked = Math.max(0, monthsWorked);
 
-  if (monthsWorked < 12) {
+  if (monthsWorked >= 12) {
     // Ainda não adquiriu férias
     return {
killedBy: calculateVacationBalance returns hasEntitlement false when hireDate is less than 12 months ago
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:276:7
   if (today.getDate() < hire.getDate()) monthsWorked -= 1;
   monthsWorked = Math.max(0, monthsWorked);
 
-  if (monthsWorked < 12) {
+  if (false) {
     // Ainda não adquiriu férias
     return {
killedBy: calculateVacationBalance returns hasEntitlement false when hireDate is less than 12 months ago
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
lib/vacationRules.ts:284:23
       pendingDays: 0,
       availableDays: 0,
       cycleYear: currentYear,
-      hasEntitlement: false,
+      hasEntitlement: true,
       monthsWorked,
     };
killedBy: Workflow: vacation balance and entitlement employee with less than 12 months has no entitlement
statusReason: expected true to be false // Object.is equality

[Timeout] ArithmeticOperator
lib/vacationRules.ts:290:34
   }
 
   // Calcula quantos ciclos completos de 12 meses
-  const yearsWorked = Math.floor(monthsWorked / 12);
+  const yearsWorked = Math.floor(monthsWorked * 12);
   const totalEntitled = yearsWorked * 30;
 

[Killed] ArithmeticOperator
lib/vacationRules.ts:291:25
 
   // Calcula quantos ciclos completos de 12 meses
   const yearsWorked = Math.floor(monthsWorked / 12);
-  const totalEntitled = yearsWorked * 30;
+  const totalEntitled = yearsWorked / 30;
 
   // Dias já aprovados (histórico completo)
killedBy: calculateVacationBalance returns 30 entitled when hireDate is 12+ months ago and no requests
statusReason: expected 0.06666666666666667 to be 60 // Object.is equality

[Timeout] MethodExpression
lib/vacationRules.ts:294:21
   const totalEntitled = yearsWorked * 30;
 
   // Dias já aprovados (histórico completo)
-  const totalUsed = approvedRequests
-    .filter((r) => r.status === "APROVADO_RH")
+  const totalUsed = approvedRequests
     .reduce((sum, r) => sum + calcDays(r.startDate, r.endDate), 0);
 

[Killed] EqualityOperator
lib/vacationRules.ts:295:20
 
   // Dias já aprovados (histórico completo)
   const totalUsed = approvedRequests
-    .filter((r) => r.status === "APROVADO_RH")
+    .filter((r) => r.status !== "APROVADO_RH")
     .reduce((sum, r) => sum + calcDays(r.startDate, r.endDate), 0);
 
killedBy: calculateVacationBalance counts used days from APROVADO_RH requests
statusReason: expected +0 to be 15 // Object.is equality

[Killed] ArrowFunction
lib/vacationRules.ts:295:13
 
   // Dias já aprovados (histórico completo)
   const totalUsed = approvedRequests
-    .filter((r) => r.status === "APROVADO_RH")
+    .filter(() => undefined)
     .reduce((sum, r) => sum + calcDays(r.startDate, r.endDate), 0);
 
killedBy: calculateVacationBalance counts used days from APROVADO_RH requests
statusReason: expected +0 to be 15 // Object.is equality

[Killed] ArrowFunction
lib/vacationRules.ts:296:13
   // Dias já aprovados (histórico completo)
   const totalUsed = approvedRequests
     .filter((r) => r.status === "APROVADO_RH")
-    .reduce((sum, r) => sum + calcDays(r.startDate, r.endDate), 0);
+    .reduce(() => undefined, 0);
 
   // Dias em aprovação (pendentes)
killedBy: calculateVacationBalance counts used days from APROVADO_RH requests
statusReason: expected undefined to be 15 // Object.is equality

[Killed] ArithmeticOperator
lib/vacationRules.ts:296:25
   // Dias já aprovados (histórico completo)
   const totalUsed = approvedRequests
     .filter((r) => r.status === "APROVADO_RH")
-    .reduce((sum, r) => sum + calcDays(r.startDate, r.endDate), 0);
+    .reduce((sum, r) => sum - calcDays(r.startDate, r.endDate), 0);
 
   // Dias em aprovação (pendentes)
killedBy: calculateVacationBalance counts used days from APROVADO_RH requests
statusReason: expected -15 to be 15 // Object.is equality

[Timeout] MethodExpression
lib/vacationRules.ts:299:24
     .reduce((sum, r) => sum + calcDays(r.startDate, r.endDate), 0);
 
   // Dias em aprovação (pendentes)
-  const totalPending = approvedRequests
-    .filter((r) =>
-      ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE"].includes(r.status),
-    )
+  const totalPending = approvedRequests
     .reduce((sum, r) => sum + calcDays(r.startDate, r.endDate), 0);
 

[Timeout] ArrowFunction
lib/vacationRules.ts:300:13
 
   // Dias em aprovação (pendentes)
   const totalPending = approvedRequests
-    .filter((r) =>
-      ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE"].includes(r.status),
+    .filter(() => undefined,
     )
     .reduce((sum, r) => sum + calcDays(r.startDate, r.endDate), 0);

[Timeout] StringLiteral
lib/vacationRules.ts:301:8
   // Dias em aprovação (pendentes)
   const totalPending = approvedRequests
     .filter((r) =>
-      ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE"].includes(r.status),
+      ["", "APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE"].includes(r.status),
     )
     .reduce((sum, r) => sum + calcDays(r.startDate, r.endDate), 0);

[Timeout] ArrowFunction
lib/vacationRules.ts:303:13
     .filter((r) =>
       ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE"].includes(r.status),
     )
-    .reduce((sum, r) => sum + calcDays(r.startDate, r.endDate), 0);
+    .reduce(() => undefined, 0);
 
   const available = Math.max(0, totalEntitled - totalUsed - totalPending);

[Timeout] ArithmeticOperator
lib/vacationRules.ts:303:25
     .filter((r) =>
       ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE"].includes(r.status),
     )
-    .reduce((sum, r) => sum + calcDays(r.startDate, r.endDate), 0);
+    .reduce((sum, r) => sum - calcDays(r.startDate, r.endDate), 0);
 
   const available = Math.max(0, totalEntitled - totalUsed - totalPending);

[Killed] MethodExpression
lib/vacationRules.ts:305:21
     )
     .reduce((sum, r) => sum + calcDays(r.startDate, r.endDate), 0);
 
-  const available = Math.max(0, totalEntitled - totalUsed - totalPending);
+  const available = Math.min(0, totalEntitled - totalUsed - totalPending);
 
   return {
killedBy: calculateVacationBalance returns 30 entitled when hireDate is 12+ months ago and no requests
statusReason: expected +0 to be 60 // Object.is equality

[Killed] ArithmeticOperator
lib/vacationRules.ts:305:33
     )
     .reduce((sum, r) => sum + calcDays(r.startDate, r.endDate), 0);
 
-  const available = Math.max(0, totalEntitled - totalUsed - totalPending);
+  const available = Math.max(0, totalEntitled + totalUsed - totalPending);
 
   return {
killedBy: calculateVacationBalance counts used days from APROVADO_RH requests
statusReason: expected 105 to be less than or equal to 75

[Killed] ObjectLiteral
lib/vacationRules.ts:307:10
 
   const available = Math.max(0, totalEntitled - totalUsed - totalPending);
 
-  return {
-    entitledDays: totalEntitled,
-    usedDays: totalUsed,
-    pendingDays: totalPending,
-    availableDays: available,
-    cycleYear: currentYear,
-    hasEntitlement: true,
-    monthsWorked,
-  };
+  return {};
 }
 
killedBy: calculateVacationBalance returns 30 entitled when hireDate is 12+ months ago and no requests
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
lib/vacationRules.ts:318:51
   };
 }
 
-function calcDays(start: Date, end: Date): number {
-  const raw = daysBetweenInclusive(start, end);
-  // CLT: um período de férias não pode exceder 30 dias; evita 31 por arredondamento/fuso
-  return Math.min(Math.max(1, raw), 30);
-}
+function calcDays(start: Date, end: Date): number {}
 
 function calcUsedDays(
killedBy: calculateVacationBalance counts used days from APROVADO_RH requests
statusReason: expected NaN to be 15 // Object.is equality

[Killed] MethodExpression
lib/vacationRules.ts:321:19
 function calcDays(start: Date, end: Date): number {
   const raw = daysBetweenInclusive(start, end);
   // CLT: um período de férias não pode exceder 30 dias; evita 31 por arredondamento/fuso
-  return Math.min(Math.max(1, raw), 30);
+  return Math.min(Math.min(1, raw), 30);
 }
 
killedBy: calculateVacationBalance counts used days from APROVADO_RH requests
statusReason: expected 1 to be 15 // Object.is equality

[Killed] MethodExpression
lib/vacationRules.ts:321:10
 function calcDays(start: Date, end: Date): number {
   const raw = daysBetweenInclusive(start, end);
   // CLT: um período de férias não pode exceder 30 dias; evita 31 por arredondamento/fuso
-  return Math.min(Math.max(1, raw), 30);
+  return Math.max(Math.max(1, raw), 30);
 }
 
killedBy: calculateVacationBalance counts used days from APROVADO_RH requests
statusReason: expected 30 to be 15 // Object.is equality

[Killed] BlockStatement
lib/vacationRules.ts:328:11
   requests: { startDate: Date; endDate: Date; status: string }[],
   status: string,
   year: number,
-): number {
-  return requests
-    .filter((r) => r.status === status && new Date(r.startDate).getUTCFullYear() === year)
-    .reduce((sum, r) => sum + calcDays(r.startDate, r.endDate), 0);
-}
+): number {}
 
 // ============================================================
killedBy: calculateVacationBalance (null hireDate) returns hasEntitlement true and 30 entitled when hireDate is null
statusReason: expected NaN to be 30 // Object.is equality

[Killed] MethodExpression
lib/vacationRules.ts:329:10
   status: string,
   year: number,
 ): number {
-  return requests
-    .filter((r) => r.status === status && new Date(r.startDate).getUTCFullYear() === year)
+  return requests
     .reduce((sum, r) => sum + calcDays(r.startDate, r.endDate), 0);
 }
killedBy: calculateVacationBalance (null hireDate) counts pending days when hireDate is null (current year)
statusReason: expected 60 to be 15 // Object.is equality

[Killed] EqualityOperator
lib/vacationRules.ts:330:43
   year: number,
 ): number {
   return requests
-    .filter((r) => r.status === status && new Date(r.startDate).getUTCFullYear() === year)
+    .filter((r) => r.status === status && new Date(r.startDate).getUTCFullYear() !== year)
     .reduce((sum, r) => sum + calcDays(r.startDate, r.endDate), 0);
 }
killedBy: calculateVacationBalance (null hireDate) counts pending days when hireDate is null (current year)
statusReason: expected +0 to be 15 // Object.is equality

[Killed] ArrowFunction
lib/vacationRules.ts:330:13
   year: number,
 ): number {
   return requests
-    .filter((r) => r.status === status && new Date(r.startDate).getUTCFullYear() === year)
+    .filter(() => undefined)
     .reduce((sum, r) => sum + calcDays(r.startDate, r.endDate), 0);
 }
killedBy: calculateVacationBalance (null hireDate) counts pending days when hireDate is null (current year)
statusReason: expected +0 to be 15 // Object.is equality

[Killed] ArithmeticOperator
lib/vacationRules.ts:331:25
 ): number {
   return requests
     .filter((r) => r.status === status && new Date(r.startDate).getUTCFullYear() === year)
-    .reduce((sum, r) => sum + calcDays(r.startDate, r.endDate), 0);
+    .reduce((sum, r) => sum - calcDays(r.startDate, r.endDate), 0);
 }
 
killedBy: calculateVacationBalance (null hireDate) counts pending days when hireDate is null (current year)
statusReason: expected -15 to be 15 // Object.is equality

[Killed] ArrowFunction
lib/vacationRules.ts:331:13
 ): number {
   return requests
     .filter((r) => r.status === status && new Date(r.startDate).getUTCFullYear() === year)
-    .reduce((sum, r) => sum + calcDays(r.startDate, r.endDate), 0);
+    .reduce(() => undefined, 0);
 }
 
killedBy: calculateVacationBalance (null hireDate) counts pending days when hireDate is null (current year)
statusReason: expected NaN to be 15 // Object.is equality

[Killed] ArithmeticOperator
lib/vacationRules.ts:341:17
 function isSaoPauloHoliday(date: Date): boolean {
   const d = toUtcMidnight(date);
   const year = d.getUTCFullYear();
-  const month = d.getUTCMonth() + 1; // 1-12
+  const month = d.getUTCMonth() - 1; // 1-12
   const day = d.getUTCDate();
 
killedBy: validateCltPeriods (overlap and 14 days) rejects when start is 2 days before holiday (checkAdvanceNotice)
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ArrayDeclaration
lib/vacationRules.ts:345:17
   const day = d.getUTCDate();
 
   // Fixos nacionais
-  const fixed = [
-    [1, 1],   // 01/01 – Confraternização Universal
-    [4, 21],  // 21/04 – Tiradentes
-    [5, 1],   // 01/05 – Dia do Trabalho
-    [9, 7],   // 07/09 – Independência
-    [10, 12], // 12/10 – N. Sra Aparecida
-    [11, 2],  // 02/11 – Finados
-    [11, 15], // 15/11 – Proclamação da República
-    [12, 25], // 25/12 – Natal
-  ];
+  const fixed = [];
 
   // Fixos estado/município SP
killedBy: validateCltPeriods (overlap and 14 days) rejects when start is 2 days before holiday (checkAdvanceNotice)
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Timeout] ArrayDeclaration
lib/vacationRules.ts:348:5
   const fixed = [
     [1, 1],   // 01/01 – Confraternização Universal
     [4, 21],  // 21/04 – Tiradentes
-    [5, 1],   // 01/05 – Dia do Trabalho
+    [],   // 01/05 – Dia do Trabalho
     [9, 7],   // 07/09 – Independência
     [10, 12], // 12/10 – N. Sra Aparecida

[Timeout] ArrayDeclaration
lib/vacationRules.ts:351:5
     [5, 1],   // 01/05 – Dia do Trabalho
     [9, 7],   // 07/09 – Independência
     [10, 12], // 12/10 – N. Sra Aparecida
-    [11, 2],  // 02/11 – Finados
+    [],  // 02/11 – Finados
     [11, 15], // 15/11 – Proclamação da República
     [12, 25], // 25/12 – Natal

[Timeout] ArrayDeclaration
lib/vacationRules.ts:358:5
 
   // Fixos estado/município SP
   const fixedSp = [
-    [1, 25],  // 25/01 – Aniversário da cidade de SP
+    [],  // 25/01 – Aniversário da cidade de SP
     [7, 9],   // 09/07 – Revolução Constitucionalista (feriado estadual)
     [11, 20], // 20/11 – Consciência Negra (feriado municipal SP)

[Killed] EqualityOperator
lib/vacationRules.ts:363:62
     [11, 20], // 20/11 – Consciência Negra (feriado municipal SP)
   ];
 
-  if (fixed.concat(fixedSp).some(([m, d0]) => m === month && d0 === day)) return true;
+  if (fixed.concat(fixedSp).some(([m, d0]) => m === month && d0 !== day)) return true;
 
   // Móveis baseados na Páscoa: Carnaval (3ª feira), Sexta-Feira Santa, Corpus Christi
killedBy: Workflow: request creation validation (CLT + blackout) valid period passes validateCltPeriods with checkAdvanceNotice
statusReason: expected 'O início das férias não pode ocorrer …' to be null

[Killed] ConditionalExpression
lib/vacationRules.ts:363:47
     [11, 20], // 20/11 – Consciência Negra (feriado municipal SP)
   ];
 
-  if (fixed.concat(fixedSp).some(([m, d0]) => m === month && d0 === day)) return true;
+  if (fixed.concat(fixedSp).some(([m, d0]) => false)) return true;
 
   // Móveis baseados na Páscoa: Carnaval (3ª feira), Sexta-Feira Santa, Corpus Christi
killedBy: validateCltPeriods (overlap and 14 days) rejects when start is 2 days before holiday (checkAdvanceNotice)
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Timeout] UnaryOperator
lib/vacationRules.ts:367:36
 
   // Móveis baseados na Páscoa: Carnaval (3ª feira), Sexta-Feira Santa, Corpus Christi
   const easter = getEasterSunday(year); // domingo
-  const carnival = addDays(easter, -47);      // terça de carnaval
+  const carnival = addDays(easter, +47);      // terça de carnaval
   const goodFriday = addDays(easter, -2);     // sexta-feira santa
   const corpusChristi = addDays(easter, 60);  // corpus christi

[Timeout] UnaryOperator
lib/vacationRules.ts:368:38
   // Móveis baseados na Páscoa: Carnaval (3ª feira), Sexta-Feira Santa, Corpus Christi
   const easter = getEasterSunday(year); // domingo
   const carnival = addDays(easter, -47);      // terça de carnaval
-  const goodFriday = addDays(easter, -2);     // sexta-feira santa
+  const goodFriday = addDays(easter, +2);     // sexta-feira santa
   const corpusChristi = addDays(easter, 60);  // corpus christi
 
