[Timeout] BlockStatement
lib/vacationRules.ts:372:31
   const corpusChristi = addDays(easter, 60);  // corpus christi
 
   const movables = [carnival, goodFriday, corpusChristi];
-  return movables.some((h) => {
-    const hd = new Date(h);
-    hd.setHours(0, 0, 0, 0);
-    return hd.getTime() === d.getTime();
-  });
+  return movables.some((h) => {});
 }
 

[Timeout] MethodExpression
lib/vacationRules.ts:372:10
   const corpusChristi = addDays(easter, 60);  // corpus christi
 
   const movables = [carnival, goodFriday, corpusChristi];
-  return movables.some((h) => {
-    const hd = new Date(h);
-    hd.setHours(0, 0, 0, 0);
-    return hd.getTime() === d.getTime();
-  });
+  return movables.every(h => {
+  const hd = new Date(h);
+  hd.setHours(0, 0, 0, 0);
+  return hd.getTime() === d.getTime();
+});
 }
 

[Timeout] MethodExpression
lib/vacationRules.ts:374:5
   const movables = [carnival, goodFriday, corpusChristi];
   return movables.some((h) => {
     const hd = new Date(h);
-    hd.setHours(0, 0, 0, 0);
+    hd.setMinutes(0, 0, 0, 0);
     return hd.getTime() === d.getTime();
   });

[Killed] EqualityOperator
lib/vacationRules.ts:375:12
   return movables.some((h) => {
     const hd = new Date(h);
     hd.setHours(0, 0, 0, 0);
-    return hd.getTime() === d.getTime();
+    return hd.getTime() !== d.getTime();
   });
 }
killedBy: Workflow: request creation validation (CLT + blackout) valid period passes validateCltPeriods with checkAdvanceNotice
statusReason: expected 'O início das férias não pode ocorrer …' to be null

[Killed] ConditionalExpression
lib/vacationRules.ts:375:12
   return movables.some((h) => {
     const hd = new Date(h);
     hd.setHours(0, 0, 0, 0);
-    return hd.getTime() === d.getTime();
+    return true;
   });
 }
killedBy: Workflow: request creation validation (CLT + blackout) valid period passes validateCltPeriods with checkAdvanceNotice
statusReason: expected 'O início das férias não pode ocorrer …' to be null

[Timeout] BlockStatement
lib/vacationRules.ts:379:50
   });
 }
 
-function addDays(base: Date, days: number): Date {
-  const d = new Date(base);
-  d.setDate(d.getDate() + days);
-  return d;
-}
+function addDays(base: Date, days: number): Date {}
 
 // Algoritmo de Gauss para Páscoa (calendário gregoriano)

[Timeout] ArithmeticOperator
lib/vacationRules.ts:381:13
 
 function addDays(base: Date, days: number): Date {
   const d = new Date(base);
-  d.setDate(d.getDate() + days);
+  d.setDate(d.getDate() - days);
   return d;
 }

[Timeout] MethodExpression
lib/vacationRules.ts:381:3
 
 function addDays(base: Date, days: number): Date {
   const d = new Date(base);
-  d.setDate(d.getDate() + days);
+  d.setTime(d.getDate() + days);
   return d;
 }

[Timeout] BlockStatement
lib/vacationRules.ts:386:46
 }
 
 // Algoritmo de Gauss para Páscoa (calendário gregoriano)
-function getEasterSunday(year: number): Date {
-  const a = year % 19;
-  const b = Math.floor(year / 100);
-  const c = year % 100;
-  const d = Math.floor(b / 4);
-  const e = b % 4;
-  const f = Math.floor((b + 8) / 25);
-  const g = Math.floor((b - f + 1) / 3);
-  const h = (19 * a + b - d - g + 15) % 30;
-  const i = Math.floor(c / 4);
-  const k = c % 4;
-  const l = (32 + 2 * e + 2 * i - h - k) % 7;
-  const m = Math.floor((a + 11 * h + 22 * l) / 451);
-  const month = Math.floor((h + l - 7 * m + 114) / 31); // 3=mar, 4=abr
-  const day = ((h + l - 7 * m + 114) % 31) + 1;
-  return new Date(year, month - 1, day);
-}
+function getEasterSunday(year: number): Date {}
 
 // ============================================================

[Timeout] ArithmeticOperator
lib/vacationRules.ts:387:13
 
 // Algoritmo de Gauss para Páscoa (calendário gregoriano)
 function getEasterSunday(year: number): Date {
-  const a = year % 19;
+  const a = year * 19;
   const b = Math.floor(year / 100);
   const c = year % 100;

[Timeout] ArithmeticOperator
lib/vacationRules.ts:388:24
 // Algoritmo de Gauss para Páscoa (calendário gregoriano)
 function getEasterSunday(year: number): Date {
   const a = year % 19;
-  const b = Math.floor(year / 100);
+  const b = Math.floor(year * 100);
   const c = year % 100;
   const d = Math.floor(b / 4);

[Timeout] ArithmeticOperator
lib/vacationRules.ts:389:13
 function getEasterSunday(year: number): Date {
   const a = year % 19;
   const b = Math.floor(year / 100);
-  const c = year % 100;
+  const c = year * 100;
   const d = Math.floor(b / 4);
   const e = b % 4;

[Timeout] ArithmeticOperator
lib/vacationRules.ts:390:24
   const a = year % 19;
   const b = Math.floor(year / 100);
   const c = year % 100;
-  const d = Math.floor(b / 4);
+  const d = Math.floor(b * 4);
   const e = b % 4;
   const f = Math.floor((b + 8) / 25);

[Timeout] ArithmeticOperator
lib/vacationRules.ts:391:13
   const b = Math.floor(year / 100);
   const c = year % 100;
   const d = Math.floor(b / 4);
-  const e = b % 4;
+  const e = b * 4;
   const f = Math.floor((b + 8) / 25);
   const g = Math.floor((b - f + 1) / 3);

[Timeout] ArithmeticOperator
lib/vacationRules.ts:392:25
   const c = year % 100;
   const d = Math.floor(b / 4);
   const e = b % 4;
-  const f = Math.floor((b + 8) / 25);
+  const f = Math.floor((b - 8) / 25);
   const g = Math.floor((b - f + 1) / 3);
   const h = (19 * a + b - d - g + 15) % 30;

[Timeout] ArithmeticOperator
lib/vacationRules.ts:392:24
   const c = year % 100;
   const d = Math.floor(b / 4);
   const e = b % 4;
-  const f = Math.floor((b + 8) / 25);
+  const f = Math.floor((b + 8) * 25);
   const g = Math.floor((b - f + 1) / 3);
   const h = (19 * a + b - d - g + 15) % 30;

[Timeout] ArithmeticOperator
lib/vacationRules.ts:393:25
   const d = Math.floor(b / 4);
   const e = b % 4;
   const f = Math.floor((b + 8) / 25);
-  const g = Math.floor((b - f + 1) / 3);
+  const g = Math.floor((b + f + 1) / 3);
   const h = (19 * a + b - d - g + 15) % 30;
   const i = Math.floor(c / 4);

[Timeout] ArithmeticOperator
lib/vacationRules.ts:393:25
   const d = Math.floor(b / 4);
   const e = b % 4;
   const f = Math.floor((b + 8) / 25);
-  const g = Math.floor((b - f + 1) / 3);
+  const g = Math.floor((b - f - 1) / 3);
   const h = (19 * a + b - d - g + 15) % 30;
   const i = Math.floor(c / 4);

[Timeout] ArithmeticOperator
lib/vacationRules.ts:394:13
   const e = b % 4;
   const f = Math.floor((b + 8) / 25);
   const g = Math.floor((b - f + 1) / 3);
-  const h = (19 * a + b - d - g + 15) % 30;
+  const h = (19 * a + b - d - g + 15) * 30;
   const i = Math.floor(c / 4);
   const k = c % 4;

[Timeout] ArithmeticOperator
lib/vacationRules.ts:394:14
   const e = b % 4;
   const f = Math.floor((b + 8) / 25);
   const g = Math.floor((b - f + 1) / 3);
-  const h = (19 * a + b - d - g + 15) % 30;
+  const h = (19 * a + b + d - g + 15) % 30;
   const i = Math.floor(c / 4);
   const k = c % 4;

[Timeout] ArithmeticOperator
lib/vacationRules.ts:395:24
   const f = Math.floor((b + 8) / 25);
   const g = Math.floor((b - f + 1) / 3);
   const h = (19 * a + b - d - g + 15) % 30;
-  const i = Math.floor(c / 4);
+  const i = Math.floor(c * 4);
   const k = c % 4;
   const l = (32 + 2 * e + 2 * i - h - k) % 7;

[Timeout] ArithmeticOperator
lib/vacationRules.ts:396:13
   const g = Math.floor((b - f + 1) / 3);
   const h = (19 * a + b - d - g + 15) % 30;
   const i = Math.floor(c / 4);
-  const k = c % 4;
+  const k = c * 4;
   const l = (32 + 2 * e + 2 * i - h - k) % 7;
   const m = Math.floor((a + 11 * h + 22 * l) / 451);

[Timeout] ArithmeticOperator
lib/vacationRules.ts:397:13
   const h = (19 * a + b - d - g + 15) % 30;
   const i = Math.floor(c / 4);
   const k = c % 4;
-  const l = (32 + 2 * e + 2 * i - h - k) % 7;
+  const l = (32 + 2 * e + 2 * i - h - k) * 7;
   const m = Math.floor((a + 11 * h + 22 * l) / 451);
   const month = Math.floor((h + l - 7 * m + 114) / 31); // 3=mar, 4=abr

[Timeout] ArithmeticOperator
lib/vacationRules.ts:397:14
   const h = (19 * a + b - d - g + 15) % 30;
   const i = Math.floor(c / 4);
   const k = c % 4;
-  const l = (32 + 2 * e + 2 * i - h - k) % 7;
+  const l = (32 + 2 * e + 2 * i + h - k) % 7;
   const m = Math.floor((a + 11 * h + 22 * l) / 451);
   const month = Math.floor((h + l - 7 * m + 114) / 31); // 3=mar, 4=abr

[Timeout] ArithmeticOperator
lib/vacationRules.ts:398:24
   const i = Math.floor(c / 4);
   const k = c % 4;
   const l = (32 + 2 * e + 2 * i - h - k) % 7;
-  const m = Math.floor((a + 11 * h + 22 * l) / 451);
+  const m = Math.floor((a + 11 * h + 22 * l) * 451);
   const month = Math.floor((h + l - 7 * m + 114) / 31); // 3=mar, 4=abr
   const day = ((h + l - 7 * m + 114) % 31) + 1;

[Timeout] ArithmeticOperator
lib/vacationRules.ts:398:25
   const i = Math.floor(c / 4);
   const k = c % 4;
   const l = (32 + 2 * e + 2 * i - h - k) % 7;
-  const m = Math.floor((a + 11 * h + 22 * l) / 451);
+  const m = Math.floor((a + 11 * h - 22 * l) / 451);
   const month = Math.floor((h + l - 7 * m + 114) / 31); // 3=mar, 4=abr
   const day = ((h + l - 7 * m + 114) % 31) + 1;

[Timeout] ArithmeticOperator
lib/vacationRules.ts:399:29
   const k = c % 4;
   const l = (32 + 2 * e + 2 * i - h - k) % 7;
   const m = Math.floor((a + 11 * h + 22 * l) / 451);
-  const month = Math.floor((h + l - 7 * m + 114) / 31); // 3=mar, 4=abr
+  const month = Math.floor((h - l - 7 * m + 114) / 31); // 3=mar, 4=abr
   const day = ((h + l - 7 * m + 114) % 31) + 1;
   return new Date(year, month - 1, day);

[Timeout] ArithmeticOperator
lib/vacationRules.ts:399:28
   const k = c % 4;
   const l = (32 + 2 * e + 2 * i - h - k) % 7;
   const m = Math.floor((a + 11 * h + 22 * l) / 451);
-  const month = Math.floor((h + l - 7 * m + 114) / 31); // 3=mar, 4=abr
+  const month = Math.floor((h + l - 7 * m + 114) * 31); // 3=mar, 4=abr
   const day = ((h + l - 7 * m + 114) % 31) + 1;
   return new Date(year, month - 1, day);

[Timeout] ArithmeticOperator
lib/vacationRules.ts:400:17
   const l = (32 + 2 * e + 2 * i - h - k) % 7;
   const m = Math.floor((a + 11 * h + 22 * l) / 451);
   const month = Math.floor((h + l - 7 * m + 114) / 31); // 3=mar, 4=abr
-  const day = ((h + l - 7 * m + 114) % 31) + 1;
+  const day = ((h - l - 7 * m + 114) % 31) + 1;
   return new Date(year, month - 1, day);
 }

[Timeout] ArithmeticOperator
lib/vacationRules.ts:400:15
   const l = (32 + 2 * e + 2 * i - h - k) % 7;
   const m = Math.floor((a + 11 * h + 22 * l) / 451);
   const month = Math.floor((h + l - 7 * m + 114) / 31); // 3=mar, 4=abr
-  const day = ((h + l - 7 * m + 114) % 31) + 1;
+  const day = (h + l - 7 * m + 114) % 31 - 1;
   return new Date(year, month - 1, day);
 }

[Timeout] ArithmeticOperator
lib/vacationRules.ts:401:25
   const m = Math.floor((a + 11 * h + 22 * l) / 451);
   const month = Math.floor((h + l - 7 * m + 114) / 31); // 3=mar, 4=abr
   const day = ((h + l - 7 * m + 114) % 31) + 1;
-  return new Date(year, month - 1, day);
+  return new Date(year, month + 1, day);
 }
 

[Killed] ConditionalExpression
lib/vacationRules.ts:427:7
   teamMembers: { name: string; requests: { startDate: Date; endDate: Date; status: string }[] }[],
 ): TeamConflict {
   const teamSize = teamMembers.length;
-  if (teamSize === 0) {
+  if (true) {
     return { conflictingCount: 0, teamSize: 0, conflictPercent: 0, isBlocked: false, isWarning: false, names: [] };
   }
killedBy: detectTeamConflicts detects conflict when member has overlapping approved request
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
lib/vacationRules.ts:427:7
   teamMembers: { name: string; requests: { startDate: Date; endDate: Date; status: string }[] }[],
 ): TeamConflict {
   const teamSize = teamMembers.length;
-  if (teamSize === 0) {
+  if (teamSize !== 0) {
     return { conflictingCount: 0, teamSize: 0, conflictPercent: 0, isBlocked: false, isWarning: false, names: [] };
   }
killedBy: detectTeamConflicts detects conflict when member has overlapping approved request
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
lib/vacationRules.ts:428:79
 ): TeamConflict {
   const teamSize = teamMembers.length;
   if (teamSize === 0) {
-    return { conflictingCount: 0, teamSize: 0, conflictPercent: 0, isBlocked: false, isWarning: false, names: [] };
+    return { conflictingCount: 0, teamSize: 0, conflictPercent: 0, isBlocked: true, isWarning: false, names: [] };
   }
 
killedBy: detectTeamConflicts returns zeros for empty team
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
lib/vacationRules.ts:428:97
 ): TeamConflict {
   const teamSize = teamMembers.length;
   if (teamSize === 0) {
-    return { conflictingCount: 0, teamSize: 0, conflictPercent: 0, isBlocked: false, isWarning: false, names: [] };
+    return { conflictingCount: 0, teamSize: 0, conflictPercent: 0, isBlocked: false, isWarning: true, names: [] };
   }
 
killedBy: detectTeamConflicts returns zeros for empty team
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
lib/vacationRules.ts:431:23
     return { conflictingCount: 0, teamSize: 0, conflictPercent: 0, isBlocked: false, isWarning: false, names: [] };
   }
 
-  const conflicting = teamMembers.filter((member) =>
-    member.requests.some((r) => {
-      const isActive = ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH"].includes(r.status);
-      if (!isActive) return false;
-      // Overlap check: períodos se sobrepõem se start < r.end && end > r.start
-      return new Date(start) < new Date(r.endDate) && new Date(end) > new Date(r.startDate);
-    }),
-  );
+  const conflicting = teamMembers;
 
   const conflictingCount = conflicting.length;
killedBy: detectTeamConflicts detects no conflict when no overlapping requests
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ArrowFunction
lib/vacationRules.ts:431:42
     return { conflictingCount: 0, teamSize: 0, conflictPercent: 0, isBlocked: false, isWarning: false, names: [] };
   }
 
-  const conflicting = teamMembers.filter((member) =>
-    member.requests.some((r) => {
-      const isActive = ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH"].includes(r.status);
-      if (!isActive) return false;
-      // Overlap check: períodos se sobrepõem se start < r.end && end > r.start
-      return new Date(start) < new Date(r.endDate) && new Date(end) > new Date(r.startDate);
-    }),
+  const conflicting = teamMembers.filter(() => undefined,
   );
 
killedBy: detectTeamConflicts detects conflict when member has overlapping approved request
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
lib/vacationRules.ts:432:33
   }
 
   const conflicting = teamMembers.filter((member) =>
-    member.requests.some((r) => {
-      const isActive = ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH"].includes(r.status);
-      if (!isActive) return false;
-      // Overlap check: períodos se sobrepõem se start < r.end && end > r.start
-      return new Date(start) < new Date(r.endDate) && new Date(end) > new Date(r.startDate);
-    }),
+    member.requests.some((r) => {}),
   );
 
killedBy: detectTeamConflicts detects conflict when member has overlapping approved request
statusReason: expected +0 to be 1 // Object.is equality

[Timeout] MethodExpression
lib/vacationRules.ts:432:5
   }
 
   const conflicting = teamMembers.filter((member) =>
-    member.requests.some((r) => {
-      const isActive = ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH"].includes(r.status);
-      if (!isActive) return false;
-      // Overlap check: períodos se sobrepõem se start < r.end && end > r.start
-      return new Date(start) < new Date(r.endDate) && new Date(end) > new Date(r.startDate);
-    }),
+    member.requests.every(r => {
+  const isActive = ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH"].includes(r.status);
+  if (!isActive) return false;
+  // Overlap check: períodos se sobrepõem se start < r.end && end > r.start
+  return new Date(start) < new Date(r.endDate) && new Date(end) > new Date(r.startDate);
+}),
   );
 

[Killed] StringLiteral
lib/vacationRules.ts:433:100
 
   const conflicting = teamMembers.filter((member) =>
     member.requests.some((r) => {
-      const isActive = ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH"].includes(r.status);
+      const isActive = ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", ""].includes(r.status);
       if (!isActive) return false;
       // Overlap check: períodos se sobrepõem se start < r.end && end > r.start
killedBy: detectTeamConflicts detects conflict when member has overlapping approved request
statusReason: expected +0 to be 1 // Object.is equality

[Timeout] StringLiteral
lib/vacationRules.ts:433:61
 
   const conflicting = teamMembers.filter((member) =>
     member.requests.some((r) => {
-      const isActive = ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH"].includes(r.status);
+      const isActive = ["PENDENTE", "APROVADO_COORDENADOR", "", "APROVADO_GERENTE", "APROVADO_RH"].includes(r.status);
       if (!isActive) return false;
       // Overlap check: períodos se sobrepõem se start < r.end && end > r.start

[Killed] BooleanLiteral
lib/vacationRules.ts:434:29
   const conflicting = teamMembers.filter((member) =>
     member.requests.some((r) => {
       const isActive = ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH"].includes(r.status);
-      if (!isActive) return false;
+      if (!isActive) return true;
       // Overlap check: períodos se sobrepõem se start < r.end && end > r.start
       return new Date(start) < new Date(r.endDate) && new Date(end) > new Date(r.startDate);
killedBy: detectTeamConflicts ignores REPROVADO/CANCELADO
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BooleanLiteral
lib/vacationRules.ts:434:11
   const conflicting = teamMembers.filter((member) =>
     member.requests.some((r) => {
       const isActive = ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH"].includes(r.status);
-      if (!isActive) return false;
+      if (isActive) return false;
       // Overlap check: períodos se sobrepõem se start < r.end && end > r.start
       return new Date(start) < new Date(r.endDate) && new Date(end) > new Date(r.startDate);
killedBy: detectTeamConflicts detects conflict when member has overlapping approved request
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:436:14
       const isActive = ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH"].includes(r.status);
       if (!isActive) return false;
       // Overlap check: períodos se sobrepõem se start < r.end && end > r.start
-      return new Date(start) < new Date(r.endDate) && new Date(end) > new Date(r.startDate);
+      return true;
     }),
   );
killedBy: detectTeamConflicts detects no conflict when no overlapping requests
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:436:14
       const isActive = ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR", "APROVADO_GERENTE", "APROVADO_RH"].includes(r.status);
       if (!isActive) return false;
       // Overlap check: períodos se sobrepõem se start < r.end && end > r.start
-      return new Date(start) < new Date(r.endDate) && new Date(end) > new Date(r.startDate);
+      return true && new Date(end) > new Date(r.startDate);
     }),
   );
killedBy: detectTeamConflicts detects no conflict when no overlapping requests
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ArithmeticOperator
lib/vacationRules.ts:441:38
   );
 
   const conflictingCount = conflicting.length;
-  const conflictPercent = Math.round((conflictingCount / teamSize) * 100);
+  const conflictPercent = Math.round(conflictingCount / teamSize / 100);
 
   return {
killedBy: detectTeamConflicts detects conflict when member has overlapping approved request
statusReason: expected false to be true // Object.is equality

[Timeout] ArithmeticOperator
lib/vacationRules.ts:441:39
   );
 
   const conflictingCount = conflicting.length;
-  const conflictPercent = Math.round((conflictingCount / teamSize) * 100);
+  const conflictPercent = Math.round((conflictingCount * teamSize) * 100);
 
   return {

[Timeout] ConditionalExpression
lib/vacationRules.ts:447:16
     conflictingCount,
     teamSize,
     conflictPercent,
-    isBlocked: conflictPercent > 50,
+    isBlocked: false,
     isWarning: conflictPercent > 30,
     names: conflicting.map((m) => m.name),

[Timeout] ConditionalExpression
lib/vacationRules.ts:447:16
     conflictingCount,
     teamSize,
     conflictPercent,
-    isBlocked: conflictPercent > 50,
+    isBlocked: true,
     isWarning: conflictPercent > 30,
     names: conflicting.map((m) => m.name),

[Killed] EqualityOperator
lib/vacationRules.ts:448:16
     teamSize,
     conflictPercent,
     isBlocked: conflictPercent > 50,
-    isWarning: conflictPercent > 30,
+    isWarning: conflictPercent <= 30,
     names: conflicting.map((m) => m.name),
   };
killedBy: detectTeamConflicts detects conflict when member has overlapping approved request
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/vacationRules.ts:448:16
     teamSize,
     conflictPercent,
     isBlocked: conflictPercent > 50,
-    isWarning: conflictPercent > 30,
+    isWarning: false,
     names: conflicting.map((m) => m.name),
   };
killedBy: detectTeamConflicts detects conflict when member has overlapping approved request
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
lib/vacationRules.ts:449:28
     conflictPercent,
     isBlocked: conflictPercent > 50,
     isWarning: conflictPercent > 30,
-    names: conflicting.map((m) => m.name),
+    names: conflicting.map(() => undefined),
   };
 }
killedBy: detectTeamConflicts detects conflict when member has overlapping approved request
statusReason: expected [ undefined ] to deeply equal [ 'A' ]

[Killed] BlockStatement
lib/vacationRules.ts:460:82
 /**
  * Validação CLT para UM bloco de férias.
  */
-export function validateCltPeriod(startDate: Date, endDate: Date): string | null {
-  const days = daysBetweenInclusive(startDate, endDate);
-
-  if (days < 5) return "Período mínimo de férias é de 5 dias corridos (CLT).";
-  if (days > 30) return "Período máximo em um único bloco é de 30 dias.";
-
-  const startWeekDay = getUtcWeekDay(startDate);
-  if (startWeekDay === 5 || startWeekDay === 6) {
-    return "O início das férias não pode ocorrer na sexta ou no sábado (art. 134, §3º, CLT).";
-  }
-  const endWeekDay = getUtcWeekDay(endDate);
-  if (endWeekDay === 0 || endWeekDay === 6) {
-    return "O término das férias não pode ocorrer no sábado ou no domingo (repouso semanal remunerado).";
-  }
-
-  const today = toUtcMidnight(new Date());
-  const diffDays = Math.floor(
-    (toUtcMidnight(startDate).getTime() - today.getTime()) / ONE_DAY_MS,
-  );
-
-  if (diffDays < 30) return "Aviso prévio mínimo de 30 dias não respeitado.";
-
-  return null;
-}
+export function validateCltPeriod(startDate: Date, endDate: Date): string | null {}
 
 /**
killedBy: validateCltPeriod rejects period < 5 days
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] EqualityOperator
lib/vacationRules.ts:463:7
 export function validateCltPeriod(startDate: Date, endDate: Date): string | null {
   const days = daysBetweenInclusive(startDate, endDate);
 
-  if (days < 5) return "Período mínimo de férias é de 5 dias corridos (CLT).";
+  if (days >= 5) return "Período mínimo de férias é de 5 dias corridos (CLT).";
   if (days > 30) return "Período máximo em um único bloco é de 30 dias.";
 
killedBy: validateCltPeriod rejects period < 5 days
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
lib/vacationRules.ts:463:7
 export function validateCltPeriod(startDate: Date, endDate: Date): string | null {
   const days = daysBetweenInclusive(startDate, endDate);
 
-  if (days < 5) return "Período mínimo de férias é de 5 dias corridos (CLT).";
+  if (true) return "Período mínimo de férias é de 5 dias corridos (CLT).";
   if (days > 30) return "Período máximo em um único bloco é de 30 dias.";
 
killedBy: validateCltPeriod rejects period > 30 days
statusReason: expected 'Período mínimo de férias é de 5 dias …' to contain '30'

[Killed] EqualityOperator
lib/vacationRules.ts:464:7
   const days = daysBetweenInclusive(startDate, endDate);
 
   if (days < 5) return "Período mínimo de férias é de 5 dias corridos (CLT).";
-  if (days > 30) return "Período máximo em um único bloco é de 30 dias.";
+  if (days <= 30) return "Período máximo em um único bloco é de 30 dias.";
 
   const startWeekDay = getUtcWeekDay(startDate);
killedBy: validateCltPeriod rejects period > 30 days
statusReason: expected 'O término das férias não pode ocorrer…' to contain '30'

[Killed] ConditionalExpression
lib/vacationRules.ts:464:7
   const days = daysBetweenInclusive(startDate, endDate);
 
   if (days < 5) return "Período mínimo de férias é de 5 dias corridos (CLT).";
-  if (days > 30) return "Período máximo em um único bloco é de 30 dias.";
+  if (true) return "Período máximo em um único bloco é de 30 dias.";
 
   const startWeekDay = getUtcWeekDay(startDate);
killedBy: validateCltPeriod (weekend) rejects start on Friday (local date)
statusReason: expected 'Período máximo em um único bloco é de…' to contain 'sexta'

[Killed] ConditionalExpression
lib/vacationRules.ts:467:7
   if (days > 30) return "Período máximo em um único bloco é de 30 dias.";
 
   const startWeekDay = getUtcWeekDay(startDate);
-  if (startWeekDay === 5 || startWeekDay === 6) {
+  if (false || startWeekDay === 6) {
     return "O início das férias não pode ocorrer na sexta ou no sábado (art. 134, §3º, CLT).";
   }
killedBy: validateCltPeriod (weekend) rejects start on Friday (local date)
statusReason: expected null to be truthy

[Killed] ConditionalExpression
lib/vacationRules.ts:467:7
   if (days > 30) return "Período máximo em um único bloco é de 30 dias.";
 
   const startWeekDay = getUtcWeekDay(startDate);
-  if (startWeekDay === 5 || startWeekDay === 6) {
+  if (false) {
     return "O início das férias não pode ocorrer na sexta ou no sábado (art. 134, §3º, CLT).";
   }
killedBy: validateCltPeriod (weekend) rejects start on Friday (local date)
statusReason: expected null to be truthy

[Killed] LogicalOperator
lib/vacationRules.ts:471:7
     return "O início das férias não pode ocorrer na sexta ou no sábado (art. 134, §3º, CLT).";
   }
   const endWeekDay = getUtcWeekDay(endDate);
-  if (endWeekDay === 0 || endWeekDay === 6) {
+  if (endWeekDay === 0 && endWeekDay === 6) {
     return "O término das férias não pode ocorrer no sábado ou no domingo (repouso semanal remunerado).";
   }
killedBy: validateCltPeriod (weekend) rejects end on Saturday (local date)
statusReason: expected null to be truthy

[Killed] EqualityOperator
lib/vacationRules.ts:471:27
     return "O início das férias não pode ocorrer na sexta ou no sábado (art. 134, §3º, CLT).";
   }
   const endWeekDay = getUtcWeekDay(endDate);
-  if (endWeekDay === 0 || endWeekDay === 6) {
+  if (endWeekDay === 0 || endWeekDay !== 6) {
     return "O término das férias não pode ocorrer no sábado ou no domingo (repouso semanal remunerado).";
   }
killedBy: validateCltPeriod (weekend) rejects end on Saturday (local date)
statusReason: expected null to be truthy

[Timeout] ArithmeticOperator
lib/vacationRules.ts:477:6
 
   const today = toUtcMidnight(new Date());
   const diffDays = Math.floor(
-    (toUtcMidnight(startDate).getTime() - today.getTime()) / ONE_DAY_MS,
+    (toUtcMidnight(startDate).getTime() + today.getTime()) / ONE_DAY_MS,
   );
 

[Timeout] ArithmeticOperator
lib/vacationRules.ts:477:5
 
   const today = toUtcMidnight(new Date());
   const diffDays = Math.floor(
-    (toUtcMidnight(startDate).getTime() - today.getTime()) / ONE_DAY_MS,
+    (toUtcMidnight(startDate).getTime() - today.getTime()) * ONE_DAY_MS,
   );
 

[Timeout] EqualityOperator
lib/vacationRules.ts:480:7
     (toUtcMidnight(startDate).getTime() - today.getTime()) / ONE_DAY_MS,
   );
 
-  if (diffDays < 30) return "Aviso prévio mínimo de 30 dias não respeitado.";
+  if (diffDays >= 30) return "Aviso prévio mínimo de 30 dias não respeitado.";
 
   return null;

[Timeout] ConditionalExpression
lib/vacationRules.ts:480:7
     (toUtcMidnight(startDate).getTime() - today.getTime()) / ONE_DAY_MS,
   );
 
-  if (diffDays < 30) return "Aviso prévio mínimo de 30 dias não respeitado.";
+  if (true) return "Aviso prévio mínimo de 30 dias não respeitado.";
 
   return null;

[Timeout] BooleanLiteral
lib/vacationRules.ts:499:29
     existingDaysInCycle?: number;
     /** Direito total no ciclo (ex.: 30 ou 60 dias); usado para não ultrapassar o teto */
     entitledDays?: number;
-  } = { checkAdvanceNotice: true },
+  } = { checkAdvanceNotice: false },
 ): string | null {
   if (!periods.length) return "É necessário informar ao menos um período de férias.";
