[Killed] BooleanLiteral
lib/vacationRules.ts:501:7
     entitledDays?: number;
   } = { checkAdvanceNotice: true },
 ): string | null {
-  if (!periods.length) return "É necessário informar ao menos um período de férias.";
+  if (periods.length) return "É necessário informar ao menos um período de férias.";
   if (periods.length > 3) return "As férias podem ser fracionadas em no máximo 3 períodos.";
 
killedBy: validateCltPeriods requires at least one period of 14+ days when existingDaysInCycle < 14
statusReason: expected 'É necessário informar ao menos um per…' to contain '14'

[Killed] ConditionalExpression
lib/vacationRules.ts:501:7
     entitledDays?: number;
   } = { checkAdvanceNotice: true },
 ): string | null {
-  if (!periods.length) return "É necessário informar ao menos um período de férias.";
+  if (true) return "É necessário informar ao menos um período de férias.";
   if (periods.length > 3) return "As férias podem ser fracionadas em no máximo 3 períodos.";
 
killedBy: validateCltPeriods requires at least one period of 14+ days when existingDaysInCycle < 14
statusReason: expected 'É necessário informar ao menos um per…' to contain '14'

[Killed] EqualityOperator
lib/vacationRules.ts:502:7
   } = { checkAdvanceNotice: true },
 ): string | null {
   if (!periods.length) return "É necessário informar ao menos um período de férias.";
-  if (periods.length > 3) return "As férias podem ser fracionadas em no máximo 3 períodos.";
+  if (periods.length <= 3) return "As férias podem ser fracionadas em no máximo 3 períodos.";
 
   const sorted = [...periods].sort((a, b) => a.start.getTime() - b.start.getTime());
killedBy: validateCltPeriods requires at least one period of 14+ days when existingDaysInCycle < 14
statusReason: expected 'As férias podem ser fracionadas em no…' to contain '14'

[Killed] ConditionalExpression
lib/vacationRules.ts:502:7
   } = { checkAdvanceNotice: true },
 ): string | null {
   if (!periods.length) return "É necessário informar ao menos um período de férias.";
-  if (periods.length > 3) return "As férias podem ser fracionadas em no máximo 3 períodos.";
+  if (true) return "As férias podem ser fracionadas em no máximo 3 períodos.";
 
   const sorted = [...periods].sort((a, b) => a.start.getTime() - b.start.getTime());
killedBy: validateCltPeriods requires at least one period of 14+ days when existingDaysInCycle < 14
statusReason: expected 'As férias podem ser fracionadas em no…' to contain '14'

[Timeout] ArithmeticOperator
lib/vacationRules.ts:504:46
   if (!periods.length) return "É necessário informar ao menos um período de férias.";
   if (periods.length > 3) return "As férias podem ser fracionadas em no máximo 3 períodos.";
 
-  const sorted = [...periods].sort((a, b) => a.start.getTime() - b.start.getTime());
+  const sorted = [...periods].sort((a, b) => a.start.getTime() + b.start.getTime());
   const existingDays = options.existingDaysInCycle ?? 0;
 

[Timeout] ArrowFunction
lib/vacationRules.ts:504:36
   if (!periods.length) return "É necessário informar ao menos um período de férias.";
   if (periods.length > 3) return "As férias podem ser fracionadas em no máximo 3 períodos.";
 
-  const sorted = [...periods].sort((a, b) => a.start.getTime() - b.start.getTime());
+  const sorted = [...periods].sort(() => undefined);
   const existingDays = options.existingDaysInCycle ?? 0;
 

[Timeout] LogicalOperator
lib/vacationRules.ts:505:24
   if (periods.length > 3) return "As férias podem ser fracionadas em no máximo 3 períodos.";
 
   const sorted = [...periods].sort((a, b) => a.start.getTime() - b.start.getTime());
-  const existingDays = options.existingDaysInCycle ?? 0;
+  const existingDays = options.existingDaysInCycle && 0;
 
   let hasPeriodWith14OrMore = false;

[Killed] BooleanLiteral
lib/vacationRules.ts:507:31
   const sorted = [...periods].sort((a, b) => a.start.getTime() - b.start.getTime());
   const existingDays = options.existingDaysInCycle ?? 0;
 
-  let hasPeriodWith14OrMore = false;
+  let hasPeriodWith14OrMore = true;
 
   for (let i = 0; i < sorted.length; i++) {
killedBy: validateCltPeriods requires at least one period of 14+ days when existingDaysInCycle < 14
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] UpdateOperator
lib/vacationRules.ts:509:38
 
   let hasPeriodWith14OrMore = false;
 
-  for (let i = 0; i < sorted.length; i++) {
+  for (let i = 0; i < sorted.length; i--) {
     const { start, end } = sorted[i];
     if (isNaN(start.getTime()) || isNaN(end.getTime()) || end < start) {
killedBy: validateCltPeriods requires at least one period of 14+ days when existingDaysInCycle < 14
statusReason: Cannot destructure property 'start' of 'sorted[i]' as it is undefined.

[Killed] EqualityOperator
lib/vacationRules.ts:509:19
 
   let hasPeriodWith14OrMore = false;
 
-  for (let i = 0; i < sorted.length; i++) {
+  for (let i = 0; i <= sorted.length; i++) {
     const { start, end } = sorted[i];
     if (isNaN(start.getTime()) || isNaN(end.getTime()) || end < start) {
killedBy: validateCltPeriods requires at least one period of 14+ days when existingDaysInCycle < 14
statusReason: Cannot destructure property 'start' of 'sorted[i]' as it is undefined.

[Killed] EqualityOperator
lib/vacationRules.ts:511:59
 
   for (let i = 0; i < sorted.length; i++) {
     const { start, end } = sorted[i];
-    if (isNaN(start.getTime()) || isNaN(end.getTime()) || end < start) {
+    if (isNaN(start.getTime()) || isNaN(end.getTime()) || end >= start) {
       return "Período de férias inválido.";
     }
killedBy: validateCltPeriods requires at least one period of 14+ days when existingDaysInCycle < 14
statusReason: expected 'Período de férias inválido.' to contain '14'

[Killed] ConditionalExpression
lib/vacationRules.ts:511:59
 
   for (let i = 0; i < sorted.length; i++) {
     const { start, end } = sorted[i];
-    if (isNaN(start.getTime()) || isNaN(end.getTime()) || end < start) {
+    if (isNaN(start.getTime()) || isNaN(end.getTime()) || false) {
       return "Período de férias inválido.";
     }
killedBy: validateCltPeriods (overlap and 14 days) rejects invalid period (end < start)
statusReason: expected 'Cada período deve ter no mínimo 5 dia…' to contain 'inválido'

[Killed] EqualityOperator
lib/vacationRules.ts:516:9
     }
 
     const days = daysBetweenInclusive(start, end);
-    if (days < 5) return "Cada período deve ter no mínimo 5 dias corridos.";
+    if (days >= 5) return "Cada período deve ter no mínimo 5 dias corridos.";
     if (days >= 14) hasPeriodWith14OrMore = true;
 
killedBy: validateCltPeriods requires at least one period of 14+ days when existingDaysInCycle < 14
statusReason: expected 'Cada período deve ter no mínimo 5 dia…' to contain '14'

[Killed] ConditionalExpression
lib/vacationRules.ts:516:9
     }
 
     const days = daysBetweenInclusive(start, end);
-    if (days < 5) return "Cada período deve ter no mínimo 5 dias corridos.";
+    if (true) return "Cada período deve ter no mínimo 5 dias corridos.";
     if (days >= 14) hasPeriodWith14OrMore = true;
 
killedBy: Workflow: request creation validation (CLT + blackout) valid period passes validateCltPeriods with checkAdvanceNotice
statusReason: expected 'Cada período deve ter no mínimo 5 dia…' to be null

[Killed] EqualityOperator
lib/vacationRules.ts:517:9
 
     const days = daysBetweenInclusive(start, end);
     if (days < 5) return "Cada período deve ter no mínimo 5 dias corridos.";
-    if (days >= 14) hasPeriodWith14OrMore = true;
+    if (days < 14) hasPeriodWith14OrMore = true;
 
     // CLT (art. 134, §3º e interpretação): término não pode ser no sábado ou domingo (DSR)
killedBy: validateCltPeriods requires at least one period of 14+ days when existingDaysInCycle < 14
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BooleanLiteral
lib/vacationRules.ts:517:45
 
     const days = daysBetweenInclusive(start, end);
     if (days < 5) return "Cada período deve ter no mínimo 5 dias corridos.";
-    if (days >= 14) hasPeriodWith14OrMore = true;
+    if (days >= 14) hasPeriodWith14OrMore = false;
 
     // CLT (art. 134, §3º e interpretação): término não pode ser no sábado ou domingo (DSR)
killedBy: validateCltPeriods accepts period of 14 days with end on weekday (checkAdvanceNotice false)
statusReason: expected 'Pelo menos um período deve ter 14 dia…' to be null

[Killed] ConditionalExpression
lib/vacationRules.ts:521:9
 
     // CLT (art. 134, §3º e interpretação): término não pode ser no sábado ou domingo (DSR)
     const endWeekDay = getUtcWeekDay(end); // 0 = domingo, 6 = sábado
-    if (endWeekDay === 0 || endWeekDay === 6) {
+    if (true) {
       return "O término das férias não pode ocorrer no sábado ou no domingo (repouso semanal remunerado).";
     }
killedBy: validateCltPeriods requires at least one period of 14+ days when existingDaysInCycle < 14
statusReason: expected 'O término das férias não pode ocorrer…' to contain '14'

[Killed] EqualityOperator
lib/vacationRules.ts:521:9
 
     // CLT (art. 134, §3º e interpretação): término não pode ser no sábado ou domingo (DSR)
     const endWeekDay = getUtcWeekDay(end); // 0 = domingo, 6 = sábado
-    if (endWeekDay === 0 || endWeekDay === 6) {
+    if (endWeekDay !== 0 || endWeekDay === 6) {
       return "O término das férias não pode ocorrer no sábado ou no domingo (repouso semanal remunerado).";
     }
killedBy: validateCltPeriods requires at least one period of 14+ days when existingDaysInCycle < 14
statusReason: expected 'O término das férias não pode ocorrer…' to contain '14'

[Killed] ArithmeticOperator
lib/vacationRules.ts:525:34
       return "O término das férias não pode ocorrer no sábado ou no domingo (repouso semanal remunerado).";
     }
 
-    if (i > 0 && start <= sorted[i - 1].end) {
+    if (i > 0 && start <= sorted[i + 1].end) {
       return "Os períodos não podem se sobrepor.";
     }
killedBy: validateCltPeriods (overlap and 14 days) rejects overlapping periods (weekday ends)
statusReason: Cannot read properties of undefined (reading 'end')

[Killed] EqualityOperator
lib/vacationRules.ts:525:9
       return "O término das férias não pode ocorrer no sábado ou no domingo (repouso semanal remunerado).";
     }
 
-    if (i > 0 && start <= sorted[i - 1].end) {
+    if (i <= 0 && start <= sorted[i - 1].end) {
       return "Os períodos não podem se sobrepor.";
     }
killedBy: validateCltPeriods requires at least one period of 14+ days when existingDaysInCycle < 14
statusReason: Cannot read properties of undefined (reading 'end')

[Killed] LogicalOperator
lib/vacationRules.ts:531:7
   }
 
   // CLT: pelo menos um período de 14 dias no ciclo; se já há 14+ dias em outra solicitação, não exige nesta
-  if (existingDays < 14 && !hasPeriodWith14OrMore) {
+  if (existingDays < 14 || !hasPeriodWith14OrMore) {
     return "Pelo menos um período deve ter 14 dias ou mais (CLT).";
   }
killedBy: validateCltPeriods accepts period of 14 days with end on weekday (checkAdvanceNotice false)
statusReason: expected 'Pelo menos um período deve ter 14 dia…' to be null

[Killed] BlockStatement
lib/vacationRules.ts:531:52
   }
 
   // CLT: pelo menos um período de 14 dias no ciclo; se já há 14+ dias em outra solicitação, não exige nesta
-  if (existingDays < 14 && !hasPeriodWith14OrMore) {
-    return "Pelo menos um período deve ter 14 dias ou mais (CLT).";
-  }
+  if (existingDays < 14 && !hasPeriodWith14OrMore) {}
 
   const totalDays = sorted.reduce((acc, p) => acc + daysBetweenInclusive(p.start, p.end), 0);
killedBy: validateCltPeriods requires at least one period of 14+ days when existingDaysInCycle < 14
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] StringLiteral
lib/vacationRules.ts:532:12
 
   // CLT: pelo menos um período de 14 dias no ciclo; se já há 14+ dias em outra solicitação, não exige nesta
   if (existingDays < 14 && !hasPeriodWith14OrMore) {
-    return "Pelo menos um período deve ter 14 dias ou mais (CLT).";
+    return "";
   }
 
killedBy: validateCltPeriods requires at least one period of 14+ days when existingDaysInCycle < 14
statusReason: expected '' to contain '14'

[Timeout] ArrowFunction
lib/vacationRules.ts:535:35
     return "Pelo menos um período deve ter 14 dias ou mais (CLT).";
   }
 
-  const totalDays = sorted.reduce((acc, p) => acc + daysBetweenInclusive(p.start, p.end), 0);
+  const totalDays = sorted.reduce(() => undefined, 0);
 
   const entitled = options.entitledDays ?? 30;

[Timeout] ArithmeticOperator
lib/vacationRules.ts:535:47
     return "Pelo menos um período deve ter 14 dias ou mais (CLT).";
   }
 
-  const totalDays = sorted.reduce((acc, p) => acc + daysBetweenInclusive(p.start, p.end), 0);
+  const totalDays = sorted.reduce((acc, p) => acc - daysBetweenInclusive(p.start, p.end), 0);
 
   const entitled = options.entitledDays ?? 30;

[Timeout] LogicalOperator
lib/vacationRules.ts:537:20
 
   const totalDays = sorted.reduce((acc, p) => acc + daysBetweenInclusive(p.start, p.end), 0);
 
-  const entitled = options.entitledDays ?? 30;
+  const entitled = options.entitledDays && 30;
   const totalInCycle = existingDays + totalDays;
   if (totalInCycle > entitled) {

[Timeout] ArithmeticOperator
lib/vacationRules.ts:538:24
   const totalDays = sorted.reduce((acc, p) => acc + daysBetweenInclusive(p.start, p.end), 0);
 
   const entitled = options.entitledDays ?? 30;
-  const totalInCycle = existingDays + totalDays;
+  const totalInCycle = existingDays - totalDays;
   if (totalInCycle > entitled) {
     return `Total do ciclo não pode ultrapassar ${entitled} dias (seu direito). Você já tem ${existingDays} dias no ciclo e está solicitando ${totalDays} (total: ${totalInCycle}).`;

[Killed] EqualityOperator
lib/vacationRules.ts:539:7
 
   const entitled = options.entitledDays ?? 30;
   const totalInCycle = existingDays + totalDays;
-  if (totalInCycle > entitled) {
+  if (totalInCycle <= entitled) {
     return `Total do ciclo não pode ultrapassar ${entitled} dias (seu direito). Você já tem ${existingDays} dias no ciclo e está solicitando ${totalDays} (total: ${totalInCycle}).`;
   }
killedBy: validateCltPeriods accepts period of 14 days with end on weekday (checkAdvanceNotice false)
statusReason: expected 'Total do ciclo não pode ultrapassar 3…' to be null

[Killed] ConditionalExpression
lib/vacationRules.ts:539:7
 
   const entitled = options.entitledDays ?? 30;
   const totalInCycle = existingDays + totalDays;
-  if (totalInCycle > entitled) {
+  if (true) {
     return `Total do ciclo não pode ultrapassar ${entitled} dias (seu direito). Você já tem ${existingDays} dias no ciclo e está solicitando ${totalDays} (total: ${totalInCycle}).`;
   }
killedBy: validateCltPeriods accepts period of 14 days with end on weekday (checkAdvanceNotice false)
statusReason: expected 'Total do ciclo não pode ultrapassar 3…' to be null

[Killed] BlockStatement
lib/vacationRules.ts:545:35
   // CLT art. 134, §1º: fracionamento permitido em até 3 períodos; não exige os 30 dias numa só solicitação.
   // Pode solicitar 14 agora e o restante depois, desde que um período tenha ≥14 dias e total no ciclo ≤ entitled.
 
-  if (options.checkAdvanceNotice) {
-    const firstStart = sorted[0].start;
-    const today = toUtcMidnight(new Date());
-    const diffDays = Math.floor(
-      (toUtcMidnight(firstStart).getTime() - today.getTime()) / ONE_DAY_MS,
-    );
-    if (diffDays < 30) return "O primeiro período deve respeitar aviso prévio mínimo de 30 dias.";
-
-    // Lei 13.467/2017, art. 134, §3º: é vedado o início das férias
-    // no período de 2 dias que antecede feriado ou repouso semanal remunerado.
-    // DSR: assumimos domingo → não permitir início na sexta (5) ou sábado (6).
-    const weekDay = getUtcWeekDay(firstStart); // 0 = domingo, 6 = sábado
-    if (weekDay === 5 || weekDay === 6) {
-      return "O início das férias não pode ocorrer na sexta ou no sábado, conforme art. 134, §3º, da CLT.";
-    }
-
-    // Feriados (São Paulo capital + nacionais): não pode iniciar nos 2 dias que antecedem
-    for (let offset = 1; offset <= 2; offset++) {
-      const check = new Date(firstStart);
-      check.setUTCDate(check.getUTCDate() + offset);
-      if (isSaoPauloHoliday(check)) {
-        return "O início das férias não pode ocorrer nos 2 dias que antecedem feriado, conforme art. 134, §3º, da CLT.";
-      }
-    }
-  }
+  if (options.checkAdvanceNotice) {}
 
   return null;
killedBy: validateCltPeriods (overlap and 14 days) rejects when start is 2 days before holiday (checkAdvanceNotice)
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
lib/vacationRules.ts:545:7
   // CLT art. 134, §1º: fracionamento permitido em até 3 períodos; não exige os 30 dias numa só solicitação.
   // Pode solicitar 14 agora e o restante depois, desde que um período tenha ≥14 dias e total no ciclo ≤ entitled.
 
-  if (options.checkAdvanceNotice) {
+  if (false) {
     const firstStart = sorted[0].start;
     const today = toUtcMidnight(new Date());
killedBy: validateCltPeriods (overlap and 14 days) rejects when start is 2 days before holiday (checkAdvanceNotice)
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Timeout] ArithmeticOperator
lib/vacationRules.ts:549:8
     const firstStart = sorted[0].start;
     const today = toUtcMidnight(new Date());
     const diffDays = Math.floor(
-      (toUtcMidnight(firstStart).getTime() - today.getTime()) / ONE_DAY_MS,
+      (toUtcMidnight(firstStart).getTime() + today.getTime()) / ONE_DAY_MS,
     );
     if (diffDays < 30) return "O primeiro período deve respeitar aviso prévio mínimo de 30 dias.";

[Timeout] ArithmeticOperator
lib/vacationRules.ts:549:7
     const firstStart = sorted[0].start;
     const today = toUtcMidnight(new Date());
     const diffDays = Math.floor(
-      (toUtcMidnight(firstStart).getTime() - today.getTime()) / ONE_DAY_MS,
+      (toUtcMidnight(firstStart).getTime() - today.getTime()) * ONE_DAY_MS,
     );
     if (diffDays < 30) return "O primeiro período deve respeitar aviso prévio mínimo de 30 dias.";

[Killed] ConditionalExpression
lib/vacationRules.ts:551:9
     const diffDays = Math.floor(
       (toUtcMidnight(firstStart).getTime() - today.getTime()) / ONE_DAY_MS,
     );
-    if (diffDays < 30) return "O primeiro período deve respeitar aviso prévio mínimo de 30 dias.";
+    if (true) return "O primeiro período deve respeitar aviso prévio mínimo de 30 dias.";
 
     // Lei 13.467/2017, art. 134, §3º: é vedado o início das férias
killedBy: validateCltPeriods (overlap and 14 days) rejects when start is 2 days before holiday (checkAdvanceNotice)
statusReason: expected 'O primeiro período deve respeitar avi…' to contain 'feriado'

[Killed] EqualityOperator
lib/vacationRules.ts:551:9
     const diffDays = Math.floor(
       (toUtcMidnight(firstStart).getTime() - today.getTime()) / ONE_DAY_MS,
     );
-    if (diffDays < 30) return "O primeiro período deve respeitar aviso prévio mínimo de 30 dias.";
+    if (diffDays >= 30) return "O primeiro período deve respeitar aviso prévio mínimo de 30 dias.";
 
     // Lei 13.467/2017, art. 134, §3º: é vedado o início das férias
killedBy: validateCltPeriods (overlap and 14 days) rejects when start is 2 days before holiday (checkAdvanceNotice)
statusReason: expected 'O primeiro período deve respeitar avi…' to contain 'feriado'

[Killed] EqualityOperator
lib/vacationRules.ts:557:9
     // no período de 2 dias que antecede feriado ou repouso semanal remunerado.
     // DSR: assumimos domingo → não permitir início na sexta (5) ou sábado (6).
     const weekDay = getUtcWeekDay(firstStart); // 0 = domingo, 6 = sábado
-    if (weekDay === 5 || weekDay === 6) {
+    if (weekDay !== 5 || weekDay === 6) {
       return "O início das férias não pode ocorrer na sexta ou no sábado, conforme art. 134, §3º, da CLT.";
     }
killedBy: validateCltPeriods (overlap and 14 days) rejects when start is 2 days before holiday (checkAdvanceNotice)
statusReason: expected 'O início das férias não pode ocorrer …' to contain 'feriado'

[Killed] ConditionalExpression
lib/vacationRules.ts:557:9
     // no período de 2 dias que antecede feriado ou repouso semanal remunerado.
     // DSR: assumimos domingo → não permitir início na sexta (5) ou sábado (6).
     const weekDay = getUtcWeekDay(firstStart); // 0 = domingo, 6 = sábado
-    if (weekDay === 5 || weekDay === 6) {
+    if (true) {
       return "O início das férias não pode ocorrer na sexta ou no sábado, conforme art. 134, §3º, da CLT.";
     }
killedBy: validateCltPeriods (overlap and 14 days) rejects when start is 2 days before holiday (checkAdvanceNotice)
statusReason: expected 'O início das férias não pode ocorrer …' to contain 'feriado'

[Timeout] StringLiteral
lib/vacationRules.ts:558:14
     // DSR: assumimos domingo → não permitir início na sexta (5) ou sábado (6).
     const weekDay = getUtcWeekDay(firstStart); // 0 = domingo, 6 = sábado
     if (weekDay === 5 || weekDay === 6) {
-      return "O início das férias não pode ocorrer na sexta ou no sábado, conforme art. 134, §3º, da CLT.";
+      return "";
     }
 

[Killed] ConditionalExpression
lib/vacationRules.ts:562:26
     }
 
     // Feriados (São Paulo capital + nacionais): não pode iniciar nos 2 dias que antecedem
-    for (let offset = 1; offset <= 2; offset++) {
+    for (let offset = 1; false; offset++) {
       const check = new Date(firstStart);
       check.setUTCDate(check.getUTCDate() + offset);
killedBy: validateCltPeriods (overlap and 14 days) rejects when start is 2 days before holiday (checkAdvanceNotice)
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] EqualityOperator
lib/vacationRules.ts:562:26
     }
 
     // Feriados (São Paulo capital + nacionais): não pode iniciar nos 2 dias que antecedem
-    for (let offset = 1; offset <= 2; offset++) {
+    for (let offset = 1; offset > 2; offset++) {
       const check = new Date(firstStart);
       check.setUTCDate(check.getUTCDate() + offset);
killedBy: validateCltPeriods (overlap and 14 days) rejects when start is 2 days before holiday (checkAdvanceNotice)
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ArithmeticOperator
lib/vacationRules.ts:564:24
     // Feriados (São Paulo capital + nacionais): não pode iniciar nos 2 dias que antecedem
     for (let offset = 1; offset <= 2; offset++) {
       const check = new Date(firstStart);
-      check.setUTCDate(check.getUTCDate() + offset);
+      check.setUTCDate(check.getUTCDate() - offset);
       if (isSaoPauloHoliday(check)) {
         return "O início das férias não pode ocorrer nos 2 dias que antecedem feriado, conforme art. 134, §3º, da CLT.";
killedBy: validateCltPeriods (overlap and 14 days) rejects when start is 2 days before holiday (checkAdvanceNotice)
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Timeout] MethodExpression
lib/vacationRules.ts:564:7
     // Feriados (São Paulo capital + nacionais): não pode iniciar nos 2 dias que antecedem
     for (let offset = 1; offset <= 2; offset++) {
       const check = new Date(firstStart);
-      check.setUTCDate(check.getUTCDate() + offset);
+      check.setTime(check.getUTCDate() + offset);
       if (isSaoPauloHoliday(check)) {
         return "O início das férias não pode ocorrer nos 2 dias que antecedem feriado, conforme art. 134, §3º, da CLT.";

[Killed] ConditionalExpression
lib/vacationRules.ts:565:11
     for (let offset = 1; offset <= 2; offset++) {
       const check = new Date(firstStart);
       check.setUTCDate(check.getUTCDate() + offset);
-      if (isSaoPauloHoliday(check)) {
+      if (false) {
         return "O início das férias não pode ocorrer nos 2 dias que antecedem feriado, conforme art. 134, §3º, da CLT.";
       }
killedBy: validateCltPeriods (overlap and 14 days) rejects when start is 2 days before holiday (checkAdvanceNotice)
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
lib/vacationRules.ts:565:37
     for (let offset = 1; offset <= 2; offset++) {
       const check = new Date(firstStart);
       check.setUTCDate(check.getUTCDate() + offset);
-      if (isSaoPauloHoliday(check)) {
-        return "O início das férias não pode ocorrer nos 2 dias que antecedem feriado, conforme art. 134, §3º, da CLT.";
-      }
+      if (isSaoPauloHoliday(check)) {}
     }
   }
killedBy: validateCltPeriods (overlap and 14 days) rejects when start is 2 days before holiday (checkAdvanceNotice)
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
lib/vacationRules.ts:582:18
   end: Date,
   blackouts: { startDate: Date; endDate: Date; reason: string; department?: string | null }[],
   userDepartment?: string | null,
-): string | null {
-  for (const blackout of blackouts) {
-    // Aplica se for geral (sem departamento) ou do mesmo departamento
-    const applies =
-      !blackout.department ||
-      !userDepartment ||
-      blackout.department === userDepartment;
-
-    if (!applies) continue;
-
-    // Verifica sobreposição
-    if (new Date(start) <= new Date(blackout.endDate) && new Date(end) >= new Date(blackout.startDate)) {
-      const startFmt = new Date(blackout.startDate).toLocaleDateString("pt-BR");
-      const endFmt = new Date(blackout.endDate).toLocaleDateString("pt-BR");
-      return `Período bloqueado pela empresa: "${blackout.reason}" (${startFmt} – ${endFmt}).`;
-    }
-  }
-  return null;
-}
+): string | null {}
 
killedBy: Workflow: request creation validation (CLT + blackout) blackout blocks overlapping period
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
lib/vacationRules.ts:583:37
   blackouts: { startDate: Date; endDate: Date; reason: string; department?: string | null }[],
   userDepartment?: string | null,
 ): string | null {
-  for (const blackout of blackouts) {
-    // Aplica se for geral (sem departamento) ou do mesmo departamento
-    const applies =
-      !blackout.department ||
-      !userDepartment ||
-      blackout.department === userDepartment;
-
-    if (!applies) continue;
-
-    // Verifica sobreposição
-    if (new Date(start) <= new Date(blackout.endDate) && new Date(end) >= new Date(blackout.startDate)) {
-      const startFmt = new Date(blackout.startDate).toLocaleDateString("pt-BR");
-      const endFmt = new Date(blackout.endDate).toLocaleDateString("pt-BR");
-      return `Período bloqueado pela empresa: "${blackout.reason}" (${startFmt} – ${endFmt}).`;
-    }
-  }
+  for (const blackout of blackouts) {}
   return null;
 }
killedBy: checkBlackoutPeriods returns message when request overlaps blackout
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
lib/vacationRules.ts:586:7
   for (const blackout of blackouts) {
     // Aplica se for geral (sem departamento) ou do mesmo departamento
     const applies =
-      !blackout.department ||
-      !userDepartment ||
-      blackout.department === userDepartment;
+      true;
 
     if (!applies) continue;
killedBy: checkBlackoutPeriods applies department-specific blackout only to same department
statusReason: expected 'Período bloqueado pela empresa: "TI" …' to be null

[Killed] ConditionalExpression
lib/vacationRules.ts:586:7
   for (const blackout of blackouts) {
     // Aplica se for geral (sem departamento) ou do mesmo departamento
     const applies =
-      !blackout.department ||
-      !userDepartment ||
-      blackout.department === userDepartment;
+      false;
 
     if (!applies) continue;
killedBy: checkBlackoutPeriods returns message when request overlaps blackout
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BooleanLiteral
lib/vacationRules.ts:587:7
     // Aplica se for geral (sem departamento) ou do mesmo departamento
     const applies =
       !blackout.department ||
-      !userDepartment ||
+      userDepartment ||
       blackout.department === userDepartment;
 
killedBy: checkBlackoutPeriods applies department-specific blackout only to same department
statusReason: expected 'Período bloqueado pela empresa: "TI" …' to be null
