[Killed] ConditionalExpression
lib/vacationRules.ts:588:7
     const applies =
       !blackout.department ||
       !userDepartment ||
-      blackout.department === userDepartment;
+      false;
 
     if (!applies) continue;
killedBy: checkBlackoutPeriods applies department-specific blackout only to same department
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] EqualityOperator
lib/vacationRules.ts:588:7
     const applies =
       !blackout.department ||
       !userDepartment ||
-      blackout.department === userDepartment;
+      blackout.department !== userDepartment;
 
     if (!applies) continue;
killedBy: checkBlackoutPeriods applies department-specific blackout only to same department
statusReason: expected 'Período bloqueado pela empresa: "TI" …' to be null

[Killed] ConditionalExpression
lib/vacationRules.ts:590:9
       !userDepartment ||
       blackout.department === userDepartment;
 
-    if (!applies) continue;
+    if (false) continue;
 
     // Verifica sobreposição
killedBy: checkBlackoutPeriods applies department-specific blackout only to same department
statusReason: expected 'Período bloqueado pela empresa: "TI" …' to be null

[Killed] ConditionalExpression
lib/vacationRules.ts:590:9
       !userDepartment ||
       blackout.department === userDepartment;
 
-    if (!applies) continue;
+    if (true) continue;
 
     // Verifica sobreposição
killedBy: checkBlackoutPeriods returns message when request overlaps blackout
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] EqualityOperator
lib/vacationRules.ts:593:58
     if (!applies) continue;
 
     // Verifica sobreposição
-    if (new Date(start) <= new Date(blackout.endDate) && new Date(end) >= new Date(blackout.startDate)) {
+    if (new Date(start) <= new Date(blackout.endDate) && new Date(end) < new Date(blackout.startDate)) {
       const startFmt = new Date(blackout.startDate).toLocaleDateString("pt-BR");
       const endFmt = new Date(blackout.endDate).toLocaleDateString("pt-BR");
killedBy: checkBlackoutPeriods returns null when request does not overlap blackout
statusReason: expected 'Período bloqueado pela empresa: "Fech…' to be null

[Killed] ConditionalExpression
lib/vacationRules.ts:593:9
     if (!applies) continue;
 
     // Verifica sobreposição
-    if (new Date(start) <= new Date(blackout.endDate) && new Date(end) >= new Date(blackout.startDate)) {
+    if (true) {
       const startFmt = new Date(blackout.startDate).toLocaleDateString("pt-BR");
       const endFmt = new Date(blackout.endDate).toLocaleDateString("pt-BR");
killedBy: checkBlackoutPeriods returns null when request does not overlap blackout
statusReason: expected 'Período bloqueado pela empresa: "Fech…' to be null

[Killed] StringLiteral
lib/vacationRules.ts:595:68
     // Verifica sobreposição
     if (new Date(start) <= new Date(blackout.endDate) && new Date(end) >= new Date(blackout.startDate)) {
       const startFmt = new Date(blackout.startDate).toLocaleDateString("pt-BR");
-      const endFmt = new Date(blackout.endDate).toLocaleDateString("pt-BR");
+      const endFmt = new Date(blackout.endDate).toLocaleDateString("");
       return `Período bloqueado pela empresa: "${blackout.reason}" (${startFmt} – ${endFmt}).`;
     }
killedBy: checkBlackoutPeriods returns message when request overlaps blackout
statusReason: Incorrect locale information provided

[Killed] StringLiteral
lib/vacationRules.ts:596:14
     if (new Date(start) <= new Date(blackout.endDate) && new Date(end) >= new Date(blackout.startDate)) {
       const startFmt = new Date(blackout.startDate).toLocaleDateString("pt-BR");
       const endFmt = new Date(blackout.endDate).toLocaleDateString("pt-BR");
-      return `Período bloqueado pela empresa: "${blackout.reason}" (${startFmt} – ${endFmt}).`;
+      return ``;
     }
   }
killedBy: checkBlackoutPeriods returns message when request overlaps blackout
statusReason: expected '' to contain 'bloqueado'
