[Timeout] Regex
lib/validation.ts:7:20
  */
 
 /** CUID (v1) tem 25 caracteres e começa com 'c'; CUID2 varia. Aceitamos formato compatível com Prisma. */
-const CUID_REGEX = /^[a-zA-Z0-9]{20,30}$/;
+const CUID_REGEX = /^[^a-zA-Z0-9]{20,30}$/;
 
 export function isCuid(id: unknown): id is string {

[Timeout] Regex
lib/validation.ts:7:20
  */
 
 /** CUID (v1) tem 25 caracteres e começa com 'c'; CUID2 varia. Aceitamos formato compatível com Prisma. */
-const CUID_REGEX = /^[a-zA-Z0-9]{20,30}$/;
+const CUID_REGEX = /^[a-zA-Z0-9]{20,30}/;
 
 export function isCuid(id: unknown): id is string {

[Timeout] BlockStatement
lib/validation.ts:9:51
 /** CUID (v1) tem 25 caracteres e começa com 'c'; CUID2 varia. Aceitamos formato compatível com Prisma. */
 const CUID_REGEX = /^[a-zA-Z0-9]{20,30}$/;
 
-export function isCuid(id: unknown): id is string {
-  return typeof id === "string" && id.length > 0 && CUID_REGEX.test(id);
-}
+export function isCuid(id: unknown): id is string {}
 
 export function requireCuid(id: unknown): string | null {

[Timeout] ConditionalExpression
lib/validation.ts:10:36
 const CUID_REGEX = /^[a-zA-Z0-9]{20,30}$/;
 
 export function isCuid(id: unknown): id is string {
-  return typeof id === "string" && id.length > 0 && CUID_REGEX.test(id);
+  return typeof id === "string" && true && CUID_REGEX.test(id);
 }
 

[Timeout] ConditionalExpression
lib/validation.ts:10:10
 const CUID_REGEX = /^[a-zA-Z0-9]{20,30}$/;
 
 export function isCuid(id: unknown): id is string {
-  return typeof id === "string" && id.length > 0 && CUID_REGEX.test(id);
+  return false;
 }
 

[Timeout] BlockStatement
lib/validation.ts:13:57
   return typeof id === "string" && id.length > 0 && CUID_REGEX.test(id);
 }
 
-export function requireCuid(id: unknown): string | null {
-  return isCuid(id) ? id : null;
-}
+export function requireCuid(id: unknown): string | null {}
 
