[Timeout] BlockStatement
repositories/blackoutRepository.ts:3:39
 import { prisma } from "@/lib/prisma";
 
-export async function findBlackouts() {
-  return prisma.blackoutPeriod.findMany({
-    include: { createdBy: { select: { name: true } } },
-    orderBy: { startDate: "asc" },
-  });
-}
+export async function findBlackouts() {}
 

[Timeout] BooleanLiteral
repositories/blackoutRepository.ts:5:45
 
 export async function findBlackouts() {
   return prisma.blackoutPeriod.findMany({
-    include: { createdBy: { select: { name: true } } },
+    include: { createdBy: { select: { name: false } } },
     orderBy: { startDate: "asc" },
   });
