[Killed] BlockStatement
repositories/userRepository.ts:23:59
   },
 } as const;
 
-export async function findUserWithBalance(userId: string) {
-  return prisma.user.findUnique({
-    where: { id: userId },
-    select: {
-      hireDate: true,
-      department: true,
-      vacationRequests: {
-        select: { startDate: true, endDate: true, status: true },
-      },
-    },
-  });
-}
+export async function findUserWithBalance(userId: string) {}
 
 export async function findUserDepartment(userId: string): Promise<string | null> {
killedBy: userRepository findUserWithBalance calls prisma with userId
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Timeout] ObjectLiteral
repositories/userRepository.ts:26:13
 export async function findUserWithBalance(userId: string) {
   return prisma.user.findUnique({
     where: { id: userId },
-    select: {
-      hireDate: true,
-      department: true,
-      vacationRequests: {
-        select: { startDate: true, endDate: true, status: true },
-      },
-    },
+    select: {},
   });
 }

[Timeout] BooleanLiteral
repositories/userRepository.ts:27:17
   return prisma.user.findUnique({
     where: { id: userId },
     select: {
-      hireDate: true,
+      hireDate: false,
       department: true,
       vacationRequests: {

[Timeout] BooleanLiteral
repositories/userRepository.ts:28:19
     where: { id: userId },
     select: {
       hireDate: true,
-      department: true,
+      department: false,
       vacationRequests: {
         select: { startDate: true, endDate: true, status: true },

[Timeout] BooleanLiteral
repositories/userRepository.ts:30:59
       hireDate: true,
       department: true,
       vacationRequests: {
-        select: { startDate: true, endDate: true, status: true },
+        select: { startDate: true, endDate: true, status: false },
       },
     },

[Timeout] BooleanLiteral
repositories/userRepository.ts:30:45
       hireDate: true,
       department: true,
       vacationRequests: {
-        select: { startDate: true, endDate: true, status: true },
+        select: { startDate: true, endDate: false, status: true },
       },
     },

[Killed] BlockStatement
repositories/userRepository.ts:36:82
   });
 }
 
-export async function findUserDepartment(userId: string): Promise<string | null> {
-  const u = await prisma.user.findUnique({
-    where: { id: userId },
-    select: { department: true },
-  });
-  return u?.department ?? null;
-}
+export async function findUserDepartment(userId: string): Promise<string | null> {}
 
 export async function findTeamMembersByManager(managerId: string) {
killedBy: userRepository findUserDepartment returns department or null
statusReason: expected undefined to be 'TI' // Object.is equality

[Timeout] BooleanLiteral
repositories/userRepository.ts:39:27
 export async function findUserDepartment(userId: string): Promise<string | null> {
   const u = await prisma.user.findUnique({
     where: { id: userId },
-    select: { department: true },
+    select: { department: false },
   });
   return u?.department ?? null;

[Killed] OptionalChaining
repositories/userRepository.ts:41:10
     where: { id: userId },
     select: { department: true },
   });
-  return u?.department ?? null;
+  return u.department ?? null;
 }
 
killedBy: userRepository findUserDepartment returns department or null
statusReason: Cannot read properties of null (reading 'department')

[Killed] LogicalOperator
repositories/userRepository.ts:41:10
     where: { id: userId },
     select: { department: true },
   });
-  return u?.department ?? null;
+  return u?.department && null;
 }
 
killedBy: userRepository findUserDepartment returns department or null
statusReason: expected null to be 'TI' // Object.is equality

[Killed] BlockStatement
repositories/userRepository.ts:44:67
   return u?.department ?? null;
 }
 
-export async function findTeamMembersByManager(managerId: string) {
-  return prisma.user.findMany({
-    where: { managerId },
-    include: baseInclude,
-  });
-}
+export async function findTeamMembersByManager(managerId: string) {}
 
 export async function findTeamMembersByGerente(gerenteId: string) {
killedBy: userRepository findTeamMembersByManager calls prisma with managerId
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] BlockStatement
repositories/userRepository.ts:51:67
   });
 }
 
-export async function findTeamMembersByGerente(gerenteId: string) {
-  return prisma.user.findMany({
-    where: { manager: { managerId: gerenteId } },
-    include: baseInclude,
-  });
-}
+export async function findTeamMembersByGerente(gerenteId: string) {}
 
 export async function findAllEmployees() {
killedBy: userRepository findTeamMembersByGerente calls prisma with manager.managerId
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
repositories/userRepository.ts:58:42
   });
 }
 
-export async function findAllEmployees() {
-  return prisma.user.findMany({
-    where: { role: { in: ["FUNCIONARIO", "COLABORADOR"] } },
-    include: baseInclude,
-  });
-}
+export async function findAllEmployees() {}
 
 export async function findAllUsersForAdmin() {
killedBy: userRepository findAllEmployees calls prisma with role filter
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] StringLiteral
repositories/userRepository.ts:60:42
 
 export async function findAllEmployees() {
   return prisma.user.findMany({
-    where: { role: { in: ["FUNCIONARIO", "COLABORADOR"] } },
+    where: { role: { in: ["FUNCIONARIO", ""] } },
     include: baseInclude,
   });
killedBy: userRepository findAllEmployees calls prisma with role filter
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
repositories/userRepository.ts:65:46
   });
 }
 
-export async function findAllUsersForAdmin() {
-  return prisma.user.findMany({
-    orderBy: [{ role: "asc" }, { name: "asc" }],
-    select: {
-      id: true,
-      name: true,
-      email: true,
-      role: true,
-      registration: true,
-      department: true,
-      hireDate: true,
-      managerId: true,
-      manager: { select: { id: true, name: true } },
-      _count: { select: { reports: true } },
-    },
-  });
-}
+export async function findAllUsersForAdmin() {}
 
 export async function findManagersForAdmin() {
killedBy: userRepository findAllUsersForAdmin chama prisma com ordenação e seleção de campos esperados
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ObjectLiteral
repositories/userRepository.ts:67:15
 
 export async function findAllUsersForAdmin() {
   return prisma.user.findMany({
-    orderBy: [{ role: "asc" }, { name: "asc" }],
+    orderBy: [{}, { name: "asc" }],
     select: {
       id: true,
killedBy: userRepository findAllUsersForAdmin chama prisma com ordenação e seleção de campos esperados
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ObjectLiteral
repositories/userRepository.ts:67:32
 
 export async function findAllUsersForAdmin() {
   return prisma.user.findMany({
-    orderBy: [{ role: "asc" }, { name: "asc" }],
+    orderBy: [{ role: "asc" }, {}],
     select: {
       id: true,
killedBy: userRepository findAllUsersForAdmin chama prisma com ordenação e seleção de campos esperados
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ObjectLiteral
repositories/userRepository.ts:68:13
 export async function findAllUsersForAdmin() {
   return prisma.user.findMany({
     orderBy: [{ role: "asc" }, { name: "asc" }],
-    select: {
-      id: true,
-      name: true,
-      email: true,
-      role: true,
-      registration: true,
-      department: true,
-      hireDate: true,
-      managerId: true,
-      manager: { select: { id: true, name: true } },
-      _count: { select: { reports: true } },
-    },
+    select: {},
   });
 }
killedBy: userRepository findAllUsersForAdmin chama prisma com ordenação e seleção de campos esperados
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BooleanLiteral
repositories/userRepository.ts:72:13
       id: true,
       name: true,
       email: true,
-      role: true,
+      role: false,
       registration: true,
       department: true,
killedBy: userRepository findAllUsersForAdmin chama prisma com ordenação e seleção de campos esperados
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BooleanLiteral
repositories/userRepository.ts:73:21
       name: true,
       email: true,
       role: true,
-      registration: true,
+      registration: false,
       department: true,
       hireDate: true,
killedBy: userRepository findAllUsersForAdmin chama prisma com ordenação e seleção de campos esperados
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Survived] BooleanLiteral
repositories/userRepository.ts:74:19
       email: true,
       role: true,
       registration: true,
-      department: true,
+      department: false,
       hireDate: true,
       managerId: true,

[Timeout] BooleanLiteral
repositories/userRepository.ts:75:17
       role: true,
       registration: true,
       department: true,
-      hireDate: true,
+      hireDate: false,
       managerId: true,
       manager: { select: { id: true, name: true } },

[Timeout] BooleanLiteral
repositories/userRepository.ts:76:18
       registration: true,
       department: true,
       hireDate: true,
-      managerId: true,
+      managerId: false,
       manager: { select: { id: true, name: true } },
       _count: { select: { reports: true } },

[Timeout] BooleanLiteral
repositories/userRepository.ts:77:44
       department: true,
       hireDate: true,
       managerId: true,
-      manager: { select: { id: true, name: true } },
+      manager: { select: { id: true, name: false } },
       _count: { select: { reports: true } },
     },

[Timeout] BooleanLiteral
repositories/userRepository.ts:77:32
       department: true,
       hireDate: true,
       managerId: true,
-      manager: { select: { id: true, name: true } },
+      manager: { select: { id: false, name: true } },
       _count: { select: { reports: true } },
     },

[Timeout] BooleanLiteral
repositories/userRepository.ts:78:36
       hireDate: true,
       managerId: true,
       manager: { select: { id: true, name: true } },
-      _count: { select: { reports: true } },
+      _count: { select: { reports: false } },
     },
   });

[Timeout] ObjectLiteral
repositories/userRepository.ts:78:15
       hireDate: true,
       managerId: true,
       manager: { select: { id: true, name: true } },
-      _count: { select: { reports: true } },
+      _count: {},
     },
   });

[Killed] BlockStatement
repositories/userRepository.ts:83:46
   });
 }
 
-export async function findManagersForAdmin() {
-  return prisma.user.findMany({
-    where: { role: { in: ["COORDENADOR", "GERENTE", "GESTOR"] } },
-    select: { id: true, name: true },
-    orderBy: { name: "asc" },
-  });
-}
+export async function findManagersForAdmin() {}
 
 export async function findUsersWithVacationForBalance() {
killedBy: userRepository findManagersForAdmin chama prisma filtrando apenas coordenadores/gerentes/gestores
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ObjectLiteral
repositories/userRepository.ts:84:31
 }
 
 export async function findManagersForAdmin() {
-  return prisma.user.findMany({
-    where: { role: { in: ["COORDENADOR", "GERENTE", "GESTOR"] } },
-    select: { id: true, name: true },
-    orderBy: { name: "asc" },
-  });
+  return prisma.user.findMany({});
 }
 
killedBy: userRepository findManagersForAdmin chama prisma filtrando apenas coordenadores/gerentes/gestores
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] StringLiteral
repositories/userRepository.ts:85:42
 
 export async function findManagersForAdmin() {
   return prisma.user.findMany({
-    where: { role: { in: ["COORDENADOR", "GERENTE", "GESTOR"] } },
+    where: { role: { in: ["COORDENADOR", "", "GESTOR"] } },
     select: { id: true, name: true },
     orderBy: { name: "asc" },
killedBy: userRepository findManagersForAdmin chama prisma filtrando apenas coordenadores/gerentes/gestores
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BooleanLiteral
repositories/userRepository.ts:86:19
 export async function findManagersForAdmin() {
   return prisma.user.findMany({
     where: { role: { in: ["COORDENADOR", "GERENTE", "GESTOR"] } },
-    select: { id: true, name: true },
+    select: { id: false, name: true },
     orderBy: { name: "asc" },
   });
killedBy: userRepository findManagersForAdmin chama prisma filtrando apenas coordenadores/gerentes/gestores
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BooleanLiteral
repositories/userRepository.ts:86:31
 export async function findManagersForAdmin() {
   return prisma.user.findMany({
     where: { role: { in: ["COORDENADOR", "GERENTE", "GESTOR"] } },
-    select: { id: true, name: true },
+    select: { id: true, name: false },
     orderBy: { name: "asc" },
   });
killedBy: userRepository findManagersForAdmin chama prisma filtrando apenas coordenadores/gerentes/gestores
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Timeout] StringLiteral
repositories/userRepository.ts:87:22
   return prisma.user.findMany({
     where: { role: { in: ["COORDENADOR", "GERENTE", "GESTOR"] } },
     select: { id: true, name: true },
-    orderBy: { name: "asc" },
+    orderBy: { name: "" },
   });
 }

[Timeout] BlockStatement
repositories/userRepository.ts:91:57
   });
 }
 
-export async function findUsersWithVacationForBalance() {
-  return prisma.user.findMany({
-    orderBy: [{ name: "asc" }],
-    select: {
-      id: true,
-      name: true,
-      email: true,
-      role: true,
-      department: true,
-      hireDate: true,
-      vacationRequests: {
-        select: { startDate: true, endDate: true, status: true },
-      },
-    },
-  });
-}
+export async function findUsersWithVacationForBalance() {}
 

[Timeout] StringLiteral
repositories/userRepository.ts:93:23
 
 export async function findUsersWithVacationForBalance() {
   return prisma.user.findMany({
-    orderBy: [{ name: "asc" }],
+    orderBy: [{ name: "" }],
     select: {
       id: true,

[Timeout] BooleanLiteral
repositories/userRepository.ts:99:19
       name: true,
       email: true,
       role: true,
-      department: true,
+      department: false,
       hireDate: true,
       vacationRequests: {
