[Killed] BlockStatement
repositories/vacationRepository.ts:29:54
   },
 } as const;
 
-export async function findMyRequests(userId: string) {
-  return prisma.vacationRequest.findMany({
-    where: { userId },
-    include: vacationRequestInclude,
-    orderBy: { startDate: "asc" },
-  });
-}
+export async function findMyRequests(userId: string) {}
 
 export async function findManagedRequests(where: Record<string, unknown>) {
killedBy: vacationRepository findMyRequests calls prisma with userId
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Timeout] StringLiteral
repositories/vacationRepository.ts:33:27
   return prisma.vacationRequest.findMany({
     where: { userId },
     include: vacationRequestInclude,
-    orderBy: { startDate: "asc" },
+    orderBy: { startDate: "" },
   });
 }

[Killed] BlockStatement
repositories/vacationRepository.ts:37:75
   });
 }
 
-export async function findManagedRequests(where: Record<string, unknown>) {
-  return prisma.vacationRequest.findMany({
-    where,
-    include: vacationRequestInclude,
-    orderBy: { startDate: "asc" },
-  });
-}
+export async function findManagedRequests(where: Record<string, unknown>) {}
 
killedBy: vacationRepository findManagedRequests calls prisma with where
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Timeout] ObjectLiteral
repositories/vacationRepository.ts:41:14
   return prisma.vacationRequest.findMany({
     where,
     include: vacationRequestInclude,
-    orderBy: { startDate: "asc" },
+    orderBy: {},
   });
 }
