[Killed] ConditionalExpression
services/dashboardDataService.ts:19:7
 
   const myRequestsPromise = findMyRequests(userId);
 
-  if (role === "COLABORADOR" || role === "FUNCIONARIO") {
+  if (true) {
     const myRequests = await myRequestsPromise;
     return {
killedBy: getDashboardData returns managedRequests and teamRequests for COORDENADOR
statusReason: expected [] to have a length of 2 but got +0

[Killed] LogicalOperator
services/dashboardDataService.ts:19:7
 
   const myRequestsPromise = findMyRequests(userId);
 
-  if (role === "COLABORADOR" || role === "FUNCIONARIO") {
+  if (role === "COLABORADOR" && role === "FUNCIONARIO") {
     const myRequests = await myRequestsPromise;
     return {
killedBy: getDashboardData returns only myRequests for COLABORADOR/FUNCIONARIO
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Object {},

[Killed] ObjectLiteral
services/dashboardDataService.ts:21:12
 
   if (role === "COLABORADOR" || role === "FUNCIONARIO") {
     const myRequests = await myRequestsPromise;
-    return {
-      myRequests,
-      managedRequests: [],
-      blackouts: [],
-      teamRequests: [],
-    };
+    return {};
   }
 
killedBy: getDashboardData returns only myRequests for COLABORADOR/FUNCIONARIO
statusReason: Target cannot be null or undefined.

[Killed] ArrayDeclaration
services/dashboardDataService.ts:24:18
     return {
       myRequests,
       managedRequests: [],
-      blackouts: [],
+      blackouts: ["Stryker was here"],
       teamRequests: [],
     };
killedBy: getDashboardData returns only myRequests for COLABORADOR/FUNCIONARIO
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] ArrowFunction
services/dashboardDataService.ts:40:47
     findBlackouts(),
   ]);
 
-  const teamRequests = managedRequests.filter((r) =>
-    ["APROVADO_GERENTE", "APROVADO_RH"].includes(r.status)
+  const teamRequests = managedRequests.filter(() => undefined
   );
 
killedBy: getDashboardData returns managedRequests and teamRequests for COORDENADOR
statusReason: expected [] to have a length of 1 but got +0

[Killed] MethodExpression
services/dashboardDataService.ts:40:24
     findBlackouts(),
   ]);
 
-  const teamRequests = managedRequests.filter((r) =>
-    ["APROVADO_GERENTE", "APROVADO_RH"].includes(r.status)
-  );
+  const teamRequests = managedRequests;
 
   return { myRequests, managedRequests, blackouts, teamRequests };
killedBy: getDashboardData returns managedRequests and teamRequests for COORDENADOR
statusReason: expected [ { id: 'r1', …(3) }, …(1) ] to have a length of 1 but got 2

[Killed] StringLiteral
services/dashboardDataService.ts:41:6
   ]);
 
   const teamRequests = managedRequests.filter((r) =>
-    ["APROVADO_GERENTE", "APROVADO_RH"].includes(r.status)
+    ["", "APROVADO_RH"].includes(r.status)
   );
 
killedBy: getDashboardData returns managedRequests and teamRequests for COORDENADOR
statusReason: expected [] to have a length of 1 but got +0

[Killed] ObjectLiteral
services/dashboardDataService.ts:44:10
     ["APROVADO_GERENTE", "APROVADO_RH"].includes(r.status)
   );
 
-  return { myRequests, managedRequests, blackouts, teamRequests };
+  return {};
 }
 
killedBy: getDashboardData returns managedRequests and teamRequests for COORDENADOR
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
services/dashboardDataService.ts:47:61
   return { myRequests, managedRequests, blackouts, teamRequests };
 }
 
-export async function getCurrentUserBalance(userId: string) {
-  const userFull = await findUserWithBalance(userId);
-  return calculateVacationBalance(
-    userFull?.hireDate ?? null,
-    (userFull?.vacationRequests ?? []) as Array<{ startDate: Date; endDate: Date; status: string }>
-  );
-}
+export async function getCurrentUserBalance(userId: string) {}
 
 type RequestWithVisibility = {
killedBy: getCurrentUserBalance returns balance from findUserWithBalance
statusReason: Cannot read properties of undefined (reading 'entitledDays')

[Killed] OptionalChaining
services/dashboardDataService.ts:50:5
 export async function getCurrentUserBalance(userId: string) {
   const userFull = await findUserWithBalance(userId);
   return calculateVacationBalance(
-    userFull?.hireDate ?? null,
+    userFull.hireDate ?? null,
     (userFull?.vacationRequests ?? []) as Array<{ startDate: Date; endDate: Date; status: string }>
   );
killedBy: getCurrentUserBalance handles null user (no hireDate)
statusReason: Cannot read properties of null (reading 'hireDate')

[Killed] LogicalOperator
services/dashboardDataService.ts:50:5
 export async function getCurrentUserBalance(userId: string) {
   const userFull = await findUserWithBalance(userId);
   return calculateVacationBalance(
-    userFull?.hireDate ?? null,
+    userFull?.hireDate && null,
     (userFull?.vacationRequests ?? []) as Array<{ startDate: Date; endDate: Date; status: string }>
   );
killedBy: getCurrentUserBalance returns balance from findUserWithBalance
statusReason: expected +0 to be 15 // Object.is equality

[Killed] BlockStatement
services/dashboardDataService.ts:65:28
   role: string,
   userId: string,
   managedRequests: RequestWithVisibility[]
-): RequestWithVisibility[] {
-  return managedRequests.filter((r) =>
-    hasTeamVisibility(role, userId, r as Parameters<typeof hasTeamVisibility>[2])
-  );
-}
+): RequestWithVisibility[] {}
 
 export function getPendingCount(
killedBy: getVisibleRequests RH sees all requests
statusReason: Target cannot be null or undefined.

[Killed] MethodExpression
services/dashboardDataService.ts:66:10
   userId: string,
   managedRequests: RequestWithVisibility[]
 ): RequestWithVisibility[] {
-  return managedRequests.filter((r) =>
-    hasTeamVisibility(role, userId, r as Parameters<typeof hasTeamVisibility>[2])
-  );
+  return managedRequests;
 }
 
killedBy: getVisibleRequests Coordenador sees only direct reports
statusReason: expected [ { userId: 'f1', …(2) }, …(1) ] to have a length of 1 but got 2

[Killed] ArrowFunction
services/dashboardDataService.ts:66:33
   userId: string,
   managedRequests: RequestWithVisibility[]
 ): RequestWithVisibility[] {
-  return managedRequests.filter((r) =>
-    hasTeamVisibility(role, userId, r as Parameters<typeof hasTeamVisibility>[2])
+  return managedRequests.filter(() => undefined
   );
 }
killedBy: getVisibleRequests RH sees all requests
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
services/dashboardDataService.ts:74:3
 export function getPendingCount(
   userRoleLevel: number,
   visibleRequests: RequestWithVisibility[]
-) {
-  return visibleRequests.filter((r) => {
-    if (userRoleLevel === 2) return r.status === "PENDENTE";
-    if (userRoleLevel === 3)
-      return ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status);
-    if (userRoleLevel === 4) return r.status === "APROVADO_GERENTE";
-    return false;
-  }).length;
-}
+) {}
 
 export async function getCurrentUserDepartment(userId: string): Promise<string | null> {
killedBy: getPendingCount level 2: counts only PENDENTE
statusReason: expected undefined to be 2 // Object.is equality

[Killed] MethodExpression
services/dashboardDataService.ts:75:10
   userRoleLevel: number,
   visibleRequests: RequestWithVisibility[]
 ) {
-  return visibleRequests.filter((r) => {
-    if (userRoleLevel === 2) return r.status === "PENDENTE";
-    if (userRoleLevel === 3)
-      return ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status);
-    if (userRoleLevel === 4) return r.status === "APROVADO_GERENTE";
-    return false;
-  }).length;
+  return visibleRequests.length;
 }
 
killedBy: getPendingCount level 2: counts only PENDENTE
statusReason: expected 3 to be 2 // Object.is equality

[Killed] BlockStatement
services/dashboardDataService.ts:75:40
   userRoleLevel: number,
   visibleRequests: RequestWithVisibility[]
 ) {
-  return visibleRequests.filter((r) => {
-    if (userRoleLevel === 2) return r.status === "PENDENTE";
-    if (userRoleLevel === 3)
-      return ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status);
-    if (userRoleLevel === 4) return r.status === "APROVADO_GERENTE";
-    return false;
-  }).length;
+  return visibleRequests.filter((r) => {}).length;
 }
 
killedBy: getPendingCount level 2: counts only PENDENTE
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
services/dashboardDataService.ts:76:37
   visibleRequests: RequestWithVisibility[]
 ) {
   return visibleRequests.filter((r) => {
-    if (userRoleLevel === 2) return r.status === "PENDENTE";
+    if (userRoleLevel === 2) return r.status !== "PENDENTE";
     if (userRoleLevel === 3)
       return ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status);
killedBy: getPendingCount level 2: counts only PENDENTE
statusReason: expected 1 to be 2 // Object.is equality

[Killed] EqualityOperator
services/dashboardDataService.ts:76:9
   visibleRequests: RequestWithVisibility[]
 ) {
   return visibleRequests.filter((r) => {
-    if (userRoleLevel === 2) return r.status === "PENDENTE";
+    if (userRoleLevel !== 2) return r.status === "PENDENTE";
     if (userRoleLevel === 3)
       return ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status);
killedBy: getPendingCount level 2: counts only PENDENTE
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
services/dashboardDataService.ts:77:9
 ) {
   return visibleRequests.filter((r) => {
     if (userRoleLevel === 2) return r.status === "PENDENTE";
-    if (userRoleLevel === 3)
+    if (true)
       return ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status);
     if (userRoleLevel === 4) return r.status === "APROVADO_GERENTE";
killedBy: getPendingCount level 4: counts only APROVADO_GERENTE
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
services/dashboardDataService.ts:77:9
 ) {
   return visibleRequests.filter((r) => {
     if (userRoleLevel === 2) return r.status === "PENDENTE";
-    if (userRoleLevel === 3)
+    if (false)
       return ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status);
     if (userRoleLevel === 4) return r.status === "APROVADO_GERENTE";
killedBy: getPendingCount level 3: counts PENDENTE and APROVADO_COORDENADOR/APROVADO_GESTOR
statusReason: expected +0 to be 2 // Object.is equality

[Killed] StringLiteral
services/dashboardDataService.ts:78:27
   return visibleRequests.filter((r) => {
     if (userRoleLevel === 2) return r.status === "PENDENTE";
     if (userRoleLevel === 3)
-      return ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status);
+      return ["PENDENTE", "", "APROVADO_GESTOR"].includes(r.status);
     if (userRoleLevel === 4) return r.status === "APROVADO_GERENTE";
     return false;
killedBy: getPendingCount level 3: counts PENDENTE and APROVADO_COORDENADOR/APROVADO_GESTOR
statusReason: expected 1 to be 2 // Object.is equality

[Killed] EqualityOperator
services/dashboardDataService.ts:79:9
     if (userRoleLevel === 2) return r.status === "PENDENTE";
     if (userRoleLevel === 3)
       return ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status);
-    if (userRoleLevel === 4) return r.status === "APROVADO_GERENTE";
+    if (userRoleLevel !== 4) return r.status === "APROVADO_GERENTE";
     return false;
   }).length;
killedBy: getPendingCount level 4: counts only APROVADO_GERENTE
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
services/dashboardDataService.ts:79:37
     if (userRoleLevel === 2) return r.status === "PENDENTE";
     if (userRoleLevel === 3)
       return ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status);
-    if (userRoleLevel === 4) return r.status === "APROVADO_GERENTE";
+    if (userRoleLevel === 4) return true;
     return false;
   }).length;
killedBy: getPendingCount level 4: counts only APROVADO_GERENTE
statusReason: expected 3 to be 2 // Object.is equality

[Killed] BooleanLiteral
services/dashboardDataService.ts:80:12
     if (userRoleLevel === 3)
       return ["PENDENTE", "APROVADO_COORDENADOR", "APROVADO_GESTOR"].includes(r.status);
     if (userRoleLevel === 4) return r.status === "APROVADO_GERENTE";
-    return false;
+    return true;
   }).length;
 }
killedBy: getPendingCount other level: returns 0
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
services/dashboardDataService.ts:84:88
   }).length;
 }
 
-export async function getCurrentUserDepartment(userId: string): Promise<string | null> {
-  return findUserDepartment(userId);
-}
+export async function getCurrentUserDepartment(userId: string): Promise<string | null> {}
 
killedBy: getCurrentUserDepartment returns department from repository
statusReason: expected undefined to be 'TI' // Object.is equality
