[Timeout] BlockStatement
services/teamMembersService.ts:7:12
 
 function isOnVacationNow(
   requests: Array<{ status: string; startDate: Date; endDate: Date; abono?: boolean }>
-): boolean {
-  const today = new Date();
-  today.setHours(0, 0, 0, 0);
-  return requests.some((r) => {
-    if (r.status !== "APROVADO_RH") return false;
-    const start = new Date(r.startDate);
-    const rawEnd = new Date(r.endDate);
-    const end =
-      r.abono && !Number.isNaN(rawEnd.getTime())
-        ? new Date(rawEnd.getTime() - 10 * 24 * 60 * 60 * 1000)
-        : rawEnd;
-    start.setHours(0, 0, 0, 0);
-    end.setHours(0, 0, 0, 0);
-    return today >= start && today <= end;
-  });
-}
+): boolean {}
 

[Timeout] BlockStatement
services/teamMembersService.ts:10:31
 ): boolean {
   const today = new Date();
   today.setHours(0, 0, 0, 0);
-  return requests.some((r) => {
-    if (r.status !== "APROVADO_RH") return false;
-    const start = new Date(r.startDate);
-    const rawEnd = new Date(r.endDate);
-    const end =
-      r.abono && !Number.isNaN(rawEnd.getTime())
-        ? new Date(rawEnd.getTime() - 10 * 24 * 60 * 60 * 1000)
-        : rawEnd;
-    start.setHours(0, 0, 0, 0);
-    end.setHours(0, 0, 0, 0);
-    return today >= start && today <= end;
-  });
+  return requests.some((r) => {});
 }
 

[Timeout] MethodExpression
services/teamMembersService.ts:10:10
 ): boolean {
   const today = new Date();
   today.setHours(0, 0, 0, 0);
-  return requests.some((r) => {
-    if (r.status !== "APROVADO_RH") return false;
-    const start = new Date(r.startDate);
-    const rawEnd = new Date(r.endDate);
-    const end =
-      r.abono && !Number.isNaN(rawEnd.getTime())
-        ? new Date(rawEnd.getTime() - 10 * 24 * 60 * 60 * 1000)
-        : rawEnd;
-    start.setHours(0, 0, 0, 0);
-    end.setHours(0, 0, 0, 0);
-    return today >= start && today <= end;
-  });
+  return requests.every(r => {
+  if (r.status !== "APROVADO_RH") return false;
+  const start = new Date(r.startDate);
+  const rawEnd = new Date(r.endDate);
+  const end = r.abono && !Number.isNaN(rawEnd.getTime()) ? new Date(rawEnd.getTime() - 10 * 24 * 60 * 60 * 1000) : rawEnd;
+  start.setHours(0, 0, 0, 0);
+  end.setHours(0, 0, 0, 0);
+  return today >= start && today <= end;
+});
 }
 

[Timeout] BooleanLiteral
services/teamMembersService.ts:11:44
   const today = new Date();
   today.setHours(0, 0, 0, 0);
   return requests.some((r) => {
-    if (r.status !== "APROVADO_RH") return false;
+    if (r.status !== "APROVADO_RH") return true;
     const start = new Date(r.startDate);
     const rawEnd = new Date(r.endDate);

[Timeout] EqualityOperator
services/teamMembersService.ts:11:9
   const today = new Date();
   today.setHours(0, 0, 0, 0);
   return requests.some((r) => {
-    if (r.status !== "APROVADO_RH") return false;
+    if (r.status === "APROVADO_RH") return false;
     const start = new Date(r.startDate);
     const rawEnd = new Date(r.endDate);

[Timeout] BooleanLiteral
services/teamMembersService.ts:15:18
     const start = new Date(r.startDate);
     const rawEnd = new Date(r.endDate);
     const end =
-      r.abono && !Number.isNaN(rawEnd.getTime())
+      r.abono && Number.isNaN(rawEnd.getTime())
         ? new Date(rawEnd.getTime() - 10 * 24 * 60 * 60 * 1000)
         : rawEnd;

[Timeout] ConditionalExpression
services/teamMembersService.ts:15:7
     const start = new Date(r.startDate);
     const rawEnd = new Date(r.endDate);
     const end =
-      r.abono && !Number.isNaN(rawEnd.getTime())
+      false
         ? new Date(rawEnd.getTime() - 10 * 24 * 60 * 60 * 1000)
         : rawEnd;

[Timeout] ArithmeticOperator
services/teamMembersService.ts:16:39
     const rawEnd = new Date(r.endDate);
     const end =
       r.abono && !Number.isNaN(rawEnd.getTime())
-        ? new Date(rawEnd.getTime() - 10 * 24 * 60 * 60 * 1000)
+        ? new Date(rawEnd.getTime() - 10 * 24 * 60 / 60 * 1000)
         : rawEnd;
     start.setHours(0, 0, 0, 0);

[Timeout] ArithmeticOperator
services/teamMembersService.ts:16:39
     const rawEnd = new Date(r.endDate);
     const end =
       r.abono && !Number.isNaN(rawEnd.getTime())
-        ? new Date(rawEnd.getTime() - 10 * 24 * 60 * 60 * 1000)
+        ? new Date(rawEnd.getTime() - 10 * 24 * 60 * 60 / 1000)
         : rawEnd;
     start.setHours(0, 0, 0, 0);

[Timeout] MethodExpression
services/teamMembersService.ts:18:5
       r.abono && !Number.isNaN(rawEnd.getTime())
         ? new Date(rawEnd.getTime() - 10 * 24 * 60 * 60 * 1000)
         : rawEnd;
-    start.setHours(0, 0, 0, 0);
+    start.setMinutes(0, 0, 0, 0);
     end.setHours(0, 0, 0, 0);
     return today >= start && today <= end;

[Timeout] MethodExpression
services/teamMembersService.ts:19:5
         ? new Date(rawEnd.getTime() - 10 * 24 * 60 * 60 * 1000)
         : rawEnd;
     start.setHours(0, 0, 0, 0);
-    end.setHours(0, 0, 0, 0);
+    end.setMinutes(0, 0, 0, 0);
     return today >= start && today <= end;
   });

[Timeout] EqualityOperator
services/teamMembersService.ts:20:30
         : rawEnd;
     start.setHours(0, 0, 0, 0);
     end.setHours(0, 0, 0, 0);
-    return today >= start && today <= end;
+    return today >= start && today < end;
   });
 }

[Timeout] EqualityOperator
services/teamMembersService.ts:20:12
         : rawEnd;
     start.setHours(0, 0, 0, 0);
     end.setHours(0, 0, 0, 0);
-    return today >= start && today <= end;
+    return today > start && today <= end;
   });
 }

[Timeout] ArrowFunction
services/teamMembersService.ts:25:20
 }
 
-  return users.map((u) => ({
-    user: {
-      id: u.id,
-      name: u.name,
-      department: u.department,
-      hireDate: u.hireDate,
-      role: u.role,
-    },
-    balance: calculateVacationBalance(u.hireDate ?? null, u.vacationRequests ?? []),
-    isOnVacationNow: isOnVacationNow(u.vacationRequests ?? []),
-    requests: u.vacationRequests ?? [],
-  }));
+  return users.map(() => undefined);
 }
 

[Timeout] ObjectLiteral
services/teamMembersService.ts:26:11
 
   return users.map((u) => ({
-    user: {
-      id: u.id,
-      name: u.name,
-      department: u.department,
-      hireDate: u.hireDate,
-      role: u.role,
-    },
+    user: {},
     balance: calculateVacationBalance(u.hireDate ?? null, u.vacationRequests ?? []),
     isOnVacationNow: isOnVacationNow(u.vacationRequests ?? []),

[Timeout] LogicalOperator
services/teamMembersService.ts:33:39
       hireDate: u.hireDate,
       role: u.role,
     },
-    balance: calculateVacationBalance(u.hireDate ?? null, u.vacationRequests ?? []),
+    balance: calculateVacationBalance(u.hireDate && null, u.vacationRequests ?? []),
     isOnVacationNow: isOnVacationNow(u.vacationRequests ?? []),
     requests: u.vacationRequests ?? [],

[Timeout] LogicalOperator
services/teamMembersService.ts:33:59
       hireDate: u.hireDate,
       role: u.role,
     },
-    balance: calculateVacationBalance(u.hireDate ?? null, u.vacationRequests ?? []),
+    balance: calculateVacationBalance(u.hireDate ?? null, u.vacationRequests && []),
     isOnVacationNow: isOnVacationNow(u.vacationRequests ?? []),
     requests: u.vacationRequests ?? [],

[Timeout] LogicalOperator
services/teamMembersService.ts:34:38
       role: u.role,
     },
     balance: calculateVacationBalance(u.hireDate ?? null, u.vacationRequests ?? []),
-    isOnVacationNow: isOnVacationNow(u.vacationRequests ?? []),
+    isOnVacationNow: isOnVacationNow(u.vacationRequests && []),
     requests: u.vacationRequests ?? [],
   }));

[Timeout] ArrayDeclaration
services/teamMembersService.ts:34:60
       role: u.role,
     },
     balance: calculateVacationBalance(u.hireDate ?? null, u.vacationRequests ?? []),
-    isOnVacationNow: isOnVacationNow(u.vacationRequests ?? []),
+    isOnVacationNow: isOnVacationNow(u.vacationRequests ?? ["Stryker was here"]),
     requests: u.vacationRequests ?? [],
   }));

[Timeout] LogicalOperator
services/teamMembersService.ts:35:15
     },
     balance: calculateVacationBalance(u.hireDate ?? null, u.vacationRequests ?? []),
     isOnVacationNow: isOnVacationNow(u.vacationRequests ?? []),
-    requests: u.vacationRequests ?? [],
+    requests: u.vacationRequests && [],
   }));
 }

[Timeout] BlockStatement
services/teamMembersService.ts:45:20
 ): Promise<TeamDataCoord | TeamDataRH> {
   const level = getRoleLevel(role);
 
-  if (level === 2) {
-    const users = await findTeamMembersByManager(userId);
-    const members = mapUsersToMembers(users);
-    return {
-      kind: "coord",
-      teams: [{ coordinatorId: userId, coordinatorName: "Meu time", members }],
-    };
-  }
+  if (level === 2) {}
 
   if (level === 3) {

[Timeout] ObjectLiteral
services/teamMembersService.ts:48:12
   if (level === 2) {
     const users = await findTeamMembersByManager(userId);
     const members = mapUsersToMembers(users);
-    return {
-      kind: "coord",
-      teams: [{ coordinatorId: userId, coordinatorName: "Meu time", members }],
-    };
+    return {};
   }
 

[Timeout] StringLiteral
services/teamMembersService.ts:50:57
     const members = mapUsersToMembers(users);
     return {
       kind: "coord",
-      teams: [{ coordinatorId: userId, coordinatorName: "Meu time", members }],
+      teams: [{ coordinatorId: userId, coordinatorName: "", members }],
     };
   }

[Timeout] ObjectLiteral
services/teamMembersService.ts:50:15
     const members = mapUsersToMembers(users);
     return {
       kind: "coord",
-      teams: [{ coordinatorId: userId, coordinatorName: "Meu time", members }],
+      teams: [{}],
     };
   }

[Timeout] ConditionalExpression
services/teamMembersService.ts:54:7
     };
   }
 
-  if (level === 3) {
+  if (false) {
     const users = await findTeamMembersByGerente(userId);
     const members = mapUsersToMembers(users);

[Timeout] BlockStatement
services/teamMembersService.ts:54:20
     };
   }
 
-  if (level === 3) {
-    const users = await findTeamMembersByGerente(userId);
-    const members = mapUsersToMembers(users);
-    const byCoord: Record<string, TeamMemberInfo[]> = {};
-    members.forEach((m, i) => {
-      const u = users[i];
-      const coordId = u?.managerId ?? "sem-coord";
-      if (!byCoord[coordId]) byCoord[coordId] = [];
-      byCoord[coordId].push(m);
-    });
-    const coordNames = new Map<string, string>();
-    users.forEach((u) => {
-      if (u.managerId && u.manager) coordNames.set(u.managerId, u.manager.name);
-    });
-    const teams = Object.entries(byCoord).map(([coordId, mems]) => ({
-      coordinatorId: coordId,
-      coordinatorName: coordNames.get(coordId) ?? "Sem coordenador",
-      members: mems.sort((a, b) => a.user.name.localeCompare(b.user.name)),
-    }));
-    return { kind: "coord", teams };
-  }
+  if (level === 3) {}
 
   const users = await findAllEmployees();

[Timeout] BlockStatement
services/teamMembersService.ts:58:31
     const users = await findTeamMembersByGerente(userId);
     const members = mapUsersToMembers(users);
     const byCoord: Record<string, TeamMemberInfo[]> = {};
-    members.forEach((m, i) => {
-      const u = users[i];
-      const coordId = u?.managerId ?? "sem-coord";
-      if (!byCoord[coordId]) byCoord[coordId] = [];
-      byCoord[coordId].push(m);
-    });
+    members.forEach((m, i) => {});
     const coordNames = new Map<string, string>();
     users.forEach((u) => {

[Timeout] LogicalOperator
services/teamMembersService.ts:60:23
     const byCoord: Record<string, TeamMemberInfo[]> = {};
     members.forEach((m, i) => {
       const u = users[i];
-      const coordId = u?.managerId ?? "sem-coord";
+      const coordId = u?.managerId && "sem-coord";
       if (!byCoord[coordId]) byCoord[coordId] = [];
       byCoord[coordId].push(m);

[Timeout] OptionalChaining
services/teamMembersService.ts:60:23
     const byCoord: Record<string, TeamMemberInfo[]> = {};
     members.forEach((m, i) => {
       const u = users[i];
-      const coordId = u?.managerId ?? "sem-coord";
+      const coordId = u.managerId ?? "sem-coord";
       if (!byCoord[coordId]) byCoord[coordId] = [];
       byCoord[coordId].push(m);

[Timeout] ConditionalExpression
services/teamMembersService.ts:61:11
     members.forEach((m, i) => {
       const u = users[i];
       const coordId = u?.managerId ?? "sem-coord";
-      if (!byCoord[coordId]) byCoord[coordId] = [];
+      if (false) byCoord[coordId] = [];
       byCoord[coordId].push(m);
     });

[Timeout] ConditionalExpression
services/teamMembersService.ts:61:11
     members.forEach((m, i) => {
       const u = users[i];
       const coordId = u?.managerId ?? "sem-coord";
-      if (!byCoord[coordId]) byCoord[coordId] = [];
+      if (true) byCoord[coordId] = [];
       byCoord[coordId].push(m);
     });

[Timeout] BlockStatement
services/teamMembersService.ts:65:26
       byCoord[coordId].push(m);
     });
     const coordNames = new Map<string, string>();
-    users.forEach((u) => {
-      if (u.managerId && u.manager) coordNames.set(u.managerId, u.manager.name);
-    });
+    users.forEach((u) => {});
     const teams = Object.entries(byCoord).map(([coordId, mems]) => ({
       coordinatorId: coordId,

[Timeout] ConditionalExpression
services/teamMembersService.ts:66:11
     });
     const coordNames = new Map<string, string>();
     users.forEach((u) => {
-      if (u.managerId && u.manager) coordNames.set(u.managerId, u.manager.name);
+      if (false) coordNames.set(u.managerId, u.manager.name);
     });
     const teams = Object.entries(byCoord).map(([coordId, mems]) => ({

[Timeout] ConditionalExpression
services/teamMembersService.ts:66:11
     });
     const coordNames = new Map<string, string>();
     users.forEach((u) => {
-      if (u.managerId && u.manager) coordNames.set(u.managerId, u.manager.name);
+      if (true) coordNames.set(u.managerId, u.manager.name);
     });
     const teams = Object.entries(byCoord).map(([coordId, mems]) => ({

[Timeout] ArrowFunction
services/teamMembersService.ts:68:47
     users.forEach((u) => {
       if (u.managerId && u.manager) coordNames.set(u.managerId, u.manager.name);
     });
-    const teams = Object.entries(byCoord).map(([coordId, mems]) => ({
-      coordinatorId: coordId,
-      coordinatorName: coordNames.get(coordId) ?? "Sem coordenador",
-      members: mems.sort((a, b) => a.user.name.localeCompare(b.user.name)),
-    }));
+    const teams = Object.entries(byCoord).map(() => undefined);
     return { kind: "coord", teams };
   }

[Timeout] LogicalOperator
services/teamMembersService.ts:70:24
     });
     const teams = Object.entries(byCoord).map(([coordId, mems]) => ({
       coordinatorId: coordId,
-      coordinatorName: coordNames.get(coordId) ?? "Sem coordenador",
+      coordinatorName: coordNames.get(coordId) && "Sem coordenador",
       members: mems.sort((a, b) => a.user.name.localeCompare(b.user.name)),
     }));

[Timeout] ArrowFunction
services/teamMembersService.ts:71:26
     const teams = Object.entries(byCoord).map(([coordId, mems]) => ({
       coordinatorId: coordId,
       coordinatorName: coordNames.get(coordId) ?? "Sem coordenador",
-      members: mems.sort((a, b) => a.user.name.localeCompare(b.user.name)),
+      members: mems.sort(() => undefined),
     }));
     return { kind: "coord", teams };

[Timeout] MethodExpression
services/teamMembersService.ts:71:16
     const teams = Object.entries(byCoord).map(([coordId, mems]) => ({
       coordinatorId: coordId,
       coordinatorName: coordNames.get(coordId) ?? "Sem coordenador",
-      members: mems.sort((a, b) => a.user.name.localeCompare(b.user.name)),
+      members: mems,
     }));
     return { kind: "coord", teams };

[Timeout] ObjectLiteral
services/teamMembersService.ts:73:12
       coordinatorName: coordNames.get(coordId) ?? "Sem coordenador",
       members: mems.sort((a, b) => a.user.name.localeCompare(b.user.name)),
     }));
-    return { kind: "coord", teams };
+    return {};
   }
 

[Timeout] BlockStatement
services/teamMembersService.ts:79:27
   const users = await findAllEmployees();
   const members = mapUsersToMembers(users);
   const byGerente = new Map<string, Map<string, TeamMemberInfo[]>>();
-  users.forEach((u, i) => {
-    const m = members[i];
-    const gerenteId = (u as { manager?: { manager?: { id: string; name: string } } }).manager?.manager?.id ?? "sem-gerente";
-    const coordId = (u as { manager?: { id: string; name: string } }).manager?.id ?? "sem-coord";
-    if (!byGerente.has(gerenteId)) byGerente.set(gerenteId, new Map());
-    const byCoord = byGerente.get(gerenteId)!;
-    if (!byCoord.has(coordId)) byCoord.set(coordId, []);
-    byCoord.get(coordId)!.push(m);
-  });
+  users.forEach((u, i) => {});
   const gerentes: TeamDataRH["gerentes"] = [];
   byGerente.forEach((byCoord, gerenteId) => {

[Timeout] OptionalChaining
services/teamMembersService.ts:81:23
   const byGerente = new Map<string, Map<string, TeamMemberInfo[]>>();
   users.forEach((u, i) => {
     const m = members[i];
-    const gerenteId = (u as { manager?: { manager?: { id: string; name: string } } }).manager?.manager?.id ?? "sem-gerente";
+    const gerenteId = (u as {
+  manager?: {
+    manager?: {
+      id: string;
+      name: string;
+    };
+  };
+}).manager.manager?.id ?? "sem-gerente";
     const coordId = (u as { manager?: { id: string; name: string } }).manager?.id ?? "sem-coord";
     if (!byGerente.has(gerenteId)) byGerente.set(gerenteId, new Map());

[Timeout] LogicalOperator
services/teamMembersService.ts:81:23
   const byGerente = new Map<string, Map<string, TeamMemberInfo[]>>();
   users.forEach((u, i) => {
     const m = members[i];
-    const gerenteId = (u as { manager?: { manager?: { id: string; name: string } } }).manager?.manager?.id ?? "sem-gerente";
+    const gerenteId = (u as {
+  manager?: {
+    manager?: {
+      id: string;
+      name: string;
+    };
+  };
+}).manager?.manager?.id && "sem-gerente";
     const coordId = (u as { manager?: { id: string; name: string } }).manager?.id ?? "sem-coord";
     if (!byGerente.has(gerenteId)) byGerente.set(gerenteId, new Map());

[Timeout] OptionalChaining
services/teamMembersService.ts:82:21
   users.forEach((u, i) => {
     const m = members[i];
     const gerenteId = (u as { manager?: { manager?: { id: string; name: string } } }).manager?.manager?.id ?? "sem-gerente";
-    const coordId = (u as { manager?: { id: string; name: string } }).manager?.id ?? "sem-coord";
+    const coordId = (u as {
+  manager?: {
+    id: string;
+    name: string;
+  };
+}).manager.id ?? "sem-coord";
     if (!byGerente.has(gerenteId)) byGerente.set(gerenteId, new Map());
     const byCoord = byGerente.get(gerenteId)!;

[Timeout] LogicalOperator
services/teamMembersService.ts:82:21
   users.forEach((u, i) => {
     const m = members[i];
     const gerenteId = (u as { manager?: { manager?: { id: string; name: string } } }).manager?.manager?.id ?? "sem-gerente";
-    const coordId = (u as { manager?: { id: string; name: string } }).manager?.id ?? "sem-coord";
+    const coordId = (u as {
+  manager?: {
+    id: string;
+    name: string;
+  };
+}).manager?.id && "sem-coord";
     if (!byGerente.has(gerenteId)) byGerente.set(gerenteId, new Map());
     const byCoord = byGerente.get(gerenteId)!;

[Timeout] ConditionalExpression
services/teamMembersService.ts:83:9
     const m = members[i];
     const gerenteId = (u as { manager?: { manager?: { id: string; name: string } } }).manager?.manager?.id ?? "sem-gerente";
     const coordId = (u as { manager?: { id: string; name: string } }).manager?.id ?? "sem-coord";
-    if (!byGerente.has(gerenteId)) byGerente.set(gerenteId, new Map());
+    if (true) byGerente.set(gerenteId, new Map());
     const byCoord = byGerente.get(gerenteId)!;
     if (!byCoord.has(coordId)) byCoord.set(coordId, []);

[Timeout] BooleanLiteral
services/teamMembersService.ts:83:9
     const m = members[i];
     const gerenteId = (u as { manager?: { manager?: { id: string; name: string } } }).manager?.manager?.id ?? "sem-gerente";
     const coordId = (u as { manager?: { id: string; name: string } }).manager?.id ?? "sem-coord";
-    if (!byGerente.has(gerenteId)) byGerente.set(gerenteId, new Map());
+    if (byGerente.has(gerenteId)) byGerente.set(gerenteId, new Map());
     const byCoord = byGerente.get(gerenteId)!;
     if (!byCoord.has(coordId)) byCoord.set(coordId, []);

[Timeout] ConditionalExpression
services/teamMembersService.ts:85:9
     const coordId = (u as { manager?: { id: string; name: string } }).manager?.id ?? "sem-coord";
     if (!byGerente.has(gerenteId)) byGerente.set(gerenteId, new Map());
     const byCoord = byGerente.get(gerenteId)!;
-    if (!byCoord.has(coordId)) byCoord.set(coordId, []);
+    if (true) byCoord.set(coordId, []);
     byCoord.get(coordId)!.push(m);
   });

[Timeout] ConditionalExpression
services/teamMembersService.ts:85:9
     const coordId = (u as { manager?: { id: string; name: string } }).manager?.id ?? "sem-coord";
     if (!byGerente.has(gerenteId)) byGerente.set(gerenteId, new Map());
     const byCoord = byGerente.get(gerenteId)!;
-    if (!byCoord.has(coordId)) byCoord.set(coordId, []);
+    if (false) byCoord.set(coordId, []);
     byCoord.get(coordId)!.push(m);
   });

[Timeout] BlockStatement
services/teamMembersService.ts:89:45
     byCoord.get(coordId)!.push(m);
   });
   const gerentes: TeamDataRH["gerentes"] = [];
-  byGerente.forEach((byCoord, gerenteId) => {
-    const firstUser = users.find(
-      (u) => ((u as { manager?: { manager?: { id: string } } }).manager?.manager?.id ?? "sem-gerente") === gerenteId
-    ) as { manager?: { manager?: { name: string }; name: string } } | undefined;
-    const gerenteName = firstUser?.manager?.manager?.name ?? "Sem gerente";
-    const teams = Array.from(byCoord.entries()).map(([coordId, mems]) => {
-      const firstInCoord = mems[0];
-      const u = users.find((x) => x.id === firstInCoord.user.id) as { manager?: { name: string } } | undefined;
-      return {
-        coordinatorId: coordId,
-        coordinatorName: u?.manager?.name ?? "Sem coordenador",
-        members: mems.sort((a, b) => a.user.name.localeCompare(b.user.name)),
-      };
-    });
-    gerentes.push({ gerenteId, gerenteName, teams });
-  });
+  byGerente.forEach((byCoord, gerenteId) => {});
   gerentes.sort((a, b) => a.gerenteName.localeCompare(b.gerenteName));
   return { kind: "rh", gerentes };

[Timeout] OptionalChaining
services/teamMembersService.ts:93:25
     const firstUser = users.find(
       (u) => ((u as { manager?: { manager?: { id: string } } }).manager?.manager?.id ?? "sem-gerente") === gerenteId
     ) as { manager?: { manager?: { name: string }; name: string } } | undefined;
-    const gerenteName = firstUser?.manager?.manager?.name ?? "Sem gerente";
+    const gerenteName = firstUser?.manager.manager?.name ?? "Sem gerente";
     const teams = Array.from(byCoord.entries()).map(([coordId, mems]) => {
       const firstInCoord = mems[0];

[Timeout] OptionalChaining
services/teamMembersService.ts:93:25
     const firstUser = users.find(
       (u) => ((u as { manager?: { manager?: { id: string } } }).manager?.manager?.id ?? "sem-gerente") === gerenteId
     ) as { manager?: { manager?: { name: string }; name: string } } | undefined;
-    const gerenteName = firstUser?.manager?.manager?.name ?? "Sem gerente";
+    const gerenteName = firstUser?.manager?.manager.name ?? "Sem gerente";
     const teams = Array.from(byCoord.entries()).map(([coordId, mems]) => {
       const firstInCoord = mems[0];

[Timeout] BlockStatement
services/teamMembersService.ts:94:74
       (u) => ((u as { manager?: { manager?: { id: string } } }).manager?.manager?.id ?? "sem-gerente") === gerenteId
     ) as { manager?: { manager?: { name: string }; name: string } } | undefined;
     const gerenteName = firstUser?.manager?.manager?.name ?? "Sem gerente";
-    const teams = Array.from(byCoord.entries()).map(([coordId, mems]) => {
-      const firstInCoord = mems[0];
-      const u = users.find((x) => x.id === firstInCoord.user.id) as { manager?: { name: string } } | undefined;
-      return {
-        coordinatorId: coordId,
-        coordinatorName: u?.manager?.name ?? "Sem coordenador",
-        members: mems.sort((a, b) => a.user.name.localeCompare(b.user.name)),
-      };
-    });
+    const teams = Array.from(byCoord.entries()).map(([coordId, mems]) => {});
     gerentes.push({ gerenteId, gerenteName, teams });
   });

[Timeout] LogicalOperator
services/teamMembersService.ts:99:26
       const u = users.find((x) => x.id === firstInCoord.user.id) as { manager?: { name: string } } | undefined;
       return {
         coordinatorId: coordId,
-        coordinatorName: u?.manager?.name ?? "Sem coordenador",
+        coordinatorName: u?.manager?.name && "Sem coordenador",
         members: mems.sort((a, b) => a.user.name.localeCompare(b.user.name)),
       };

[Timeout] OptionalChaining
services/teamMembersService.ts:99:26
       const u = users.find((x) => x.id === firstInCoord.user.id) as { manager?: { name: string } } | undefined;
       return {
         coordinatorId: coordId,
-        coordinatorName: u?.manager?.name ?? "Sem coordenador",
+        coordinatorName: u?.manager.name ?? "Sem coordenador",
         members: mems.sort((a, b) => a.user.name.localeCompare(b.user.name)),
       };

[Timeout] MethodExpression
services/teamMembersService.ts:100:18
       return {
         coordinatorId: coordId,
         coordinatorName: u?.manager?.name ?? "Sem coordenador",
-        members: mems.sort((a, b) => a.user.name.localeCompare(b.user.name)),
+        members: mems,
       };
     });

[Timeout] ArrowFunction
services/teamMembersService.ts:100:28
       return {
         coordinatorId: coordId,
         coordinatorName: u?.manager?.name ?? "Sem coordenador",
-        members: mems.sort((a, b) => a.user.name.localeCompare(b.user.name)),
+        members: mems.sort(() => undefined),
       };
     });

[Timeout] ArrowFunction
services/teamMembersService.ts:105:17
     });
     gerentes.push({ gerenteId, gerenteName, teams });
   });
-  gerentes.sort((a, b) => a.gerenteName.localeCompare(b.gerenteName));
+  gerentes.sort(() => undefined);
   return { kind: "rh", gerentes };
 }

[Timeout] MethodExpression
services/teamMembersService.ts:105:3
     });
     gerentes.push({ gerenteId, gerenteName, teams });
   });
-  gerentes.sort((a, b) => a.gerenteName.localeCompare(b.gerenteName));
+  gerentes;
   return { kind: "rh", gerentes };
 }
