[Timeout] LogicalOperator
services/vacationRequestListService.ts:58:23
   filters: DashboardFilters,
 ): Promise<VacationRequestForExport[]> {
   const { query, status, view, managerId, from, to, department } = filters;
-  const statusParam = status ?? "TODOS";
+  const statusParam = status && "TODOS";
   const q = (query ?? "").trim();
   const departmentParam = department ?? "";

[Timeout] MethodExpression
services/vacationRequestListService.ts:59:13
 ): Promise<VacationRequestForExport[]> {
   const { query, status, view, managerId, from, to, department } = filters;
   const statusParam = status ?? "TODOS";
-  const q = (query ?? "").trim();
+  const q = query ?? "";
   const departmentParam = department ?? "";
 

[Timeout] LogicalOperator
services/vacationRequestListService.ts:59:14
 ): Promise<VacationRequestForExport[]> {
   const { query, status, view, managerId, from, to, department } = filters;
   const statusParam = status ?? "TODOS";
-  const q = (query ?? "").trim();
+  const q = (query && "").trim();
   const departmentParam = department ?? "";
 

[Timeout] LogicalOperator
services/vacationRequestListService.ts:60:27
   const { query, status, view, managerId, from, to, department } = filters;
   const statusParam = status ?? "TODOS";
   const q = (query ?? "").trim();
-  const departmentParam = department ?? "";
+  const departmentParam = department && "";
 
   let where: Record<string, unknown>;

[Timeout] EqualityOperator
services/vacationRequestListService.ts:63:7
   const departmentParam = department ?? "";
 
   let where: Record<string, unknown>;
-  if (user.role === "COLABORADOR" || user.role === "FUNCIONARIO") {
+  if (user.role !== "COLABORADOR" || user.role === "FUNCIONARIO") {
     where = { userId: user.id };
     if (statusParam !== "TODOS") where.status = statusParam;

[Timeout] ConditionalExpression
services/vacationRequestListService.ts:63:7
   const departmentParam = department ?? "";
 
   let where: Record<string, unknown>;
-  if (user.role === "COLABORADOR" || user.role === "FUNCIONARIO") {
+  if (true) {
     where = { userId: user.id };
     if (statusParam !== "TODOS") where.status = statusParam;

[Timeout] ObjectLiteral
services/vacationRequestListService.ts:64:13
 
   let where: Record<string, unknown>;
   if (user.role === "COLABORADOR" || user.role === "FUNCIONARIO") {
-    where = { userId: user.id };
+    where = {};
     if (statusParam !== "TODOS") where.status = statusParam;
     if (q || departmentParam) {

[Timeout] ConditionalExpression
services/vacationRequestListService.ts:65:9
   let where: Record<string, unknown>;
   if (user.role === "COLABORADOR" || user.role === "FUNCIONARIO") {
     where = { userId: user.id };
-    if (statusParam !== "TODOS") where.status = statusParam;
+    if (false) where.status = statusParam;
     if (q || departmentParam) {
       const userCond: Record<string, unknown> = {};

[Timeout] ConditionalExpression
services/vacationRequestListService.ts:65:9
   let where: Record<string, unknown>;
   if (user.role === "COLABORADOR" || user.role === "FUNCIONARIO") {
     where = { userId: user.id };
-    if (statusParam !== "TODOS") where.status = statusParam;
+    if (true) where.status = statusParam;
     if (q || departmentParam) {
       const userCond: Record<string, unknown> = {};

[Timeout] LogicalOperator
services/vacationRequestListService.ts:66:9
   if (user.role === "COLABORADOR" || user.role === "FUNCIONARIO") {
     where = { userId: user.id };
     if (statusParam !== "TODOS") where.status = statusParam;
-    if (q || departmentParam) {
+    if (q && departmentParam) {
       const userCond: Record<string, unknown> = {};
       if (q) userCond.name = { contains: q, mode: "insensitive" as const };

[Timeout] BlockStatement
services/vacationRequestListService.ts:66:31
   if (user.role === "COLABORADOR" || user.role === "FUNCIONARIO") {
     where = { userId: user.id };
     if (statusParam !== "TODOS") where.status = statusParam;
-    if (q || departmentParam) {
-      const userCond: Record<string, unknown> = {};
-      if (q) userCond.name = { contains: q, mode: "insensitive" as const };
-      if (departmentParam) userCond.department = departmentParam;
-      (where as Record<string, unknown>).user = userCond;
-    }
+    if (q || departmentParam) {}
   } else {
     where = buildManagedRequestsWhere(user.id, user.role, {

[Timeout] ConditionalExpression
services/vacationRequestListService.ts:68:11
     if (statusParam !== "TODOS") where.status = statusParam;
     if (q || departmentParam) {
       const userCond: Record<string, unknown> = {};
-      if (q) userCond.name = { contains: q, mode: "insensitive" as const };
+      if (false) userCond.name = { contains: q, mode: "insensitive" as const };
       if (departmentParam) userCond.department = departmentParam;
       (where as Record<string, unknown>).user = userCond;

[Timeout] ConditionalExpression
services/vacationRequestListService.ts:68:11
     if (statusParam !== "TODOS") where.status = statusParam;
     if (q || departmentParam) {
       const userCond: Record<string, unknown> = {};
-      if (q) userCond.name = { contains: q, mode: "insensitive" as const };
+      if (true) userCond.name = { contains: q, mode: "insensitive" as const };
       if (departmentParam) userCond.department = departmentParam;
       (where as Record<string, unknown>).user = userCond;

[Timeout] ConditionalExpression
services/vacationRequestListService.ts:69:11
     if (q || departmentParam) {
       const userCond: Record<string, unknown> = {};
       if (q) userCond.name = { contains: q, mode: "insensitive" as const };
-      if (departmentParam) userCond.department = departmentParam;
+      if (true) userCond.department = departmentParam;
       (where as Record<string, unknown>).user = userCond;
     }

[Timeout] ConditionalExpression
services/vacationRequestListService.ts:69:11
     if (q || departmentParam) {
       const userCond: Record<string, unknown> = {};
       if (q) userCond.name = { contains: q, mode: "insensitive" as const };
-      if (departmentParam) userCond.department = departmentParam;
+      if (false) userCond.department = departmentParam;
       (where as Record<string, unknown>).user = userCond;
     }

[Timeout] BlockStatement
services/vacationRequestListService.ts:72:10
       if (departmentParam) userCond.department = departmentParam;
       (where as Record<string, unknown>).user = userCond;
     }
-  } else {
-    where = buildManagedRequestsWhere(user.id, user.role, {
-      query: q || undefined,
-      status: statusParam !== "TODOS" ? statusParam : undefined,
-      department: departmentParam || undefined,
-    });
-  }
+  } else {}
 
   const requests = await prisma.vacationRequest.findMany({

[Timeout] ConditionalExpression
services/vacationRequestListService.ts:74:14
     }
   } else {
     where = buildManagedRequestsWhere(user.id, user.role, {
-      query: q || undefined,
+      query: true,
       status: statusParam !== "TODOS" ? statusParam : undefined,
       department: departmentParam || undefined,

[Timeout] LogicalOperator
services/vacationRequestListService.ts:74:14
     }
   } else {
     where = buildManagedRequestsWhere(user.id, user.role, {
-      query: q || undefined,
+      query: q && undefined,
       status: statusParam !== "TODOS" ? statusParam : undefined,
       department: departmentParam || undefined,

[Timeout] EqualityOperator
services/vacationRequestListService.ts:75:15
   } else {
     where = buildManagedRequestsWhere(user.id, user.role, {
       query: q || undefined,
-      status: statusParam !== "TODOS" ? statusParam : undefined,
+      status: statusParam === "TODOS" ? statusParam : undefined,
       department: departmentParam || undefined,
     });

[Timeout] ConditionalExpression
services/vacationRequestListService.ts:75:15
   } else {
     where = buildManagedRequestsWhere(user.id, user.role, {
       query: q || undefined,
-      status: statusParam !== "TODOS" ? statusParam : undefined,
+      status: false ? statusParam : undefined,
       department: departmentParam || undefined,
     });

[Timeout] ConditionalExpression
services/vacationRequestListService.ts:76:19
     where = buildManagedRequestsWhere(user.id, user.role, {
       query: q || undefined,
       status: statusParam !== "TODOS" ? statusParam : undefined,
-      department: departmentParam || undefined,
+      department: false,
     });
   }

[Timeout] ConditionalExpression
services/vacationRequestListService.ts:76:19
     where = buildManagedRequestsWhere(user.id, user.role, {
       query: q || undefined,
       status: statusParam !== "TODOS" ? statusParam : undefined,
-      department: departmentParam || undefined,
+      department: true,
     });
   }

[Timeout] ObjectLiteral
services/vacationRequestListService.ts:80:58
     });
   }
 
-  const requests = await prisma.vacationRequest.findMany({
-    where: where as Record<string, unknown>,
-    include: exportInclude,
-    orderBy: { startDate: "asc" },
-  });
+  const requests = await prisma.vacationRequest.findMany({});
 
   const dashboardFilters: DashboardFilters = {
